Paciente8159/uCNC/uCNC/src/hal/mcus/lpc176x/mcumap_lpc176x.h
/*
        Name: mcumap_lpc176x.h
        Description: Contains all MCU and PIN definitions for NXP LPC176x to run
   µCNC.

        Copyright: Copyright (c) João Martins
        Author: João Martins
        Date: 04-02-2020

        µCNC is free software: you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation, either version 3 of the License, or
        (at your option) any later version. Please see
   <http://www.gnu.org/licenses/>

        µCNC is distributed WITHOUT ANY WARRANTY;
        Also without the implied warranty of	MERCHANTABILITY or FITNESS FOR A
   PARTICULAR PURPOSE. See the	GNU General Public License for more details.
*/

#ifndef MCUMAP_LPC176X_H
#define MCUMAP_LPC176X_H

#ifdef __cplusplus
extern "C" {
#endif

/*
        Generates all the interface definitions.
        This creates a middle HAL layer between the board IO pins and the AVR
   funtionalities
*/
/*
        MCU specific definitions and replacements
*/
#include "LPC17xx.h"
#include "core_cm3.h"
#include "lpc17xx_adc.h"
#include "lpc17xx_clkpwr.h"
#include "lpc17xx_pinsel.h"
#include "lpc17xx_pwm.h"
#include "lpc17xx_systick.h"
#include "lpc17xx_timer.h"
#include "lpc17xx_uart.h"
#include "lpc_types.h"
#include <math.h>
#include <stdbool.h>
#include <stdint.h>

// defines the frequency of the mcu
#ifndef F_CPU
#define F_CPU 100000000UL
#endif
// defines the maximum and minimum step rates
#ifndef F_STEP_MAX
#define F_STEP_MAX 200000
#endif
#ifndef F_STEP_MIN
#define F_STEP_MIN 4
#endif
// defines special mcu to access flash strings and arrays
#define __rom__
#define __romstr__
#define __romarr__ const char
#define rom_strptr *
#define rom_strcpy strcpy
#define rom_strncpy strncpy
#define rom_memcpy memcpy
#define rom_read_byte *

// NVIC Priority levels
#define NVIC_INPUT_IRQ_Pri 1
#define NVIC_SPI_IRQ_Pri 3
#define NVIC_UART_IRQ_Pri 4
#define NVIC_ITP_IRQ_Pri 5
#define NVIC_ONESHOT_IRQ_Pri 6
#define NVIC_SERVO_IRQ_Pri 6
#define NVIC_RTC_IRQ_Pri 8
#define NVIC_I2C_IRQ_Pri 9
#define NVIC_USB_IRQ_Pri 10

#define __IM                                                                   \
  volatile const /*! Defines 'read only' structure member permissions */
#define __IOM                                                                  \
  volatile /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL;   /*!< Offset: 0x000 (R/W)  Control Register */
  __IOM uint32_t CYCCNT; /*!< Offset: 0x004 (R/W)  Cycle Count Register */
  __IOM uint32_t CPICNT; /*!< Offset: 0x008 (R/W)  CPI Count Register */
  __IOM uint32_t
      EXCCNT; /*!< Offset: 0x00C (R/W)  Exception Overhead Count Register */
  __IOM uint32_t SLEEPCNT; /*!< Offset: 0x010 (R/W)  Sleep Count Register */
  __IOM uint32_t LSUCNT;   /*!< Offset: 0x014 (R/W)  LSU Count Register */
  __IOM uint32_t
      FOLDCNT; /*!< Offset: 0x018 (R/W)  Folded-instruction Count Register */
  __IM uint32_t
      PCSR; /*!< Offset: 0x01C (R/ )  Program Counter Sample Register */
  __IOM uint32_t COMP0;     /*!< Offset: 0x020 (R/W)  Comparator Register 0 */
  __IOM uint32_t MASK0;     /*!< Offset: 0x024 (R/W)  Mask Register 0 */
  __IOM uint32_t FUNCTION0; /*!< Offset: 0x028 (R/W)  Function Register 0 */
  uint32_t RESERVED0[1U];
  __IOM uint32_t COMP1;     /*!< Offset: 0x030 (R/W)  Comparator Register 1 */
  __IOM uint32_t MASK1;     /*!< Offset: 0x034 (R/W)  Mask Register 1 */
  __IOM uint32_t FUNCTION1; /*!< Offset: 0x038 (R/W)  Function Register 1 */
  uint32_t RESERVED1[1U];
  __IOM uint32_t COMP2;     /*!< Offset: 0x040 (R/W)  Comparator Register 2 */
  __IOM uint32_t MASK2;     /*!< Offset: 0x044 (R/W)  Mask Register 2 */
  __IOM uint32_t FUNCTION2; /*!< Offset: 0x048 (R/W)  Function Register 2 */
  uint32_t RESERVED2[1U];
  __IOM uint32_t COMP3;     /*!< Offset: 0x050 (R/W)  Comparator Register 3 */
  __IOM uint32_t MASK3;     /*!< Offset: 0x054 (R/W)  Mask Register 3 */
  __IOM uint32_t FUNCTION3; /*!< Offset: 0x058 (R/W)  Function Register 3 */
} DWT_Type;

#define DWT_BASE (0xE0001000UL)    /*!< DWT Base Address */
#define DWT ((DWT_Type *)DWT_BASE) /*!< DWT configuration struct */

// custom cycle counter
#ifndef MCU_CYCLES_PER_LOOP
#define MCU_CYCLES_PER_LOOP 4
#endif
#ifndef MCU_CYCLES_LOOP_OVERHEAD
#define MCU_CYCLES_LOOP_OVERHEAD 1
#endif

#define mcu_delay_loop(X)                                                      \
  do {                                                                         \
    asm volatile("" ::: "memory");                                             \
    register uint16_t __count = (X);                                           \
    __asm__ volatile("1: sub %[cnt], %[cnt], #1\n" /* 1 cycle */               \
                     "   cmp %[cnt], #0\n"         /* 1 cycle */               \
                     "   bne 1b\n"                 /* 1–2 cycles */            \
                     "   nop\n"                    /* 1 cycle */               \
                     : [cnt] "+r"(__count)                                     \
                     :                                                         \
                     : "cc");                                                  \
    asm volatile("" ::: "memory");                                             \
  } while (0)

// Helper macros
#define __helper_ex__(left, mid, right) left##mid##right
#define __helper__(left, mid, right) __helper_ex__(left, mid, right)

#define __mbedpin_ex__(port, pin) P##port##_##pin
#define __mbedpin__(port, pin) __mbedpin_ex__(port, pin)

#define __gpioreg__(X) __helper__(LPC_GPIO, X, )
#define __pinmodereg__(X) __helper__(PINMODE, X, )

#define PINCON_0_L 0
#define PINCON_0_H 1
#define PINCON_1_L 2
#define PINCON_1_H 3
#define PINCON_2_L 4
#define PINCON_2_H 5
#define PINCON_3_L 6
#define PINCON_3_H 7
#define PINCON_4_L 8
#define PINCON_4_H 9
#define __pincon(X, Y) PINCON_##X##_##Y
#define __pincon__(X, Y) __pincon(X, Y)

