Paciente8159/uCNC/uCNC/src/hal/mcus/lpc176x/mcumap_lpc176x.h
#if (defined(STEP0_PORT) && defined(STEP0_BIT))
#define STEP0 1
#define STEP0_MBED_PIN __mbedpin__(STEP0_PORT, STEP0_BIT)
#define STEP0_GPIOREG __gpioreg__(STEP0_PORT)
#if (STEP0_BIT < 16)
#define STEP0_PINHALF L
#else
#define STEP0_PINHALF H
#endif
#define STEP0_PINCON __pincon__(STEP0_PORT, STEP0_PINHALF)
#define DIO1 1
#define DIO1_MBED_PIN STEP0_MBED_PIN
#define DIO1_PORT STEP0_PORT
#define DIO1_BIT STEP0_BIT
#define DIO1_GPIOREG STEP0_GPIOREG
#define DIO1_PINHALF STEP0_PINHALF
#define DIO1_PINCON STEP0_PINCON
#endif
#if (defined(STEP1_PORT) && defined(STEP1_BIT))
#define STEP1 2
#define STEP1_MBED_PIN __mbedpin__(STEP1_PORT, STEP1_BIT)
#define STEP1_GPIOREG __gpioreg__(STEP1_PORT)
#if (STEP1_BIT < 16)
#define STEP1_PINHALF L
#else
#define STEP1_PINHALF H
#endif
#define STEP1_PINCON __pincon__(STEP1_PORT, STEP1_PINHALF)
#define DIO2 2
#define DIO2_MBED_PIN STEP1_MBED_PIN
#define DIO2_PORT STEP1_PORT
#define DIO2_BIT STEP1_BIT
#define DIO2_GPIOREG STEP1_GPIOREG
#define DIO2_PINHALF STEP1_PINHALF
#define DIO2_PINCON STEP1_PINCON
#endif
#if (defined(STEP2_PORT) && defined(STEP2_BIT))
#define STEP2 3
#define STEP2_MBED_PIN __mbedpin__(STEP2_PORT, STEP2_BIT)
#define STEP2_GPIOREG __gpioreg__(STEP2_PORT)
#if (STEP2_BIT < 16)
#define STEP2_PINHALF L
#else
#define STEP2_PINHALF H
#endif
#define STEP2_PINCON __pincon__(STEP2_PORT, STEP2_PINHALF)
#define DIO3 3
#define DIO3_MBED_PIN STEP2_MBED_PIN
#define DIO3_PORT STEP2_PORT
#define DIO3_BIT STEP2_BIT
#define DIO3_GPIOREG STEP2_GPIOREG
#define DIO3_PINHALF STEP2_PINHALF
#define DIO3_PINCON STEP2_PINCON
#endif
#if (defined(STEP3_PORT) && defined(STEP3_BIT))
#define STEP3 4
#define STEP3_MBED_PIN __mbedpin__(STEP3_PORT, STEP3_BIT)
#define STEP3_GPIOREG __gpioreg__(STEP3_PORT)
#if (STEP3_BIT < 16)
#define STEP3_PINHALF L
#else
#define STEP3_PINHALF H
#endif
#define STEP3_PINCON __pincon__(STEP3_PORT, STEP3_PINHALF)
#define DIO4 4
#define DIO4_MBED_PIN STEP3_MBED_PIN
#define DIO4_PORT STEP3_PORT
#define DIO4_BIT STEP3_BIT
#define DIO4_GPIOREG STEP3_GPIOREG
#define DIO4_PINHALF STEP3_PINHALF
#define DIO4_PINCON STEP3_PINCON
#endif
#if (defined(STEP4_PORT) && defined(STEP4_BIT))
#define STEP4 5
#define STEP4_MBED_PIN __mbedpin__(STEP4_PORT, STEP4_BIT)
#define STEP4_GPIOREG __gpioreg__(STEP4_PORT)
#if (STEP4_BIT < 16)
#define STEP4_PINHALF L
#else
#define STEP4_PINHALF H
#endif
#define STEP4_PINCON __pincon__(STEP4_PORT, STEP4_PINHALF)
#define DIO5 5
#define DIO5_MBED_PIN STEP4_MBED_PIN
#define DIO5_PORT STEP4_PORT
#define DIO5_BIT STEP4_BIT
#define DIO5_GPIOREG STEP4_GPIOREG
#define DIO5_PINHALF STEP4_PINHALF
#define DIO5_PINCON STEP4_PINCON
#endif
#if (defined(STEP5_PORT) && defined(STEP5_BIT))
#define STEP5 6
#define STEP5_MBED_PIN __mbedpin__(STEP5_PORT, STEP5_BIT)
#define STEP5_GPIOREG __gpioreg__(STEP5_PORT)
#if (STEP5_BIT < 16)
#define STEP5_PINHALF L
#else
#define STEP5_PINHALF H
#endif
#define STEP5_PINCON __pincon__(STEP5_PORT, STEP5_PINHALF)
#define DIO6 6
#define DIO6_MBED_PIN STEP5_MBED_PIN
#define DIO6_PORT STEP5_PORT
#define DIO6_BIT STEP5_BIT
#define DIO6_GPIOREG STEP5_GPIOREG
#define DIO6_PINHALF STEP5_PINHALF
#define DIO6_PINCON STEP5_PINCON
#endif
#if (defined(STEP6_PORT) && defined(STEP6_BIT))
#define STEP6 7
#define STEP6_MBED_PIN __mbedpin__(STEP6_PORT, STEP6_BIT)
#define STEP6_GPIOREG __gpioreg__(STEP6_PORT)
#if (STEP6_BIT < 16)
#define STEP6_PINHALF L
#else
#define STEP6_PINHALF H
#endif
#define STEP6_PINCON __pincon__(STEP6_PORT, STEP6_PINHALF)
#define DIO7 7
#define DIO7_MBED_PIN STEP6_MBED_PIN
#define DIO7_PORT STEP6_PORT
#define DIO7_BIT STEP6_BIT
#define DIO7_GPIOREG STEP6_GPIOREG
#define DIO7_PINHALF STEP6_PINHALF
#define DIO7_PINCON STEP6_PINCON
#endif
#if (defined(STEP7_PORT) && defined(STEP7_BIT))
#define STEP7 8
#define STEP7_MBED_PIN __mbedpin__(STEP7_PORT, STEP7_BIT)
#define STEP7_GPIOREG __gpioreg__(STEP7_PORT)
#if (STEP7_BIT < 16)
#define STEP7_PINHALF L
#else
#define STEP7_PINHALF H
#endif
#define STEP7_PINCON __pincon__(STEP7_PORT, STEP7_PINHALF)
#define DIO8 8
#define DIO8_MBED_PIN STEP7_MBED_PIN
#define DIO8_PORT STEP7_PORT
#define DIO8_BIT STEP7_BIT
#define DIO8_GPIOREG STEP7_GPIOREG
#define DIO8_PINHALF STEP7_PINHALF
#define DIO8_PINCON STEP7_PINCON
#endif
#if (defined(DIR0_PORT) && defined(DIR0_BIT))
#define DIR0 9
#define DIR0_MBED_PIN __mbedpin__(DIR0_PORT, DIR0_BIT)
#define DIR0_GPIOREG __gpioreg__(DIR0_PORT)
#if (DIR0_BIT < 16)
#define DIR0_PINHALF L
#else
#define DIR0_PINHALF H
#endif
#define DIR0_PINCON __pincon__(DIR0_PORT, DIR0_PINHALF)
#define DIO9 9
#define DIO9_MBED_PIN DIR0_MBED_PIN
#define DIO9_PORT DIR0_PORT
#define DIO9_BIT DIR0_BIT
#define DIO9_GPIOREG DIR0_GPIOREG
#define DIO9_PINHALF DIR0_PINHALF
#define DIO9_PINCON DIR0_PINCON
#endif
#if (defined(DIR1_PORT) && defined(DIR1_BIT))
#define DIR1 10
#define DIR1_MBED_PIN __mbedpin__(DIR1_PORT, DIR1_BIT)
#define DIR1_GPIOREG __gpioreg__(DIR1_PORT)
#if (DIR1_BIT < 16)
#define DIR1_PINHALF L
#else
#define DIR1_PINHALF H
#endif
#define DIR1_PINCON __pincon__(DIR1_PORT, DIR1_PINHALF)
#define DIO10 10
#define DIO10_MBED_PIN DIR1_MBED_PIN
#define DIO10_PORT DIR1_PORT
#define DIO10_BIT DIR1_BIT
#define DIO10_GPIOREG DIR1_GPIOREG
#define DIO10_PINHALF DIR1_PINHALF
#define DIO10_PINCON DIR1_PINCON
#endif
#if (defined(DIR2_PORT) && defined(DIR2_BIT))
#define DIR2 11
#define DIR2_MBED_PIN __mbedpin__(DIR2_PORT, DIR2_BIT)
#define DIR2_GPIOREG __gpioreg__(DIR2_PORT)
#if (DIR2_BIT < 16)
#define DIR2_PINHALF L
#else
#define DIR2_PINHALF H
#endif
#define DIR2_PINCON __pincon__(DIR2_PORT, DIR2_PINHALF)
#define DIO11 11
#define DIO11_MBED_PIN DIR2_MBED_PIN
#define DIO11_PORT DIR2_PORT
#define DIO11_BIT DIR2_BIT
#define DIO11_GPIOREG DIR2_GPIOREG
#define DIO11_PINHALF DIR2_PINHALF
#define DIO11_PINCON DIR2_PINCON
#endif
#if (defined(DIR3_PORT) && defined(DIR3_BIT))
#define DIR3 12
#define DIR3_MBED_PIN __mbedpin__(DIR3_PORT, DIR3_BIT)
#define DIR3_GPIOREG __gpioreg__(DIR3_PORT)
#if (DIR3_BIT < 16)
#define DIR3_PINHALF L
#else
#define DIR3_PINHALF H
#endif
#define DIR3_PINCON __pincon__(DIR3_PORT, DIR3_PINHALF)
#define DIO12 12
#define DIO12_MBED_PIN DIR3_MBED_PIN
#define DIO12_PORT DIR3_PORT
#define DIO12_BIT DIR3_BIT
#define DIO12_GPIOREG DIR3_GPIOREG
#define DIO12_PINHALF DIR3_PINHALF
#define DIO12_PINCON DIR3_PINCON
#endif
#if (defined(DIR4_PORT) && defined(DIR4_BIT))
#define DIR4 13
#define DIR4_MBED_PIN __mbedpin__(DIR4_PORT, DIR4_BIT)
#define DIR4_GPIOREG __gpioreg__(DIR4_PORT)
#if (DIR4_BIT < 16)
#define DIR4_PINHALF L
#else
#define DIR4_PINHALF H
#endif
#define DIR4_PINCON __pincon__(DIR4_PORT, DIR4_PINHALF)
#define DIO13 13
#define DIO13_MBED_PIN DIR4_MBED_PIN
#define DIO13_PORT DIR4_PORT
#define DIO13_BIT DIR4_BIT
#define DIO13_GPIOREG DIR4_GPIOREG
#define DIO13_PINHALF DIR4_PINHALF
#define DIO13_PINCON DIR4_PINCON
#endif
#if (defined(DIR5_PORT) && defined(DIR5_BIT))
#define DIR5 14
#define DIR5_MBED_PIN __mbedpin__(DIR5_PORT, DIR5_BIT)
#define DIR5_GPIOREG __gpioreg__(DIR5_PORT)
#if (DIR5_BIT < 16)
#define DIR5_PINHALF L
#else
#define DIR5_PINHALF H
#endif
#define DIR5_PINCON __pincon__(DIR5_PORT, DIR5_PINHALF)
#define DIO14 14
#define DIO14_MBED_PIN DIR5_MBED_PIN
#define DIO14_PORT DIR5_PORT
#define DIO14_BIT DIR5_BIT
#define DIO14_GPIOREG DIR5_GPIOREG
#define DIO14_PINHALF DIR5_PINHALF
#define DIO14_PINCON DIR5_PINCON
#endif
#if (defined(DIR6_PORT) && defined(DIR6_BIT))
#define DIR6 15
#define DIR6_MBED_PIN __mbedpin__(DIR6_PORT, DIR6_BIT)
#define DIR6_GPIOREG __gpioreg__(DIR6_PORT)
#if (DIR6_BIT < 16)
#define DIR6_PINHALF L
#else
#define DIR6_PINHALF H
#endif
#define DIR6_PINCON __pincon__(DIR6_PORT, DIR6_PINHALF)
#define DIO15 15
#define DIO15_MBED_PIN DIR6_MBED_PIN
#define DIO15_PORT DIR6_PORT
#define DIO15_BIT DIR6_BIT
#define DIO15_GPIOREG DIR6_GPIOREG
#define DIO15_PINHALF DIR6_PINHALF
#define DIO15_PINCON DIR6_PINCON
#endif
#if (defined(DIR7_PORT) && defined(DIR7_BIT))
#define DIR7 16
#define DIR7_MBED_PIN __mbedpin__(DIR7_PORT, DIR7_BIT)
#define DIR7_GPIOREG __gpioreg__(DIR7_PORT)
#if (DIR7_BIT < 16)
#define DIR7_PINHALF L
#else
#define DIR7_PINHALF H
#endif
#define DIR7_PINCON __pincon__(DIR7_PORT, DIR7_PINHALF)
#define DIO16 16
#define DIO16_MBED_PIN DIR7_MBED_PIN
#define DIO16_PORT DIR7_PORT
#define DIO16_BIT DIR7_BIT
#define DIO16_GPIOREG DIR7_GPIOREG
#define DIO16_PINHALF DIR7_PINHALF
#define DIO16_PINCON DIR7_PINCON
#endif
#if (defined(STEP0_EN_PORT) && defined(STEP0_EN_BIT))
#define STEP0_EN 17
#define STEP0_EN_MBED_PIN __mbedpin__(STEP0_EN_PORT, STEP0_EN_BIT)
#define STEP0_EN_GPIOREG __gpioreg__(STEP0_EN_PORT)
#if (STEP0_EN_BIT < 16)
#define STEP0_EN_PINHALF L
#else
#define STEP0_EN_PINHALF H
#endif
#define STEP0_EN_PINCON __pincon__(STEP0_EN_PORT, STEP0_EN_PINHALF)
#define DIO17 17
#define DIO17_MBED_PIN STEP0_EN_MBED_PIN
#define DIO17_PORT STEP0_EN_PORT
#define DIO17_BIT STEP0_EN_BIT
#define DIO17_GPIOREG STEP0_EN_GPIOREG
#define DIO17_PINHALF STEP0_EN_PINHALF
#define DIO17_PINCON STEP0_EN_PINCON
#endif
#if (defined(STEP1_EN_PORT) && defined(STEP1_EN_BIT))
#define STEP1_EN 18
#define STEP1_EN_MBED_PIN __mbedpin__(STEP1_EN_PORT, STEP1_EN_BIT)
#define STEP1_EN_GPIOREG __gpioreg__(STEP1_EN_PORT)
#if (STEP1_EN_BIT < 16)
#define STEP1_EN_PINHALF L
#else
#define STEP1_EN_PINHALF H
#endif
#define STEP1_EN_PINCON __pincon__(STEP1_EN_PORT, STEP1_EN_PINHALF)
#define DIO18 18
#define DIO18_MBED_PIN STEP1_EN_MBED_PIN
#define DIO18_PORT STEP1_EN_PORT
#define DIO18_BIT STEP1_EN_BIT
#define DIO18_GPIOREG STEP1_EN_GPIOREG
#define DIO18_PINHALF STEP1_EN_PINHALF
#define DIO18_PINCON STEP1_EN_PINCON
#endif
#if (defined(STEP2_EN_PORT) && defined(STEP2_EN_BIT))
#define STEP2_EN 19
#define STEP2_EN_MBED_PIN __mbedpin__(STEP2_EN_PORT, STEP2_EN_BIT)
#define STEP2_EN_GPIOREG __gpioreg__(STEP2_EN_PORT)
#if (STEP2_EN_BIT < 16)
#define STEP2_EN_PINHALF L
#else
#define STEP2_EN_PINHALF H
#endif
#define STEP2_EN_PINCON __pincon__(STEP2_EN_PORT, STEP2_EN_PINHALF)
#define DIO19 19
#define DIO19_MBED_PIN STEP2_EN_MBED_PIN
#define DIO19_PORT STEP2_EN_PORT
#define DIO19_BIT STEP2_EN_BIT
#define DIO19_GPIOREG STEP2_EN_GPIOREG
#define DIO19_PINHALF STEP2_EN_PINHALF
#define DIO19_PINCON STEP2_EN_PINCON
#endif
#if (defined(STEP3_EN_PORT) && defined(STEP3_EN_BIT))
#define STEP3_EN 20
#define STEP3_EN_MBED_PIN __mbedpin__(STEP3_EN_PORT, STEP3_EN_BIT)
#define STEP3_EN_GPIOREG __gpioreg__(STEP3_EN_PORT)
#if (STEP3_EN_BIT < 16)
#define STEP3_EN_PINHALF L
#else
#define STEP3_EN_PINHALF H
#endif
#define STEP3_EN_PINCON __pincon__(STEP3_EN_PORT, STEP3_EN_PINHALF)
#define DIO20 20
#define DIO20_MBED_PIN STEP3_EN_MBED_PIN
#define DIO20_PORT STEP3_EN_PORT
#define DIO20_BIT STEP3_EN_BIT
#define DIO20_GPIOREG STEP3_EN_GPIOREG
#define DIO20_PINHALF STEP3_EN_PINHALF
#define DIO20_PINCON STEP3_EN_PINCON
#endif
#if (defined(STEP4_EN_PORT) && defined(STEP4_EN_BIT))
#define STEP4_EN 21
#define STEP4_EN_MBED_PIN __mbedpin__(STEP4_EN_PORT, STEP4_EN_BIT)
#define STEP4_EN_GPIOREG __gpioreg__(STEP4_EN_PORT)
#if (STEP4_EN_BIT < 16)
#define STEP4_EN_PINHALF L
#else
#define STEP4_EN_PINHALF H
#endif
#define STEP4_EN_PINCON __pincon__(STEP4_EN_PORT, STEP4_EN_PINHALF)
#define DIO21 21
#define DIO21_MBED_PIN STEP4_EN_MBED_PIN
#define DIO21_PORT STEP4_EN_PORT
#define DIO21_BIT STEP4_EN_BIT
#define DIO21_GPIOREG STEP4_EN_GPIOREG
#define DIO21_PINHALF STEP4_EN_PINHALF
#define DIO21_PINCON STEP4_EN_PINCON
#endif
#if (defined(STEP5_EN_PORT) && defined(STEP5_EN_BIT))
#define STEP5_EN 22
#define STEP5_EN_MBED_PIN __mbedpin__(STEP5_EN_PORT, STEP5_EN_BIT)
#define STEP5_EN_GPIOREG __gpioreg__(STEP5_EN_PORT)
#if (STEP5_EN_BIT < 16)
#define STEP5_EN_PINHALF L
#else
#define STEP5_EN_PINHALF H
#endif
#define STEP5_EN_PINCON __pincon__(STEP5_EN_PORT, STEP5_EN_PINHALF)
#define DIO22 22
#define DIO22_MBED_PIN STEP5_EN_MBED_PIN
#define DIO22_PORT STEP5_EN_PORT
#define DIO22_BIT STEP5_EN_BIT
#define DIO22_GPIOREG STEP5_EN_GPIOREG
#define DIO22_PINHALF STEP5_EN_PINHALF
#define DIO22_PINCON STEP5_EN_PINCON
#endif
#if (defined(STEP6_EN_PORT) && defined(STEP6_EN_BIT))
#define STEP6_EN 23
#define STEP6_EN_MBED_PIN __mbedpin__(STEP6_EN_PORT, STEP6_EN_BIT)
#define STEP6_EN_GPIOREG __gpioreg__(STEP6_EN_PORT)
#if (STEP6_EN_BIT < 16)
#define STEP6_EN_PINHALF L
#else
#define STEP6_EN_PINHALF H
#endif
#define STEP6_EN_PINCON __pincon__(STEP6_EN_PORT, STEP6_EN_PINHALF)
#define DIO23 23
#define DIO23_MBED_PIN STEP6_EN_MBED_PIN
#define DIO23_PORT STEP6_EN_PORT
#define DIO23_BIT STEP6_EN_BIT
#define DIO23_GPIOREG STEP6_EN_GPIOREG
#define DIO23_PINHALF STEP6_EN_PINHALF
#define DIO23_PINCON STEP6_EN_PINCON
#endif
#if (defined(STEP7_EN_PORT) && defined(STEP7_EN_BIT))
#define STEP7_EN 24
#define STEP7_EN_MBED_PIN __mbedpin__(STEP7_EN_PORT, STEP7_EN_BIT)
#define STEP7_EN_GPIOREG __gpioreg__(STEP7_EN_PORT)
#if (STEP7_EN_BIT < 16)
#define STEP7_EN_PINHALF L
#else
#define STEP7_EN_PINHALF H
#endif
#define STEP7_EN_PINCON __pincon__(STEP7_EN_PORT, STEP7_EN_PINHALF)
#define DIO24 24
#define DIO24_MBED_PIN STEP7_EN_MBED_PIN
#define DIO24_PORT STEP7_EN_PORT
#define DIO24_BIT STEP7_EN_BIT
#define DIO24_GPIOREG STEP7_EN_GPIOREG
#define DIO24_PINHALF STEP7_EN_PINHALF
#define DIO24_PINCON STEP7_EN_PINCON
#endif
#if (defined(PWM0_PORT) && defined(PWM0_BIT))
#define PWM0 25
#define PWM0_MBED_PIN __mbedpin__(PWM0_PORT, PWM0_BIT)
#define PWM0_GPIOREG __gpioreg__(PWM0_PORT)
#if (PWM0_BIT < 16)
#define PWM0_PINHALF L
#else
#define PWM0_PINHALF H
#endif
#define PWM0_PINCON __pincon__(PWM0_PORT, PWM0_PINHALF)
#define DIO25 25
#define DIO25_MBED_PIN PWM0_MBED_PIN
#define DIO25_PORT PWM0_PORT
#define DIO25_BIT PWM0_BIT
#define DIO25_GPIOREG PWM0_GPIOREG
#define DIO25_PINHALF PWM0_PINHALF
#define DIO25_PINCON PWM0_PINCON
#endif
#if (defined(PWM1_PORT) && defined(PWM1_BIT))
#define PWM1 26
#define PWM1_MBED_PIN __mbedpin__(PWM1_PORT, PWM1_BIT)
#define PWM1_GPIOREG __gpioreg__(PWM1_PORT)
#if (PWM1_BIT < 16)
#define PWM1_PINHALF L
#else
#define PWM1_PINHALF H
#endif
#define PWM1_PINCON __pincon__(PWM1_PORT, PWM1_PINHALF)
#define DIO26 26
#define DIO26_MBED_PIN PWM1_MBED_PIN
#define DIO26_PORT PWM1_PORT
#define DIO26_BIT PWM1_BIT
#define DIO26_GPIOREG PWM1_GPIOREG
#define DIO26_PINHALF PWM1_PINHALF
#define DIO26_PINCON PWM1_PINCON
#endif
#if (defined(PWM2_PORT) && defined(PWM2_BIT))
#define PWM2 27
#define PWM2_MBED_PIN __mbedpin__(PWM2_PORT, PWM2_BIT)
#define PWM2_GPIOREG __gpioreg__(PWM2_PORT)
#if (PWM2_BIT < 16)
#define PWM2_PINHALF L
#else
#define PWM2_PINHALF H
#endif
#define PWM2_PINCON __pincon__(PWM2_PORT, PWM2_PINHALF)
#define DIO27 27
#define DIO27_MBED_PIN PWM2_MBED_PIN
#define DIO27_PORT PWM2_PORT
#define DIO27_BIT PWM2_BIT
#define DIO27_GPIOREG PWM2_GPIOREG
#define DIO27_PINHALF PWM2_PINHALF
#define DIO27_PINCON PWM2_PINCON
#endif
#if (defined(PWM3_PORT) && defined(PWM3_BIT))
#define PWM3 28
#define PWM3_MBED_PIN __mbedpin__(PWM3_PORT, PWM3_BIT)
#define PWM3_GPIOREG __gpioreg__(PWM3_PORT)
#if (PWM3_BIT < 16)
#define PWM3_PINHALF L
#else
#define PWM3_PINHALF H
#endif
#define PWM3_PINCON __pincon__(PWM3_PORT, PWM3_PINHALF)
#define DIO28 28
#define DIO28_MBED_PIN PWM3_MBED_PIN
#define DIO28_PORT PWM3_PORT
#define DIO28_BIT PWM3_BIT
#define DIO28_GPIOREG PWM3_GPIOREG
#define DIO28_PINHALF PWM3_PINHALF
#define DIO28_PINCON PWM3_PINCON
#endif
#if (defined(PWM4_PORT) && defined(PWM4_BIT))
#define PWM4 29
#define PWM4_MBED_PIN __mbedpin__(PWM4_PORT, PWM4_BIT)
#define PWM4_GPIOREG __gpioreg__(PWM4_PORT)
#if (PWM4_BIT < 16)
#define PWM4_PINHALF L
#else
#define PWM4_PINHALF H
#endif
#define PWM4_PINCON __pincon__(PWM4_PORT, PWM4_PINHALF)
#define DIO29 29
#define DIO29_MBED_PIN PWM4_MBED_PIN
#define DIO29_PORT PWM4_PORT
#define DIO29_BIT PWM4_BIT
#define DIO29_GPIOREG PWM4_GPIOREG
#define DIO29_PINHALF PWM4_PINHALF
#define DIO29_PINCON PWM4_PINCON
#endif
#if (defined(PWM5_PORT) && defined(PWM5_BIT))
#define PWM5 30
#define PWM5_MBED_PIN __mbedpin__(PWM5_PORT, PWM5_BIT)
#define PWM5_GPIOREG __gpioreg__(PWM5_PORT)
#if (PWM5_BIT < 16)
#define PWM5_PINHALF L
#else
#define PWM5_PINHALF H
#endif
#define PWM5_PINCON __pincon__(PWM5_PORT, PWM5_PINHALF)
#define DIO30 30
#define DIO30_MBED_PIN PWM5_MBED_PIN
#define DIO30_PORT PWM5_PORT
#define DIO30_BIT PWM5_BIT
#define DIO30_GPIOREG PWM5_GPIOREG
#define DIO30_PINHALF PWM5_PINHALF
#define DIO30_PINCON PWM5_PINCON
#endif
#if (defined(PWM6_PORT) && defined(PWM6_BIT))
#define PWM6 31
#define PWM6_MBED_PIN __mbedpin__(PWM6_PORT, PWM6_BIT)
#define PWM6_GPIOREG __gpioreg__(PWM6_PORT)
#if (PWM6_BIT < 16)
#define PWM6_PINHALF L
#else
#define PWM6_PINHALF H
#endif
#define PWM6_PINCON __pincon__(PWM6_PORT, PWM6_PINHALF)
#define DIO31 31
#define DIO31_MBED_PIN PWM6_MBED_PIN
#define DIO31_PORT PWM6_PORT
#define DIO31_BIT PWM6_BIT
#define DIO31_GPIOREG PWM6_GPIOREG
#define DIO31_PINHALF PWM6_PINHALF
#define DIO31_PINCON PWM6_PINCON
#endif
#if (defined(PWM7_PORT) && defined(PWM7_BIT))
#define PWM7 32
#define PWM7_MBED_PIN __mbedpin__(PWM7_PORT, PWM7_BIT)
#define PWM7_GPIOREG __gpioreg__(PWM7_PORT)
#if (PWM7_BIT < 16)
#define PWM7_PINHALF L
#else
#define PWM7_PINHALF H
#endif
#define PWM7_PINCON __pincon__(PWM7_PORT, PWM7_PINHALF)
#define DIO32 32
#define DIO32_MBED_PIN PWM7_MBED_PIN
#define DIO32_PORT PWM7_PORT
#define DIO32_BIT PWM7_BIT
#define DIO32_GPIOREG PWM7_GPIOREG
#define DIO32_PINHALF PWM7_PINHALF
#define DIO32_PINCON PWM7_PINCON
#endif
#if (defined(PWM8_PORT) && defined(PWM8_BIT))
#define PWM8 33
#define PWM8_MBED_PIN __mbedpin__(PWM8_PORT, PWM8_BIT)
#define PWM8_GPIOREG __gpioreg__(PWM8_PORT)
#if (PWM8_BIT < 16)
#define PWM8_PINHALF L
#else
#define PWM8_PINHALF H
#endif
#define PWM8_PINCON __pincon__(PWM8_PORT, PWM8_PINHALF)
#define DIO33 33
#define DIO33_MBED_PIN PWM8_MBED_PIN
#define DIO33_PORT PWM8_PORT
#define DIO33_BIT PWM8_BIT
#define DIO33_GPIOREG PWM8_GPIOREG
#define DIO33_PINHALF PWM8_PINHALF
#define DIO33_PINCON PWM8_PINCON
#endif
#if (defined(PWM9_PORT) && defined(PWM9_BIT))
#define PWM9 34
#define PWM9_MBED_PIN __mbedpin__(PWM9_PORT, PWM9_BIT)
#define PWM9_GPIOREG __gpioreg__(PWM9_PORT)
#if (PWM9_BIT < 16)
#define PWM9_PINHALF L
#else
#define PWM9_PINHALF H
#endif
#define PWM9_PINCON __pincon__(PWM9_PORT, PWM9_PINHALF)
#define DIO34 34
#define DIO34_MBED_PIN PWM9_MBED_PIN
#define DIO34_PORT PWM9_PORT
#define DIO34_BIT PWM9_BIT
#define DIO34_GPIOREG PWM9_GPIOREG
#define DIO34_PINHALF PWM9_PINHALF
#define DIO34_PINCON PWM9_PINCON
#endif
#if (defined(PWM10_PORT) && defined(PWM10_BIT))
#define PWM10 35
#define PWM10_MBED_PIN __mbedpin__(PWM10_PORT, PWM10_BIT)
#define PWM10_GPIOREG __gpioreg__(PWM10_PORT)
#if (PWM10_BIT < 16)
#define PWM10_PINHALF L
#else
#define PWM10_PINHALF H
#endif
#define PWM10_PINCON __pincon__(PWM10_PORT, PWM10_PINHALF)
#define DIO35 35
#define DIO35_MBED_PIN PWM10_MBED_PIN
#define DIO35_PORT PWM10_PORT
#define DIO35_BIT PWM10_BIT
#define DIO35_GPIOREG PWM10_GPIOREG
#define DIO35_PINHALF PWM10_PINHALF
#define DIO35_PINCON PWM10_PINCON
#endif
#if (defined(PWM11_PORT) && defined(PWM11_BIT))
#define PWM11 36
#define PWM11_MBED_PIN __mbedpin__(PWM11_PORT, PWM11_BIT)
#define PWM11_GPIOREG __gpioreg__(PWM11_PORT)
#if (PWM11_BIT < 16)
#define PWM11_PINHALF L
#else
#define PWM11_PINHALF H
#endif
#define PWM11_PINCON __pincon__(PWM11_PORT, PWM11_PINHALF)
#define DIO36 36
#define DIO36_MBED_PIN PWM11_MBED_PIN
#define DIO36_PORT PWM11_PORT
#define DIO36_BIT PWM11_BIT
#define DIO36_GPIOREG PWM11_GPIOREG
#define DIO36_PINHALF PWM11_PINHALF
#define DIO36_PINCON PWM11_PINCON
#endif
#if (defined(PWM12_PORT) && defined(PWM12_BIT))
#define PWM12 37
#define PWM12_MBED_PIN __mbedpin__(PWM12_PORT, PWM12_BIT)
#define PWM12_GPIOREG __gpioreg__(PWM12_PORT)
#if (PWM12_BIT < 16)
#define PWM12_PINHALF L
#else
#define PWM12_PINHALF H
#endif
#define PWM12_PINCON __pincon__(PWM12_PORT, PWM12_PINHALF)
#define DIO37 37
#define DIO37_MBED_PIN PWM12_MBED_PIN
#define DIO37_PORT PWM12_PORT
#define DIO37_BIT PWM12_BIT
#define DIO37_GPIOREG PWM12_GPIOREG
#define DIO37_PINHALF PWM12_PINHALF
#define DIO37_PINCON PWM12_PINCON
#endif
#if (defined(PWM13_PORT) && defined(PWM13_BIT))
#define PWM13 38
#define PWM13_MBED_PIN __mbedpin__(PWM13_PORT, PWM13_BIT)
#define PWM13_GPIOREG __gpioreg__(PWM13_PORT)
#if (PWM13_BIT < 16)
#define PWM13_PINHALF L
#else
#define PWM13_PINHALF H
#endif
#define PWM13_PINCON __pincon__(PWM13_PORT, PWM13_PINHALF)
#define DIO38 38
#define DIO38_MBED_PIN PWM13_MBED_PIN
#define DIO38_PORT PWM13_PORT
#define DIO38_BIT PWM13_BIT
#define DIO38_GPIOREG PWM13_GPIOREG
#define DIO38_PINHALF PWM13_PINHALF
#define DIO38_PINCON PWM13_PINCON
#endif
#if (defined(PWM14_PORT) && defined(PWM14_BIT))
#define PWM14 39
#define PWM14_MBED_PIN __mbedpin__(PWM14_PORT, PWM14_BIT)
#define PWM14_GPIOREG __gpioreg__(PWM14_PORT)
#if (PWM14_BIT < 16)
#define PWM14_PINHALF L
#else
#define PWM14_PINHALF H
#endif
#define PWM14_PINCON __pincon__(PWM14_PORT, PWM14_PINHALF)
#define DIO39 39
#define DIO39_MBED_PIN PWM14_MBED_PIN
#define DIO39_PORT PWM14_PORT
#define DIO39_BIT PWM14_BIT
#define DIO39_GPIOREG PWM14_GPIOREG
#define DIO39_PINHALF PWM14_PINHALF
#define DIO39_PINCON PWM14_PINCON
#endif
#if (defined(PWM15_PORT) && defined(PWM15_BIT))
#define PWM15 40
#define PWM15_MBED_PIN __mbedpin__(PWM15_PORT, PWM15_BIT)
#define PWM15_GPIOREG __gpioreg__(PWM15_PORT)
#if (PWM15_BIT < 16)
#define PWM15_PINHALF L
#else
#define PWM15_PINHALF H
#endif
#define PWM15_PINCON __pincon__(PWM15_PORT, PWM15_PINHALF)
#define DIO40 40
#define DIO40_MBED_PIN PWM15_MBED_PIN
#define DIO40_PORT PWM15_PORT
#define DIO40_BIT PWM15_BIT
#define DIO40_GPIOREG PWM15_GPIOREG
#define DIO40_PINHALF PWM15_PINHALF
#define DIO40_PINCON PWM15_PINCON
#endif
#if (defined(SERVO0_PORT) && defined(SERVO0_BIT))
#define SERVO0 41
#define SERVO0_MBED_PIN __mbedpin__(SERVO0_PORT, SERVO0_BIT)
#define SERVO0_GPIOREG __gpioreg__(SERVO0_PORT)
#if (SERVO0_BIT < 16)
#define SERVO0_PINHALF L
#else
#define SERVO0_PINHALF H
#endif
#define SERVO0_PINCON __pincon__(SERVO0_PORT, SERVO0_PINHALF)
#define DIO41 41
#define DIO41_MBED_PIN SERVO0_MBED_PIN
#define DIO41_PORT SERVO0_PORT
#define DIO41_BIT SERVO0_BIT
#define DIO41_GPIOREG SERVO0_GPIOREG
#define DIO41_PINHALF SERVO0_PINHALF
#define DIO41_PINCON SERVO0_PINCON
#endif
#if (defined(SERVO1_PORT) && defined(SERVO1_BIT))
#define SERVO1 42
#define SERVO1_MBED_PIN __mbedpin__(SERVO1_PORT, SERVO1_BIT)
#define SERVO1_GPIOREG __gpioreg__(SERVO1_PORT)
#if (SERVO1_BIT < 16)
#define SERVO1_PINHALF L
#else
#define SERVO1_PINHALF H
#endif
#define SERVO1_PINCON __pincon__(SERVO1_PORT, SERVO1_PINHALF)
#define DIO42 42
#define DIO42_MBED_PIN SERVO1_MBED_PIN
#define DIO42_PORT SERVO1_PORT
#define DIO42_BIT SERVO1_BIT
#define DIO42_GPIOREG SERVO1_GPIOREG
#define DIO42_PINHALF SERVO1_PINHALF
#define DIO42_PINCON SERVO1_PINCON
#endif
#if (defined(SERVO2_PORT) && defined(SERVO2_BIT))
#define SERVO2 43
#define SERVO2_MBED_PIN __mbedpin__(SERVO2_PORT, SERVO2_BIT)
#define SERVO2_GPIOREG __gpioreg__(SERVO2_PORT)
#if (SERVO2_BIT < 16)
#define SERVO2_PINHALF L
#else
#define SERVO2_PINHALF H
#endif
#define SERVO2_PINCON __pincon__(SERVO2_PORT, SERVO2_PINHALF)
#define DIO43 43
#define DIO43_MBED_PIN SERVO2_MBED_PIN
#define DIO43_PORT SERVO2_PORT
#define DIO43_BIT SERVO2_BIT
#define DIO43_GPIOREG SERVO2_GPIOREG
#define DIO43_PINHALF SERVO2_PINHALF
#define DIO43_PINCON SERVO2_PINCON
#endif
#if (defined(SERVO3_PORT) && defined(SERVO3_BIT))
#define SERVO3 44
#define SERVO3_MBED_PIN __mbedpin__(SERVO3_PORT, SERVO3_BIT)
#define SERVO3_GPIOREG __gpioreg__(SERVO3_PORT)
#if (SERVO3_BIT < 16)
#define SERVO3_PINHALF L
#else
#define SERVO3_PINHALF H
#endif
#define SERVO3_PINCON __pincon__(SERVO3_PORT, SERVO3_PINHALF)
#define DIO44 44
#define DIO44_MBED_PIN SERVO3_MBED_PIN
#define DIO44_PORT SERVO3_PORT
#define DIO44_BIT SERVO3_BIT
#define DIO44_GPIOREG SERVO3_GPIOREG
#define DIO44_PINHALF SERVO3_PINHALF
#define DIO44_PINCON SERVO3_PINCON
#endif
#if (defined(SERVO4_PORT) && defined(SERVO4_BIT))
#define SERVO4 45
#define SERVO4_MBED_PIN __mbedpin__(SERVO4_PORT, SERVO4_BIT)
#define SERVO4_GPIOREG __gpioreg__(SERVO4_PORT)
#if (SERVO4_BIT < 16)
#define SERVO4_PINHALF L
#else
#define SERVO4_PINHALF H
#endif
