Paciente8159/uCNC/uCNC/src/hal/mcus/lpc176x/mcumap_lpc176x.h
#define SERVO4_PINCON __pincon__(SERVO4_PORT, SERVO4_PINHALF)
#define DIO45 45
#define DIO45_MBED_PIN SERVO4_MBED_PIN
#define DIO45_PORT SERVO4_PORT
#define DIO45_BIT SERVO4_BIT
#define DIO45_GPIOREG SERVO4_GPIOREG
#define DIO45_PINHALF SERVO4_PINHALF
#define DIO45_PINCON SERVO4_PINCON
#endif
#if (defined(SERVO5_PORT) && defined(SERVO5_BIT))
#define SERVO5 46
#define SERVO5_MBED_PIN __mbedpin__(SERVO5_PORT, SERVO5_BIT)
#define SERVO5_GPIOREG __gpioreg__(SERVO5_PORT)
#if (SERVO5_BIT < 16)
#define SERVO5_PINHALF L
#else
#define SERVO5_PINHALF H
#endif
#define SERVO5_PINCON __pincon__(SERVO5_PORT, SERVO5_PINHALF)
#define DIO46 46
#define DIO46_MBED_PIN SERVO5_MBED_PIN
#define DIO46_PORT SERVO5_PORT
#define DIO46_BIT SERVO5_BIT
#define DIO46_GPIOREG SERVO5_GPIOREG
#define DIO46_PINHALF SERVO5_PINHALF
#define DIO46_PINCON SERVO5_PINCON
#endif
#if (defined(DOUT0_PORT) && defined(DOUT0_BIT))
#define DOUT0 47
#define DOUT0_MBED_PIN __mbedpin__(DOUT0_PORT, DOUT0_BIT)
#define DOUT0_GPIOREG __gpioreg__(DOUT0_PORT)
#if (DOUT0_BIT < 16)
#define DOUT0_PINHALF L
#else
#define DOUT0_PINHALF H
#endif
#define DOUT0_PINCON __pincon__(DOUT0_PORT, DOUT0_PINHALF)
#define DIO47 47
#define DIO47_MBED_PIN DOUT0_MBED_PIN
#define DIO47_PORT DOUT0_PORT
#define DIO47_BIT DOUT0_BIT
#define DIO47_GPIOREG DOUT0_GPIOREG
#define DIO47_PINHALF DOUT0_PINHALF
#define DIO47_PINCON DOUT0_PINCON
#endif
#if (defined(DOUT1_PORT) && defined(DOUT1_BIT))
#define DOUT1 48
#define DOUT1_MBED_PIN __mbedpin__(DOUT1_PORT, DOUT1_BIT)
#define DOUT1_GPIOREG __gpioreg__(DOUT1_PORT)
#if (DOUT1_BIT < 16)
#define DOUT1_PINHALF L
#else
#define DOUT1_PINHALF H
#endif
#define DOUT1_PINCON __pincon__(DOUT1_PORT, DOUT1_PINHALF)
#define DIO48 48
#define DIO48_MBED_PIN DOUT1_MBED_PIN
#define DIO48_PORT DOUT1_PORT
#define DIO48_BIT DOUT1_BIT
#define DIO48_GPIOREG DOUT1_GPIOREG
#define DIO48_PINHALF DOUT1_PINHALF
#define DIO48_PINCON DOUT1_PINCON
#endif
#if (defined(DOUT2_PORT) && defined(DOUT2_BIT))
#define DOUT2 49
#define DOUT2_MBED_PIN __mbedpin__(DOUT2_PORT, DOUT2_BIT)
#define DOUT2_GPIOREG __gpioreg__(DOUT2_PORT)
#if (DOUT2_BIT < 16)
#define DOUT2_PINHALF L
#else
#define DOUT2_PINHALF H
#endif
#define DOUT2_PINCON __pincon__(DOUT2_PORT, DOUT2_PINHALF)
#define DIO49 49
#define DIO49_MBED_PIN DOUT2_MBED_PIN
#define DIO49_PORT DOUT2_PORT
#define DIO49_BIT DOUT2_BIT
#define DIO49_GPIOREG DOUT2_GPIOREG
#define DIO49_PINHALF DOUT2_PINHALF
#define DIO49_PINCON DOUT2_PINCON
#endif
#if (defined(DOUT3_PORT) && defined(DOUT3_BIT))
#define DOUT3 50
#define DOUT3_MBED_PIN __mbedpin__(DOUT3_PORT, DOUT3_BIT)
#define DOUT3_GPIOREG __gpioreg__(DOUT3_PORT)
#if (DOUT3_BIT < 16)
#define DOUT3_PINHALF L
#else
#define DOUT3_PINHALF H
#endif
#define DOUT3_PINCON __pincon__(DOUT3_PORT, DOUT3_PINHALF)
#define DIO50 50
#define DIO50_MBED_PIN DOUT3_MBED_PIN
#define DIO50_PORT DOUT3_PORT
#define DIO50_BIT DOUT3_BIT
#define DIO50_GPIOREG DOUT3_GPIOREG
#define DIO50_PINHALF DOUT3_PINHALF
#define DIO50_PINCON DOUT3_PINCON
#endif
#if (defined(DOUT4_PORT) && defined(DOUT4_BIT))
#define DOUT4 51
#define DOUT4_MBED_PIN __mbedpin__(DOUT4_PORT, DOUT4_BIT)
#define DOUT4_GPIOREG __gpioreg__(DOUT4_PORT)
#if (DOUT4_BIT < 16)
#define DOUT4_PINHALF L
#else
#define DOUT4_PINHALF H
#endif
#define DOUT4_PINCON __pincon__(DOUT4_PORT, DOUT4_PINHALF)
#define DIO51 51
#define DIO51_MBED_PIN DOUT4_MBED_PIN
#define DIO51_PORT DOUT4_PORT
#define DIO51_BIT DOUT4_BIT
#define DIO51_GPIOREG DOUT4_GPIOREG
#define DIO51_PINHALF DOUT4_PINHALF
#define DIO51_PINCON DOUT4_PINCON
#endif
#if (defined(DOUT5_PORT) && defined(DOUT5_BIT))
#define DOUT5 52
#define DOUT5_MBED_PIN __mbedpin__(DOUT5_PORT, DOUT5_BIT)
#define DOUT5_GPIOREG __gpioreg__(DOUT5_PORT)
#if (DOUT5_BIT < 16)
#define DOUT5_PINHALF L
#else
#define DOUT5_PINHALF H
#endif
#define DOUT5_PINCON __pincon__(DOUT5_PORT, DOUT5_PINHALF)
#define DIO52 52
#define DIO52_MBED_PIN DOUT5_MBED_PIN
#define DIO52_PORT DOUT5_PORT
#define DIO52_BIT DOUT5_BIT
#define DIO52_GPIOREG DOUT5_GPIOREG
#define DIO52_PINHALF DOUT5_PINHALF
#define DIO52_PINCON DOUT5_PINCON
#endif
#if (defined(DOUT6_PORT) && defined(DOUT6_BIT))
#define DOUT6 53
#define DOUT6_MBED_PIN __mbedpin__(DOUT6_PORT, DOUT6_BIT)
#define DOUT6_GPIOREG __gpioreg__(DOUT6_PORT)
#if (DOUT6_BIT < 16)
#define DOUT6_PINHALF L
#else
#define DOUT6_PINHALF H
#endif
#define DOUT6_PINCON __pincon__(DOUT6_PORT, DOUT6_PINHALF)
#define DIO53 53
#define DIO53_MBED_PIN DOUT6_MBED_PIN
#define DIO53_PORT DOUT6_PORT
#define DIO53_BIT DOUT6_BIT
#define DIO53_GPIOREG DOUT6_GPIOREG
#define DIO53_PINHALF DOUT6_PINHALF
#define DIO53_PINCON DOUT6_PINCON
#endif
#if (defined(DOUT7_PORT) && defined(DOUT7_BIT))
#define DOUT7 54
#define DOUT7_MBED_PIN __mbedpin__(DOUT7_PORT, DOUT7_BIT)
#define DOUT7_GPIOREG __gpioreg__(DOUT7_PORT)
#if (DOUT7_BIT < 16)
#define DOUT7_PINHALF L
#else
#define DOUT7_PINHALF H
#endif
#define DOUT7_PINCON __pincon__(DOUT7_PORT, DOUT7_PINHALF)
#define DIO54 54
#define DIO54_MBED_PIN DOUT7_MBED_PIN
#define DIO54_PORT DOUT7_PORT
#define DIO54_BIT DOUT7_BIT
#define DIO54_GPIOREG DOUT7_GPIOREG
#define DIO54_PINHALF DOUT7_PINHALF
#define DIO54_PINCON DOUT7_PINCON
#endif
#if (defined(DOUT8_PORT) && defined(DOUT8_BIT))
#define DOUT8 55
#define DOUT8_MBED_PIN __mbedpin__(DOUT8_PORT, DOUT8_BIT)
#define DOUT8_GPIOREG __gpioreg__(DOUT8_PORT)
#if (DOUT8_BIT < 16)
#define DOUT8_PINHALF L
#else
#define DOUT8_PINHALF H
#endif
#define DOUT8_PINCON __pincon__(DOUT8_PORT, DOUT8_PINHALF)
#define DIO55 55
#define DIO55_MBED_PIN DOUT8_MBED_PIN
#define DIO55_PORT DOUT8_PORT
#define DIO55_BIT DOUT8_BIT
#define DIO55_GPIOREG DOUT8_GPIOREG
#define DIO55_PINHALF DOUT8_PINHALF
#define DIO55_PINCON DOUT8_PINCON
#endif
#if (defined(DOUT9_PORT) && defined(DOUT9_BIT))
#define DOUT9 56
#define DOUT9_MBED_PIN __mbedpin__(DOUT9_PORT, DOUT9_BIT)
#define DOUT9_GPIOREG __gpioreg__(DOUT9_PORT)
#if (DOUT9_BIT < 16)
#define DOUT9_PINHALF L
#else
#define DOUT9_PINHALF H
#endif
#define DOUT9_PINCON __pincon__(DOUT9_PORT, DOUT9_PINHALF)
#define DIO56 56
#define DIO56_MBED_PIN DOUT9_MBED_PIN
#define DIO56_PORT DOUT9_PORT
#define DIO56_BIT DOUT9_BIT
#define DIO56_GPIOREG DOUT9_GPIOREG
#define DIO56_PINHALF DOUT9_PINHALF
#define DIO56_PINCON DOUT9_PINCON
#endif
#if (defined(DOUT10_PORT) && defined(DOUT10_BIT))
#define DOUT10 57
#define DOUT10_MBED_PIN __mbedpin__(DOUT10_PORT, DOUT10_BIT)
#define DOUT10_GPIOREG __gpioreg__(DOUT10_PORT)
#if (DOUT10_BIT < 16)
#define DOUT10_PINHALF L
#else
#define DOUT10_PINHALF H
#endif
#define DOUT10_PINCON __pincon__(DOUT10_PORT, DOUT10_PINHALF)
#define DIO57 57
#define DIO57_MBED_PIN DOUT10_MBED_PIN
#define DIO57_PORT DOUT10_PORT
#define DIO57_BIT DOUT10_BIT
#define DIO57_GPIOREG DOUT10_GPIOREG
#define DIO57_PINHALF DOUT10_PINHALF
#define DIO57_PINCON DOUT10_PINCON
#endif
#if (defined(DOUT11_PORT) && defined(DOUT11_BIT))
#define DOUT11 58
#define DOUT11_MBED_PIN __mbedpin__(DOUT11_PORT, DOUT11_BIT)
#define DOUT11_GPIOREG __gpioreg__(DOUT11_PORT)
#if (DOUT11_BIT < 16)
#define DOUT11_PINHALF L
#else
#define DOUT11_PINHALF H
#endif
#define DOUT11_PINCON __pincon__(DOUT11_PORT, DOUT11_PINHALF)
#define DIO58 58
#define DIO58_MBED_PIN DOUT11_MBED_PIN
#define DIO58_PORT DOUT11_PORT
#define DIO58_BIT DOUT11_BIT
#define DIO58_GPIOREG DOUT11_GPIOREG
#define DIO58_PINHALF DOUT11_PINHALF
#define DIO58_PINCON DOUT11_PINCON
#endif
#if (defined(DOUT12_PORT) && defined(DOUT12_BIT))
#define DOUT12 59
#define DOUT12_MBED_PIN __mbedpin__(DOUT12_PORT, DOUT12_BIT)
#define DOUT12_GPIOREG __gpioreg__(DOUT12_PORT)
#if (DOUT12_BIT < 16)
#define DOUT12_PINHALF L
#else
#define DOUT12_PINHALF H
#endif
#define DOUT12_PINCON __pincon__(DOUT12_PORT, DOUT12_PINHALF)
#define DIO59 59
#define DIO59_MBED_PIN DOUT12_MBED_PIN
#define DIO59_PORT DOUT12_PORT
#define DIO59_BIT DOUT12_BIT
#define DIO59_GPIOREG DOUT12_GPIOREG
#define DIO59_PINHALF DOUT12_PINHALF
#define DIO59_PINCON DOUT12_PINCON
#endif
#if (defined(DOUT13_PORT) && defined(DOUT13_BIT))
#define DOUT13 60
#define DOUT13_MBED_PIN __mbedpin__(DOUT13_PORT, DOUT13_BIT)
#define DOUT13_GPIOREG __gpioreg__(DOUT13_PORT)
#if (DOUT13_BIT < 16)
#define DOUT13_PINHALF L
#else
#define DOUT13_PINHALF H
#endif
#define DOUT13_PINCON __pincon__(DOUT13_PORT, DOUT13_PINHALF)
#define DIO60 60
#define DIO60_MBED_PIN DOUT13_MBED_PIN
#define DIO60_PORT DOUT13_PORT
#define DIO60_BIT DOUT13_BIT
#define DIO60_GPIOREG DOUT13_GPIOREG
#define DIO60_PINHALF DOUT13_PINHALF
#define DIO60_PINCON DOUT13_PINCON
#endif
#if (defined(DOUT14_PORT) && defined(DOUT14_BIT))
#define DOUT14 61
#define DOUT14_MBED_PIN __mbedpin__(DOUT14_PORT, DOUT14_BIT)
#define DOUT14_GPIOREG __gpioreg__(DOUT14_PORT)
#if (DOUT14_BIT < 16)
#define DOUT14_PINHALF L
#else
#define DOUT14_PINHALF H
#endif
#define DOUT14_PINCON __pincon__(DOUT14_PORT, DOUT14_PINHALF)
#define DIO61 61
#define DIO61_MBED_PIN DOUT14_MBED_PIN
#define DIO61_PORT DOUT14_PORT
#define DIO61_BIT DOUT14_BIT
#define DIO61_GPIOREG DOUT14_GPIOREG
#define DIO61_PINHALF DOUT14_PINHALF
#define DIO61_PINCON DOUT14_PINCON
#endif
#if (defined(DOUT15_PORT) && defined(DOUT15_BIT))
#define DOUT15 62
#define DOUT15_MBED_PIN __mbedpin__(DOUT15_PORT, DOUT15_BIT)
#define DOUT15_GPIOREG __gpioreg__(DOUT15_PORT)
#if (DOUT15_BIT < 16)
#define DOUT15_PINHALF L
#else
#define DOUT15_PINHALF H
#endif
#define DOUT15_PINCON __pincon__(DOUT15_PORT, DOUT15_PINHALF)
#define DIO62 62
#define DIO62_MBED_PIN DOUT15_MBED_PIN
#define DIO62_PORT DOUT15_PORT
#define DIO62_BIT DOUT15_BIT
#define DIO62_GPIOREG DOUT15_GPIOREG
#define DIO62_PINHALF DOUT15_PINHALF
#define DIO62_PINCON DOUT15_PINCON
#endif
#if (defined(DOUT16_PORT) && defined(DOUT16_BIT))
#define DOUT16 63
#define DOUT16_MBED_PIN __mbedpin__(DOUT16_PORT, DOUT16_BIT)
#define DOUT16_GPIOREG __gpioreg__(DOUT16_PORT)
#if (DOUT16_BIT < 16)
#define DOUT16_PINHALF L
#else
#define DOUT16_PINHALF H
#endif
#define DOUT16_PINCON __pincon__(DOUT16_PORT, DOUT16_PINHALF)
#define DIO63 63
#define DIO63_MBED_PIN DOUT16_MBED_PIN
#define DIO63_PORT DOUT16_PORT
#define DIO63_BIT DOUT16_BIT
#define DIO63_GPIOREG DOUT16_GPIOREG
#define DIO63_PINHALF DOUT16_PINHALF
#define DIO63_PINCON DOUT16_PINCON
#endif
#if (defined(DOUT17_PORT) && defined(DOUT17_BIT))
#define DOUT17 64
#define DOUT17_MBED_PIN __mbedpin__(DOUT17_PORT, DOUT17_BIT)
#define DOUT17_GPIOREG __gpioreg__(DOUT17_PORT)
#if (DOUT17_BIT < 16)
#define DOUT17_PINHALF L
#else
#define DOUT17_PINHALF H
#endif
#define DOUT17_PINCON __pincon__(DOUT17_PORT, DOUT17_PINHALF)
#define DIO64 64
#define DIO64_MBED_PIN DOUT17_MBED_PIN
#define DIO64_PORT DOUT17_PORT
#define DIO64_BIT DOUT17_BIT
#define DIO64_GPIOREG DOUT17_GPIOREG
#define DIO64_PINHALF DOUT17_PINHALF
#define DIO64_PINCON DOUT17_PINCON
#endif
#if (defined(DOUT18_PORT) && defined(DOUT18_BIT))
#define DOUT18 65
#define DOUT18_MBED_PIN __mbedpin__(DOUT18_PORT, DOUT18_BIT)
#define DOUT18_GPIOREG __gpioreg__(DOUT18_PORT)
#if (DOUT18_BIT < 16)
#define DOUT18_PINHALF L
#else
#define DOUT18_PINHALF H
#endif
#define DOUT18_PINCON __pincon__(DOUT18_PORT, DOUT18_PINHALF)
#define DIO65 65
#define DIO65_MBED_PIN DOUT18_MBED_PIN
#define DIO65_PORT DOUT18_PORT
#define DIO65_BIT DOUT18_BIT
#define DIO65_GPIOREG DOUT18_GPIOREG
#define DIO65_PINHALF DOUT18_PINHALF
#define DIO65_PINCON DOUT18_PINCON
#endif
#if (defined(DOUT19_PORT) && defined(DOUT19_BIT))
#define DOUT19 66
#define DOUT19_MBED_PIN __mbedpin__(DOUT19_PORT, DOUT19_BIT)
#define DOUT19_GPIOREG __gpioreg__(DOUT19_PORT)
#if (DOUT19_BIT < 16)
#define DOUT19_PINHALF L
#else
#define DOUT19_PINHALF H
#endif
#define DOUT19_PINCON __pincon__(DOUT19_PORT, DOUT19_PINHALF)
#define DIO66 66
#define DIO66_MBED_PIN DOUT19_MBED_PIN
#define DIO66_PORT DOUT19_PORT
#define DIO66_BIT DOUT19_BIT
#define DIO66_GPIOREG DOUT19_GPIOREG
#define DIO66_PINHALF DOUT19_PINHALF
#define DIO66_PINCON DOUT19_PINCON
#endif
#if (defined(DOUT20_PORT) && defined(DOUT20_BIT))
#define DOUT20 67
#define DOUT20_MBED_PIN __mbedpin__(DOUT20_PORT, DOUT20_BIT)
#define DOUT20_GPIOREG __gpioreg__(DOUT20_PORT)
#if (DOUT20_BIT < 16)
#define DOUT20_PINHALF L
#else
#define DOUT20_PINHALF H
#endif
#define DOUT20_PINCON __pincon__(DOUT20_PORT, DOUT20_PINHALF)
#define DIO67 67
#define DIO67_MBED_PIN DOUT20_MBED_PIN
#define DIO67_PORT DOUT20_PORT
#define DIO67_BIT DOUT20_BIT
#define DIO67_GPIOREG DOUT20_GPIOREG
#define DIO67_PINHALF DOUT20_PINHALF
#define DIO67_PINCON DOUT20_PINCON
#endif
#if (defined(DOUT21_PORT) && defined(DOUT21_BIT))
#define DOUT21 68
#define DOUT21_MBED_PIN __mbedpin__(DOUT21_PORT, DOUT21_BIT)
#define DOUT21_GPIOREG __gpioreg__(DOUT21_PORT)
#if (DOUT21_BIT < 16)
#define DOUT21_PINHALF L
#else
#define DOUT21_PINHALF H
#endif
#define DOUT21_PINCON __pincon__(DOUT21_PORT, DOUT21_PINHALF)
#define DIO68 68
#define DIO68_MBED_PIN DOUT21_MBED_PIN
#define DIO68_PORT DOUT21_PORT
#define DIO68_BIT DOUT21_BIT
#define DIO68_GPIOREG DOUT21_GPIOREG
#define DIO68_PINHALF DOUT21_PINHALF
#define DIO68_PINCON DOUT21_PINCON
#endif
#if (defined(DOUT22_PORT) && defined(DOUT22_BIT))
#define DOUT22 69
#define DOUT22_MBED_PIN __mbedpin__(DOUT22_PORT, DOUT22_BIT)
#define DOUT22_GPIOREG __gpioreg__(DOUT22_PORT)
#if (DOUT22_BIT < 16)
#define DOUT22_PINHALF L
#else
#define DOUT22_PINHALF H
#endif
#define DOUT22_PINCON __pincon__(DOUT22_PORT, DOUT22_PINHALF)
#define DIO69 69
#define DIO69_MBED_PIN DOUT22_MBED_PIN
#define DIO69_PORT DOUT22_PORT
#define DIO69_BIT DOUT22_BIT
#define DIO69_GPIOREG DOUT22_GPIOREG
#define DIO69_PINHALF DOUT22_PINHALF
#define DIO69_PINCON DOUT22_PINCON
#endif
#if (defined(DOUT23_PORT) && defined(DOUT23_BIT))
#define DOUT23 70
#define DOUT23_MBED_PIN __mbedpin__(DOUT23_PORT, DOUT23_BIT)
#define DOUT23_GPIOREG __gpioreg__(DOUT23_PORT)
#if (DOUT23_BIT < 16)
#define DOUT23_PINHALF L
#else
#define DOUT23_PINHALF H
#endif
#define DOUT23_PINCON __pincon__(DOUT23_PORT, DOUT23_PINHALF)
#define DIO70 70
#define DIO70_MBED_PIN DOUT23_MBED_PIN
#define DIO70_PORT DOUT23_PORT
#define DIO70_BIT DOUT23_BIT
#define DIO70_GPIOREG DOUT23_GPIOREG
#define DIO70_PINHALF DOUT23_PINHALF
#define DIO70_PINCON DOUT23_PINCON
#endif
#if (defined(DOUT24_PORT) && defined(DOUT24_BIT))
#define DOUT24 71
#define DOUT24_MBED_PIN __mbedpin__(DOUT24_PORT, DOUT24_BIT)
#define DOUT24_GPIOREG __gpioreg__(DOUT24_PORT)
#if (DOUT24_BIT < 16)
#define DOUT24_PINHALF L
#else
#define DOUT24_PINHALF H
#endif
#define DOUT24_PINCON __pincon__(DOUT24_PORT, DOUT24_PINHALF)
#define DIO71 71
#define DIO71_MBED_PIN DOUT24_MBED_PIN
#define DIO71_PORT DOUT24_PORT
#define DIO71_BIT DOUT24_BIT
#define DIO71_GPIOREG DOUT24_GPIOREG
#define DIO71_PINHALF DOUT24_PINHALF
#define DIO71_PINCON DOUT24_PINCON
#endif
#if (defined(DOUT25_PORT) && defined(DOUT25_BIT))
#define DOUT25 72
#define DOUT25_MBED_PIN __mbedpin__(DOUT25_PORT, DOUT25_BIT)
#define DOUT25_GPIOREG __gpioreg__(DOUT25_PORT)
#if (DOUT25_BIT < 16)
#define DOUT25_PINHALF L
#else
#define DOUT25_PINHALF H
#endif
#define DOUT25_PINCON __pincon__(DOUT25_PORT, DOUT25_PINHALF)
#define DIO72 72
#define DIO72_MBED_PIN DOUT25_MBED_PIN
#define DIO72_PORT DOUT25_PORT
#define DIO72_BIT DOUT25_BIT
#define DIO72_GPIOREG DOUT25_GPIOREG
#define DIO72_PINHALF DOUT25_PINHALF
#define DIO72_PINCON DOUT25_PINCON
#endif
#if (defined(DOUT26_PORT) && defined(DOUT26_BIT))
#define DOUT26 73
#define DOUT26_MBED_PIN __mbedpin__(DOUT26_PORT, DOUT26_BIT)
#define DOUT26_GPIOREG __gpioreg__(DOUT26_PORT)
#if (DOUT26_BIT < 16)
#define DOUT26_PINHALF L
#else
#define DOUT26_PINHALF H
#endif
#define DOUT26_PINCON __pincon__(DOUT26_PORT, DOUT26_PINHALF)
#define DIO73 73
#define DIO73_MBED_PIN DOUT26_MBED_PIN
#define DIO73_PORT DOUT26_PORT
#define DIO73_BIT DOUT26_BIT
#define DIO73_GPIOREG DOUT26_GPIOREG
#define DIO73_PINHALF DOUT26_PINHALF
#define DIO73_PINCON DOUT26_PINCON
#endif
#if (defined(DOUT27_PORT) && defined(DOUT27_BIT))
#define DOUT27 74
#define DOUT27_MBED_PIN __mbedpin__(DOUT27_PORT, DOUT27_BIT)
#define DOUT27_GPIOREG __gpioreg__(DOUT27_PORT)
#if (DOUT27_BIT < 16)
#define DOUT27_PINHALF L
#else
#define DOUT27_PINHALF H
#endif
#define DOUT27_PINCON __pincon__(DOUT27_PORT, DOUT27_PINHALF)
#define DIO74 74
#define DIO74_MBED_PIN DOUT27_MBED_PIN
#define DIO74_PORT DOUT27_PORT
#define DIO74_BIT DOUT27_BIT
#define DIO74_GPIOREG DOUT27_GPIOREG
#define DIO74_PINHALF DOUT27_PINHALF
#define DIO74_PINCON DOUT27_PINCON
#endif
#if (defined(DOUT28_PORT) && defined(DOUT28_BIT))
#define DOUT28 75
#define DOUT28_MBED_PIN __mbedpin__(DOUT28_PORT, DOUT28_BIT)
#define DOUT28_GPIOREG __gpioreg__(DOUT28_PORT)
#if (DOUT28_BIT < 16)
#define DOUT28_PINHALF L
#else
#define DOUT28_PINHALF H
#endif
#define DOUT28_PINCON __pincon__(DOUT28_PORT, DOUT28_PINHALF)
#define DIO75 75
#define DIO75_MBED_PIN DOUT28_MBED_PIN
#define DIO75_PORT DOUT28_PORT
#define DIO75_BIT DOUT28_BIT
#define DIO75_GPIOREG DOUT28_GPIOREG
#define DIO75_PINHALF DOUT28_PINHALF
#define DIO75_PINCON DOUT28_PINCON
#endif
#if (defined(DOUT29_PORT) && defined(DOUT29_BIT))
#define DOUT29 76
#define DOUT29_MBED_PIN __mbedpin__(DOUT29_PORT, DOUT29_BIT)
#define DOUT29_GPIOREG __gpioreg__(DOUT29_PORT)
#if (DOUT29_BIT < 16)
#define DOUT29_PINHALF L
#else
#define DOUT29_PINHALF H
#endif
#define DOUT29_PINCON __pincon__(DOUT29_PORT, DOUT29_PINHALF)
#define DIO76 76
#define DIO76_MBED_PIN DOUT29_MBED_PIN
#define DIO76_PORT DOUT29_PORT
#define DIO76_BIT DOUT29_BIT
#define DIO76_GPIOREG DOUT29_GPIOREG
#define DIO76_PINHALF DOUT29_PINHALF
#define DIO76_PINCON DOUT29_PINCON
#endif
#if (defined(DOUT30_PORT) && defined(DOUT30_BIT))
#define DOUT30 77
#define DOUT30_MBED_PIN __mbedpin__(DOUT30_PORT, DOUT30_BIT)
#define DOUT30_GPIOREG __gpioreg__(DOUT30_PORT)
#if (DOUT30_BIT < 16)
#define DOUT30_PINHALF L
#else
#define DOUT30_PINHALF H
#endif
#define DOUT30_PINCON __pincon__(DOUT30_PORT, DOUT30_PINHALF)
#define DIO77 77
#define DIO77_MBED_PIN DOUT30_MBED_PIN
#define DIO77_PORT DOUT30_PORT
#define DIO77_BIT DOUT30_BIT
#define DIO77_GPIOREG DOUT30_GPIOREG
#define DIO77_PINHALF DOUT30_PINHALF
#define DIO77_PINCON DOUT30_PINCON
#endif
#if (defined(DOUT31_PORT) && defined(DOUT31_BIT))
#define DOUT31 78
#define DOUT31_MBED_PIN __mbedpin__(DOUT31_PORT, DOUT31_BIT)
#define DOUT31_GPIOREG __gpioreg__(DOUT31_PORT)
#if (DOUT31_BIT < 16)
#define DOUT31_PINHALF L
#else
#define DOUT31_PINHALF H
#endif
#define DOUT31_PINCON __pincon__(DOUT31_PORT, DOUT31_PINHALF)
#define DIO78 78
#define DIO78_MBED_PIN DOUT31_MBED_PIN
#define DIO78_PORT DOUT31_PORT
#define DIO78_BIT DOUT31_BIT
#define DIO78_GPIOREG DOUT31_GPIOREG
#define DIO78_PINHALF DOUT31_PINHALF
#define DIO78_PINCON DOUT31_PINCON
#endif
#if (defined(DOUT32_PORT) && defined(DOUT32_BIT))
#define DOUT32 79
#define DOUT32_MBED_PIN __mbedpin__(DOUT32_PORT, DOUT32_BIT)
#define DOUT32_GPIOREG __gpioreg__(DOUT32_PORT)
#if (DOUT32_BIT < 16)
#define DOUT32_PINHALF L
#else
#define DOUT32_PINHALF H
#endif
#define DOUT32_PINCON __pincon__(DOUT32_PORT, DOUT32_PINHALF)
#define DIO79 79
#define DIO79_MBED_PIN DOUT32_MBED_PIN
#define DIO79_PORT DOUT32_PORT
#define DIO79_BIT DOUT32_BIT
#define DIO79_GPIOREG DOUT32_GPIOREG
#define DIO79_PINHALF DOUT32_PINHALF
#define DIO79_PINCON DOUT32_PINCON
#endif
#if (defined(DOUT33_PORT) && defined(DOUT33_BIT))
#define DOUT33 80
#define DOUT33_MBED_PIN __mbedpin__(DOUT33_PORT, DOUT33_BIT)
#define DOUT33_GPIOREG __gpioreg__(DOUT33_PORT)
#if (DOUT33_BIT < 16)
#define DOUT33_PINHALF L
#else
#define DOUT33_PINHALF H
#endif
#define DOUT33_PINCON __pincon__(DOUT33_PORT, DOUT33_PINHALF)
#define DIO80 80
#define DIO80_MBED_PIN DOUT33_MBED_PIN
#define DIO80_PORT DOUT33_PORT
#define DIO80_BIT DOUT33_BIT
#define DIO80_GPIOREG DOUT33_GPIOREG
#define DIO80_PINHALF DOUT33_PINHALF
#define DIO80_PINCON DOUT33_PINCON
#endif
#if (defined(DOUT34_PORT) && defined(DOUT34_BIT))
#define DOUT34 81
#define DOUT34_MBED_PIN __mbedpin__(DOUT34_PORT, DOUT34_BIT)
#define DOUT34_GPIOREG __gpioreg__(DOUT34_PORT)
#if (DOUT34_BIT < 16)
#define DOUT34_PINHALF L
#else
#define DOUT34_PINHALF H
#endif
#define DOUT34_PINCON __pincon__(DOUT34_PORT, DOUT34_PINHALF)
#define DIO81 81
#define DIO81_MBED_PIN DOUT34_MBED_PIN
#define DIO81_PORT DOUT34_PORT
#define DIO81_BIT DOUT34_BIT
#define DIO81_GPIOREG DOUT34_GPIOREG
#define DIO81_PINHALF DOUT34_PINHALF
#define DIO81_PINCON DOUT34_PINCON
#endif
#if (defined(DOUT35_PORT) && defined(DOUT35_BIT))
#define DOUT35 82
#define DOUT35_MBED_PIN __mbedpin__(DOUT35_PORT, DOUT35_BIT)
#define DOUT35_GPIOREG __gpioreg__(DOUT35_PORT)
#if (DOUT35_BIT < 16)
#define DOUT35_PINHALF L
#else
#define DOUT35_PINHALF H
#endif
#define DOUT35_PINCON __pincon__(DOUT35_PORT, DOUT35_PINHALF)
#define DIO82 82
#define DIO82_MBED_PIN DOUT35_MBED_PIN
#define DIO82_PORT DOUT35_PORT
#define DIO82_BIT DOUT35_BIT
#define DIO82_GPIOREG DOUT35_GPIOREG
#define DIO82_PINHALF DOUT35_PINHALF
#define DIO82_PINCON DOUT35_PINCON
#endif
#if (defined(DOUT36_PORT) && defined(DOUT36_BIT))
#define DOUT36 83
#define DOUT36_MBED_PIN __mbedpin__(DOUT36_PORT, DOUT36_BIT)
#define DOUT36_GPIOREG __gpioreg__(DOUT36_PORT)
#if (DOUT36_BIT < 16)
#define DOUT36_PINHALF L
#else
#define DOUT36_PINHALF H
#endif
#define DOUT36_PINCON __pincon__(DOUT36_PORT, DOUT36_PINHALF)
#define DIO83 83
#define DIO83_MBED_PIN DOUT36_MBED_PIN
#define DIO83_PORT DOUT36_PORT
#define DIO83_BIT DOUT36_BIT
#define DIO83_GPIOREG DOUT36_GPIOREG
#define DIO83_PINHALF DOUT36_PINHALF
#define DIO83_PINCON DOUT36_PINCON
#endif
#if (defined(DOUT37_PORT) && defined(DOUT37_BIT))
#define DOUT37 84
#define DOUT37_MBED_PIN __mbedpin__(DOUT37_PORT, DOUT37_BIT)
#define DOUT37_GPIOREG __gpioreg__(DOUT37_PORT)
#if (DOUT37_BIT < 16)
#define DOUT37_PINHALF L
#else
#define DOUT37_PINHALF H
#endif
#define DOUT37_PINCON __pincon__(DOUT37_PORT, DOUT37_PINHALF)
#define DIO84 84
#define DIO84_MBED_PIN DOUT37_MBED_PIN
#define DIO84_PORT DOUT37_PORT
#define DIO84_BIT DOUT37_BIT
#define DIO84_GPIOREG DOUT37_GPIOREG
#define DIO84_PINHALF DOUT37_PINHALF
#define DIO84_PINCON DOUT37_PINCON
#endif
#if (defined(DOUT38_PORT) && defined(DOUT38_BIT))
#define DOUT38 85
#define DOUT38_MBED_PIN __mbedpin__(DOUT38_PORT, DOUT38_BIT)
#define DOUT38_GPIOREG __gpioreg__(DOUT38_PORT)
#if (DOUT38_BIT < 16)
#define DOUT38_PINHALF L
#else
#define DOUT38_PINHALF H
#endif
#define DOUT38_PINCON __pincon__(DOUT38_PORT, DOUT38_PINHALF)
#define DIO85 85
#define DIO85_MBED_PIN DOUT38_MBED_PIN
#define DIO85_PORT DOUT38_PORT
#define DIO85_BIT DOUT38_BIT
#define DIO85_GPIOREG DOUT38_GPIOREG
#define DIO85_PINHALF DOUT38_PINHALF
#define DIO85_PINCON DOUT38_PINCON
#endif
#if (defined(DOUT39_PORT) && defined(DOUT39_BIT))
#define DOUT39 86
#define DOUT39_MBED_PIN __mbedpin__(DOUT39_PORT, DOUT39_BIT)
#define DOUT39_GPIOREG __gpioreg__(DOUT39_PORT)
#if (DOUT39_BIT < 16)
#define DOUT39_PINHALF L
#else
#define DOUT39_PINHALF H
#endif
#define DOUT39_PINCON __pincon__(DOUT39_PORT, DOUT39_PINHALF)
#define DIO86 86
#define DIO86_MBED_PIN DOUT39_MBED_PIN
#define DIO86_PORT DOUT39_PORT
#define DIO86_BIT DOUT39_BIT
#define DIO86_GPIOREG DOUT39_GPIOREG
#define DIO86_PINHALF DOUT39_PINHALF
#define DIO86_PINCON DOUT39_PINCON
#endif
#if (defined(DOUT40_PORT) && defined(DOUT40_BIT))
#define DOUT40 87
#define DOUT40_MBED_PIN __mbedpin__(DOUT40_PORT, DOUT40_BIT)
#define DOUT40_GPIOREG __gpioreg__(DOUT40_PORT)
#if (DOUT40_BIT < 16)
#define DOUT40_PINHALF L
#else
#define DOUT40_PINHALF H
#endif
#define DOUT40_PINCON __pincon__(DOUT40_PORT, DOUT40_PINHALF)
#define DIO87 87
#define DIO87_MBED_PIN DOUT40_MBED_PIN
#define DIO87_PORT DOUT40_PORT
#define DIO87_BIT DOUT40_BIT
#define DIO87_GPIOREG DOUT40_GPIOREG
#define DIO87_PINHALF DOUT40_PINHALF
#define DIO87_PINCON DOUT40_PINCON
#endif
#if (defined(DOUT41_PORT) && defined(DOUT41_BIT))
#define DOUT41 88
#define DOUT41_MBED_PIN __mbedpin__(DOUT41_PORT, DOUT41_BIT)
#define DOUT41_GPIOREG __gpioreg__(DOUT41_PORT)
#if (DOUT41_BIT < 16)
#define DOUT41_PINHALF L
#else
#define DOUT41_PINHALF H
#endif
#define DOUT41_PINCON __pincon__(DOUT41_PORT, DOUT41_PINHALF)
#define DIO88 88
#define DIO88_MBED_PIN DOUT41_MBED_PIN
#define DIO88_PORT DOUT41_PORT
#define DIO88_BIT DOUT41_BIT
#define DIO88_GPIOREG DOUT41_GPIOREG
#define DIO88_PINHALF DOUT41_PINHALF
#define DIO88_PINCON DOUT41_PINCON
