Paciente8159/uCNC/uCNC/src/hal/mcus/lpc176x/mcumap_lpc176x.h
#endif
#if (defined(DOUT42_PORT) && defined(DOUT42_BIT))
#define DOUT42 89
#define DOUT42_MBED_PIN __mbedpin__(DOUT42_PORT, DOUT42_BIT)
#define DOUT42_GPIOREG __gpioreg__(DOUT42_PORT)
#if (DOUT42_BIT < 16)
#define DOUT42_PINHALF L
#else
#define DOUT42_PINHALF H
#endif
#define DOUT42_PINCON __pincon__(DOUT42_PORT, DOUT42_PINHALF)
#define DIO89 89
#define DIO89_MBED_PIN DOUT42_MBED_PIN
#define DIO89_PORT DOUT42_PORT
#define DIO89_BIT DOUT42_BIT
#define DIO89_GPIOREG DOUT42_GPIOREG
#define DIO89_PINHALF DOUT42_PINHALF
#define DIO89_PINCON DOUT42_PINCON
#endif
#if (defined(DOUT43_PORT) && defined(DOUT43_BIT))
#define DOUT43 90
#define DOUT43_MBED_PIN __mbedpin__(DOUT43_PORT, DOUT43_BIT)
#define DOUT43_GPIOREG __gpioreg__(DOUT43_PORT)
#if (DOUT43_BIT < 16)
#define DOUT43_PINHALF L
#else
#define DOUT43_PINHALF H
#endif
#define DOUT43_PINCON __pincon__(DOUT43_PORT, DOUT43_PINHALF)
#define DIO90 90
#define DIO90_MBED_PIN DOUT43_MBED_PIN
#define DIO90_PORT DOUT43_PORT
#define DIO90_BIT DOUT43_BIT
#define DIO90_GPIOREG DOUT43_GPIOREG
#define DIO90_PINHALF DOUT43_PINHALF
#define DIO90_PINCON DOUT43_PINCON
#endif
#if (defined(DOUT44_PORT) && defined(DOUT44_BIT))
#define DOUT44 91
#define DOUT44_MBED_PIN __mbedpin__(DOUT44_PORT, DOUT44_BIT)
#define DOUT44_GPIOREG __gpioreg__(DOUT44_PORT)
#if (DOUT44_BIT < 16)
#define DOUT44_PINHALF L
#else
#define DOUT44_PINHALF H
#endif
#define DOUT44_PINCON __pincon__(DOUT44_PORT, DOUT44_PINHALF)
#define DIO91 91
#define DIO91_MBED_PIN DOUT44_MBED_PIN
#define DIO91_PORT DOUT44_PORT
#define DIO91_BIT DOUT44_BIT
#define DIO91_GPIOREG DOUT44_GPIOREG
#define DIO91_PINHALF DOUT44_PINHALF
#define DIO91_PINCON DOUT44_PINCON
#endif
#if (defined(DOUT45_PORT) && defined(DOUT45_BIT))
#define DOUT45 92
#define DOUT45_MBED_PIN __mbedpin__(DOUT45_PORT, DOUT45_BIT)
#define DOUT45_GPIOREG __gpioreg__(DOUT45_PORT)
#if (DOUT45_BIT < 16)
#define DOUT45_PINHALF L
#else
#define DOUT45_PINHALF H
#endif
#define DOUT45_PINCON __pincon__(DOUT45_PORT, DOUT45_PINHALF)
#define DIO92 92
#define DIO92_MBED_PIN DOUT45_MBED_PIN
#define DIO92_PORT DOUT45_PORT
#define DIO92_BIT DOUT45_BIT
#define DIO92_GPIOREG DOUT45_GPIOREG
#define DIO92_PINHALF DOUT45_PINHALF
#define DIO92_PINCON DOUT45_PINCON
#endif
#if (defined(DOUT46_PORT) && defined(DOUT46_BIT))
#define DOUT46 93
#define DOUT46_MBED_PIN __mbedpin__(DOUT46_PORT, DOUT46_BIT)
#define DOUT46_GPIOREG __gpioreg__(DOUT46_PORT)
#if (DOUT46_BIT < 16)
#define DOUT46_PINHALF L
#else
#define DOUT46_PINHALF H
#endif
#define DOUT46_PINCON __pincon__(DOUT46_PORT, DOUT46_PINHALF)
#define DIO93 93
#define DIO93_MBED_PIN DOUT46_MBED_PIN
#define DIO93_PORT DOUT46_PORT
#define DIO93_BIT DOUT46_BIT
#define DIO93_GPIOREG DOUT46_GPIOREG
#define DIO93_PINHALF DOUT46_PINHALF
#define DIO93_PINCON DOUT46_PINCON
#endif
#if (defined(DOUT47_PORT) && defined(DOUT47_BIT))
#define DOUT47 94
#define DOUT47_MBED_PIN __mbedpin__(DOUT47_PORT, DOUT47_BIT)
#define DOUT47_GPIOREG __gpioreg__(DOUT47_PORT)
#if (DOUT47_BIT < 16)
#define DOUT47_PINHALF L
#else
#define DOUT47_PINHALF H
#endif
#define DOUT47_PINCON __pincon__(DOUT47_PORT, DOUT47_PINHALF)
#define DIO94 94
#define DIO94_MBED_PIN DOUT47_MBED_PIN
#define DIO94_PORT DOUT47_PORT
#define DIO94_BIT DOUT47_BIT
#define DIO94_GPIOREG DOUT47_GPIOREG
#define DIO94_PINHALF DOUT47_PINHALF
#define DIO94_PINCON DOUT47_PINCON
#endif
#if (defined(DOUT48_PORT) && defined(DOUT48_BIT))
#define DOUT48 95
#define DOUT48_MBED_PIN __mbedpin__(DOUT48_PORT, DOUT48_BIT)
#define DOUT48_GPIOREG __gpioreg__(DOUT48_PORT)
#if (DOUT48_BIT < 16)
#define DOUT48_PINHALF L
#else
#define DOUT48_PINHALF H
#endif
#define DOUT48_PINCON __pincon__(DOUT48_PORT, DOUT48_PINHALF)
#define DIO95 95
#define DIO95_MBED_PIN DOUT48_MBED_PIN
#define DIO95_PORT DOUT48_PORT
#define DIO95_BIT DOUT48_BIT
#define DIO95_GPIOREG DOUT48_GPIOREG
#define DIO95_PINHALF DOUT48_PINHALF
#define DIO95_PINCON DOUT48_PINCON
#endif
#if (defined(DOUT49_PORT) && defined(DOUT49_BIT))
#define DOUT49 96
#define DOUT49_MBED_PIN __mbedpin__(DOUT49_PORT, DOUT49_BIT)
#define DOUT49_GPIOREG __gpioreg__(DOUT49_PORT)
#if (DOUT49_BIT < 16)
#define DOUT49_PINHALF L
#else
#define DOUT49_PINHALF H
#endif
#define DOUT49_PINCON __pincon__(DOUT49_PORT, DOUT49_PINHALF)
#define DIO96 96
#define DIO96_MBED_PIN DOUT49_MBED_PIN
#define DIO96_PORT DOUT49_PORT
#define DIO96_BIT DOUT49_BIT
#define DIO96_GPIOREG DOUT49_GPIOREG
#define DIO96_PINHALF DOUT49_PINHALF
#define DIO96_PINCON DOUT49_PINCON
#endif
#if (defined(LIMIT_X_PORT) && defined(LIMIT_X_BIT))
#define LIMIT_X 100
#define LIMIT_X_MBED_PIN __mbedpin__(LIMIT_X_PORT, LIMIT_X_BIT)
#define LIMIT_X_GPIOREG __gpioreg__(LIMIT_X_PORT)
#if (LIMIT_X_BIT < 16)
#define LIMIT_X_PINHALF L
#else
#define LIMIT_X_PINHALF H
#endif
#define LIMIT_X_PINCON __pincon__(LIMIT_X_PORT, LIMIT_X_PINHALF)
#define DIO100 100
#define DIO100_MBED_PIN LIMIT_X_MBED_PIN
#define DIO100_PORT LIMIT_X_PORT
#define DIO100_BIT LIMIT_X_BIT
#define DIO100_GPIOREG LIMIT_X_GPIOREG
#define DIO100_PINHALF LIMIT_X_PINHALF
#define DIO100_PINCON LIMIT_X_PINCON
#endif
#if (defined(LIMIT_Y_PORT) && defined(LIMIT_Y_BIT))
#define LIMIT_Y 101
#define LIMIT_Y_MBED_PIN __mbedpin__(LIMIT_Y_PORT, LIMIT_Y_BIT)
#define LIMIT_Y_GPIOREG __gpioreg__(LIMIT_Y_PORT)
#if (LIMIT_Y_BIT < 16)
#define LIMIT_Y_PINHALF L
#else
#define LIMIT_Y_PINHALF H
#endif
#define LIMIT_Y_PINCON __pincon__(LIMIT_Y_PORT, LIMIT_Y_PINHALF)
#define DIO101 101
#define DIO101_MBED_PIN LIMIT_Y_MBED_PIN
#define DIO101_PORT LIMIT_Y_PORT
#define DIO101_BIT LIMIT_Y_BIT
#define DIO101_GPIOREG LIMIT_Y_GPIOREG
#define DIO101_PINHALF LIMIT_Y_PINHALF
#define DIO101_PINCON LIMIT_Y_PINCON
#endif
#if (defined(LIMIT_Z_PORT) && defined(LIMIT_Z_BIT))
#define LIMIT_Z 102
#define LIMIT_Z_MBED_PIN __mbedpin__(LIMIT_Z_PORT, LIMIT_Z_BIT)
#define LIMIT_Z_GPIOREG __gpioreg__(LIMIT_Z_PORT)
#if (LIMIT_Z_BIT < 16)
#define LIMIT_Z_PINHALF L
#else
#define LIMIT_Z_PINHALF H
#endif
#define LIMIT_Z_PINCON __pincon__(LIMIT_Z_PORT, LIMIT_Z_PINHALF)
#define DIO102 102
#define DIO102_MBED_PIN LIMIT_Z_MBED_PIN
#define DIO102_PORT LIMIT_Z_PORT
#define DIO102_BIT LIMIT_Z_BIT
#define DIO102_GPIOREG LIMIT_Z_GPIOREG
#define DIO102_PINHALF LIMIT_Z_PINHALF
#define DIO102_PINCON LIMIT_Z_PINCON
#endif
#if (defined(LIMIT_X2_PORT) && defined(LIMIT_X2_BIT))
#define LIMIT_X2 103
#define LIMIT_X2_MBED_PIN __mbedpin__(LIMIT_X2_PORT, LIMIT_X2_BIT)
#define LIMIT_X2_GPIOREG __gpioreg__(LIMIT_X2_PORT)
#if (LIMIT_X2_BIT < 16)
#define LIMIT_X2_PINHALF L
#else
#define LIMIT_X2_PINHALF H
#endif
#define LIMIT_X2_PINCON __pincon__(LIMIT_X2_PORT, LIMIT_X2_PINHALF)
#define DIO103 103
#define DIO103_MBED_PIN LIMIT_X2_MBED_PIN
#define DIO103_PORT LIMIT_X2_PORT
#define DIO103_BIT LIMIT_X2_BIT
#define DIO103_GPIOREG LIMIT_X2_GPIOREG
#define DIO103_PINHALF LIMIT_X2_PINHALF
#define DIO103_PINCON LIMIT_X2_PINCON
#endif
#if (defined(LIMIT_Y2_PORT) && defined(LIMIT_Y2_BIT))
#define LIMIT_Y2 104
#define LIMIT_Y2_MBED_PIN __mbedpin__(LIMIT_Y2_PORT, LIMIT_Y2_BIT)
#define LIMIT_Y2_GPIOREG __gpioreg__(LIMIT_Y2_PORT)
#if (LIMIT_Y2_BIT < 16)
#define LIMIT_Y2_PINHALF L
#else
#define LIMIT_Y2_PINHALF H
#endif
#define LIMIT_Y2_PINCON __pincon__(LIMIT_Y2_PORT, LIMIT_Y2_PINHALF)
#define DIO104 104
#define DIO104_MBED_PIN LIMIT_Y2_MBED_PIN
#define DIO104_PORT LIMIT_Y2_PORT
#define DIO104_BIT LIMIT_Y2_BIT
#define DIO104_GPIOREG LIMIT_Y2_GPIOREG
#define DIO104_PINHALF LIMIT_Y2_PINHALF
#define DIO104_PINCON LIMIT_Y2_PINCON
#endif
#if (defined(LIMIT_Z2_PORT) && defined(LIMIT_Z2_BIT))
#define LIMIT_Z2 105
#define LIMIT_Z2_MBED_PIN __mbedpin__(LIMIT_Z2_PORT, LIMIT_Z2_BIT)
#define LIMIT_Z2_GPIOREG __gpioreg__(LIMIT_Z2_PORT)
#if (LIMIT_Z2_BIT < 16)
#define LIMIT_Z2_PINHALF L
#else
#define LIMIT_Z2_PINHALF H
#endif
#define LIMIT_Z2_PINCON __pincon__(LIMIT_Z2_PORT, LIMIT_Z2_PINHALF)
#define DIO105 105
#define DIO105_MBED_PIN LIMIT_Z2_MBED_PIN
#define DIO105_PORT LIMIT_Z2_PORT
#define DIO105_BIT LIMIT_Z2_BIT
#define DIO105_GPIOREG LIMIT_Z2_GPIOREG
#define DIO105_PINHALF LIMIT_Z2_PINHALF
#define DIO105_PINCON LIMIT_Z2_PINCON
#endif
#if (defined(LIMIT_A_PORT) && defined(LIMIT_A_BIT))
#define LIMIT_A 106
#define LIMIT_A_MBED_PIN __mbedpin__(LIMIT_A_PORT, LIMIT_A_BIT)
#define LIMIT_A_GPIOREG __gpioreg__(LIMIT_A_PORT)
#if (LIMIT_A_BIT < 16)
#define LIMIT_A_PINHALF L
#else
#define LIMIT_A_PINHALF H
#endif
#define LIMIT_A_PINCON __pincon__(LIMIT_A_PORT, LIMIT_A_PINHALF)
#define DIO106 106
#define DIO106_MBED_PIN LIMIT_A_MBED_PIN
#define DIO106_PORT LIMIT_A_PORT
#define DIO106_BIT LIMIT_A_BIT
#define DIO106_GPIOREG LIMIT_A_GPIOREG
#define DIO106_PINHALF LIMIT_A_PINHALF
#define DIO106_PINCON LIMIT_A_PINCON
#endif
#if (defined(LIMIT_B_PORT) && defined(LIMIT_B_BIT))
#define LIMIT_B 107
#define LIMIT_B_MBED_PIN __mbedpin__(LIMIT_B_PORT, LIMIT_B_BIT)
#define LIMIT_B_GPIOREG __gpioreg__(LIMIT_B_PORT)
#if (LIMIT_B_BIT < 16)
#define LIMIT_B_PINHALF L
#else
#define LIMIT_B_PINHALF H
#endif
#define LIMIT_B_PINCON __pincon__(LIMIT_B_PORT, LIMIT_B_PINHALF)
#define DIO107 107
#define DIO107_MBED_PIN LIMIT_B_MBED_PIN
#define DIO107_PORT LIMIT_B_PORT
#define DIO107_BIT LIMIT_B_BIT
#define DIO107_GPIOREG LIMIT_B_GPIOREG
#define DIO107_PINHALF LIMIT_B_PINHALF
#define DIO107_PINCON LIMIT_B_PINCON
#endif
#if (defined(LIMIT_C_PORT) && defined(LIMIT_C_BIT))
#define LIMIT_C 108
#define LIMIT_C_MBED_PIN __mbedpin__(LIMIT_C_PORT, LIMIT_C_BIT)
#define LIMIT_C_GPIOREG __gpioreg__(LIMIT_C_PORT)
#if (LIMIT_C_BIT < 16)
#define LIMIT_C_PINHALF L
#else
#define LIMIT_C_PINHALF H
#endif
#define LIMIT_C_PINCON __pincon__(LIMIT_C_PORT, LIMIT_C_PINHALF)
#define DIO108 108
#define DIO108_MBED_PIN LIMIT_C_MBED_PIN
#define DIO108_PORT LIMIT_C_PORT
#define DIO108_BIT LIMIT_C_BIT
#define DIO108_GPIOREG LIMIT_C_GPIOREG
#define DIO108_PINHALF LIMIT_C_PINHALF
#define DIO108_PINCON LIMIT_C_PINCON
#endif
#if (defined(PROBE_PORT) && defined(PROBE_BIT))
#define PROBE 109
#define PROBE_MBED_PIN __mbedpin__(PROBE_PORT, PROBE_BIT)
#define PROBE_GPIOREG __gpioreg__(PROBE_PORT)
#if (PROBE_BIT < 16)
#define PROBE_PINHALF L
#else
#define PROBE_PINHALF H
#endif
#define PROBE_PINCON __pincon__(PROBE_PORT, PROBE_PINHALF)
#define DIO109 109
#define DIO109_MBED_PIN PROBE_MBED_PIN
#define DIO109_PORT PROBE_PORT
#define DIO109_BIT PROBE_BIT
#define DIO109_GPIOREG PROBE_GPIOREG
#define DIO109_PINHALF PROBE_PINHALF
#define DIO109_PINCON PROBE_PINCON
#endif
#if (defined(ESTOP_PORT) && defined(ESTOP_BIT))
#define ESTOP 110
#define ESTOP_MBED_PIN __mbedpin__(ESTOP_PORT, ESTOP_BIT)
#define ESTOP_GPIOREG __gpioreg__(ESTOP_PORT)
#if (ESTOP_BIT < 16)
#define ESTOP_PINHALF L
#else
#define ESTOP_PINHALF H
#endif
#define ESTOP_PINCON __pincon__(ESTOP_PORT, ESTOP_PINHALF)
#define DIO110 110
#define DIO110_MBED_PIN ESTOP_MBED_PIN
#define DIO110_PORT ESTOP_PORT
#define DIO110_BIT ESTOP_BIT
#define DIO110_GPIOREG ESTOP_GPIOREG
#define DIO110_PINHALF ESTOP_PINHALF
#define DIO110_PINCON ESTOP_PINCON
#endif
#if (defined(SAFETY_DOOR_PORT) && defined(SAFETY_DOOR_BIT))
#define SAFETY_DOOR 111
#define SAFETY_DOOR_MBED_PIN __mbedpin__(SAFETY_DOOR_PORT, SAFETY_DOOR_BIT)
#define SAFETY_DOOR_GPIOREG __gpioreg__(SAFETY_DOOR_PORT)
#if (SAFETY_DOOR_BIT < 16)
#define SAFETY_DOOR_PINHALF L
#else
#define SAFETY_DOOR_PINHALF H
#endif
#define SAFETY_DOOR_PINCON __pincon__(SAFETY_DOOR_PORT, SAFETY_DOOR_PINHALF)
#define DIO111 111
#define DIO111_MBED_PIN SAFETY_DOOR_MBED_PIN
#define DIO111_PORT SAFETY_DOOR_PORT
#define DIO111_BIT SAFETY_DOOR_BIT
#define DIO111_GPIOREG SAFETY_DOOR_GPIOREG
#define DIO111_PINHALF SAFETY_DOOR_PINHALF
#define DIO111_PINCON SAFETY_DOOR_PINCON
#endif
#if (defined(FHOLD_PORT) && defined(FHOLD_BIT))
#define FHOLD 112
#define FHOLD_MBED_PIN __mbedpin__(FHOLD_PORT, FHOLD_BIT)
#define FHOLD_GPIOREG __gpioreg__(FHOLD_PORT)
#if (FHOLD_BIT < 16)
#define FHOLD_PINHALF L
#else
#define FHOLD_PINHALF H
#endif
#define FHOLD_PINCON __pincon__(FHOLD_PORT, FHOLD_PINHALF)
#define DIO112 112
#define DIO112_MBED_PIN FHOLD_MBED_PIN
#define DIO112_PORT FHOLD_PORT
#define DIO112_BIT FHOLD_BIT
#define DIO112_GPIOREG FHOLD_GPIOREG
#define DIO112_PINHALF FHOLD_PINHALF
#define DIO112_PINCON FHOLD_PINCON
#endif
#if (defined(CS_RES_PORT) && defined(CS_RES_BIT))
#define CS_RES 113
#define CS_RES_MBED_PIN __mbedpin__(CS_RES_PORT, CS_RES_BIT)
#define CS_RES_GPIOREG __gpioreg__(CS_RES_PORT)
#if (CS_RES_BIT < 16)
#define CS_RES_PINHALF L
#else
#define CS_RES_PINHALF H
#endif
#define CS_RES_PINCON __pincon__(CS_RES_PORT, CS_RES_PINHALF)
#define DIO113 113
#define DIO113_MBED_PIN CS_RES_MBED_PIN
#define DIO113_PORT CS_RES_PORT
#define DIO113_BIT CS_RES_BIT
#define DIO113_GPIOREG CS_RES_GPIOREG
#define DIO113_PINHALF CS_RES_PINHALF
#define DIO113_PINCON CS_RES_PINCON
#endif
#if (defined(ANALOG0_PORT) && defined(ANALOG0_BIT))
#define ANALOG0 114
#define ANALOG0_MBED_PIN __mbedpin__(ANALOG0_PORT, ANALOG0_BIT)
#define ANALOG0_GPIOREG __gpioreg__(ANALOG0_PORT)
#if (ANALOG0_BIT < 16)
#define ANALOG0_PINHALF L
#else
#define ANALOG0_PINHALF H
#endif
#define ANALOG0_PINCON __pincon__(ANALOG0_PORT, ANALOG0_PINHALF)
#define DIO114 114
#define DIO114_MBED_PIN ANALOG0_MBED_PIN
#define DIO114_PORT ANALOG0_PORT
#define DIO114_BIT ANALOG0_BIT
#define DIO114_GPIOREG ANALOG0_GPIOREG
#define DIO114_PINHALF ANALOG0_PINHALF
#define DIO114_PINCON ANALOG0_PINCON
#endif
#if (defined(ANALOG1_PORT) && defined(ANALOG1_BIT))
#define ANALOG1 115
#define ANALOG1_MBED_PIN __mbedpin__(ANALOG1_PORT, ANALOG1_BIT)
#define ANALOG1_GPIOREG __gpioreg__(ANALOG1_PORT)
#if (ANALOG1_BIT < 16)
#define ANALOG1_PINHALF L
#else
#define ANALOG1_PINHALF H
#endif
#define ANALOG1_PINCON __pincon__(ANALOG1_PORT, ANALOG1_PINHALF)
#define DIO115 115
#define DIO115_MBED_PIN ANALOG1_MBED_PIN
#define DIO115_PORT ANALOG1_PORT
#define DIO115_BIT ANALOG1_BIT
#define DIO115_GPIOREG ANALOG1_GPIOREG
#define DIO115_PINHALF ANALOG1_PINHALF
#define DIO115_PINCON ANALOG1_PINCON
#endif
#if (defined(ANALOG2_PORT) && defined(ANALOG2_BIT))
#define ANALOG2 116
#define ANALOG2_MBED_PIN __mbedpin__(ANALOG2_PORT, ANALOG2_BIT)
#define ANALOG2_GPIOREG __gpioreg__(ANALOG2_PORT)
#if (ANALOG2_BIT < 16)
#define ANALOG2_PINHALF L
#else
#define ANALOG2_PINHALF H
#endif
#define ANALOG2_PINCON __pincon__(ANALOG2_PORT, ANALOG2_PINHALF)
#define DIO116 116
#define DIO116_MBED_PIN ANALOG2_MBED_PIN
#define DIO116_PORT ANALOG2_PORT
#define DIO116_BIT ANALOG2_BIT
#define DIO116_GPIOREG ANALOG2_GPIOREG
#define DIO116_PINHALF ANALOG2_PINHALF
#define DIO116_PINCON ANALOG2_PINCON
#endif
#if (defined(ANALOG3_PORT) && defined(ANALOG3_BIT))
#define ANALOG3 117
#define ANALOG3_MBED_PIN __mbedpin__(ANALOG3_PORT, ANALOG3_BIT)
#define ANALOG3_GPIOREG __gpioreg__(ANALOG3_PORT)
#if (ANALOG3_BIT < 16)
#define ANALOG3_PINHALF L
#else
#define ANALOG3_PINHALF H
#endif
#define ANALOG3_PINCON __pincon__(ANALOG3_PORT, ANALOG3_PINHALF)
#define DIO117 117
#define DIO117_MBED_PIN ANALOG3_MBED_PIN
#define DIO117_PORT ANALOG3_PORT
#define DIO117_BIT ANALOG3_BIT
#define DIO117_GPIOREG ANALOG3_GPIOREG
#define DIO117_PINHALF ANALOG3_PINHALF
#define DIO117_PINCON ANALOG3_PINCON
#endif
#if (defined(ANALOG4_PORT) && defined(ANALOG4_BIT))
#define ANALOG4 118
#define ANALOG4_MBED_PIN __mbedpin__(ANALOG4_PORT, ANALOG4_BIT)
#define ANALOG4_GPIOREG __gpioreg__(ANALOG4_PORT)
#if (ANALOG4_BIT < 16)
#define ANALOG4_PINHALF L
#else
#define ANALOG4_PINHALF H
#endif
#define ANALOG4_PINCON __pincon__(ANALOG4_PORT, ANALOG4_PINHALF)
#define DIO118 118
#define DIO118_MBED_PIN ANALOG4_MBED_PIN
#define DIO118_PORT ANALOG4_PORT
#define DIO118_BIT ANALOG4_BIT
#define DIO118_GPIOREG ANALOG4_GPIOREG
#define DIO118_PINHALF ANALOG4_PINHALF
#define DIO118_PINCON ANALOG4_PINCON
#endif
#if (defined(ANALOG5_PORT) && defined(ANALOG5_BIT))
#define ANALOG5 119
#define ANALOG5_MBED_PIN __mbedpin__(ANALOG5_PORT, ANALOG5_BIT)
#define ANALOG5_GPIOREG __gpioreg__(ANALOG5_PORT)
#if (ANALOG5_BIT < 16)
#define ANALOG5_PINHALF L
#else
#define ANALOG5_PINHALF H
#endif
#define ANALOG5_PINCON __pincon__(ANALOG5_PORT, ANALOG5_PINHALF)
#define DIO119 119
#define DIO119_MBED_PIN ANALOG5_MBED_PIN
#define DIO119_PORT ANALOG5_PORT
#define DIO119_BIT ANALOG5_BIT
#define DIO119_GPIOREG ANALOG5_GPIOREG
#define DIO119_PINHALF ANALOG5_PINHALF
#define DIO119_PINCON ANALOG5_PINCON
#endif
#if (defined(ANALOG6_PORT) && defined(ANALOG6_BIT))
#define ANALOG6 120
#define ANALOG6_MBED_PIN __mbedpin__(ANALOG6_PORT, ANALOG6_BIT)
#define ANALOG6_GPIOREG __gpioreg__(ANALOG6_PORT)
#if (ANALOG6_BIT < 16)
#define ANALOG6_PINHALF L
#else
#define ANALOG6_PINHALF H
#endif
#define ANALOG6_PINCON __pincon__(ANALOG6_PORT, ANALOG6_PINHALF)
#define DIO120 120
#define DIO120_MBED_PIN ANALOG6_MBED_PIN
#define DIO120_PORT ANALOG6_PORT
#define DIO120_BIT ANALOG6_BIT
#define DIO120_GPIOREG ANALOG6_GPIOREG
#define DIO120_PINHALF ANALOG6_PINHALF
#define DIO120_PINCON ANALOG6_PINCON
#endif
#if (defined(ANALOG7_PORT) && defined(ANALOG7_BIT))
#define ANALOG7 121
#define ANALOG7_MBED_PIN __mbedpin__(ANALOG7_PORT, ANALOG7_BIT)
#define ANALOG7_GPIOREG __gpioreg__(ANALOG7_PORT)
#if (ANALOG7_BIT < 16)
#define ANALOG7_PINHALF L
#else
#define ANALOG7_PINHALF H
#endif
#define ANALOG7_PINCON __pincon__(ANALOG7_PORT, ANALOG7_PINHALF)
#define DIO121 121
#define DIO121_MBED_PIN ANALOG7_MBED_PIN
#define DIO121_PORT ANALOG7_PORT
#define DIO121_BIT ANALOG7_BIT
#define DIO121_GPIOREG ANALOG7_GPIOREG
#define DIO121_PINHALF ANALOG7_PINHALF
#define DIO121_PINCON ANALOG7_PINCON
#endif
#if (defined(ANALOG8_PORT) && defined(ANALOG8_BIT))
#define ANALOG8 122
#define ANALOG8_MBED_PIN __mbedpin__(ANALOG8_PORT, ANALOG8_BIT)
#define ANALOG8_GPIOREG __gpioreg__(ANALOG8_PORT)
#if (ANALOG8_BIT < 16)
#define ANALOG8_PINHALF L
#else
#define ANALOG8_PINHALF H
#endif
#define ANALOG8_PINCON __pincon__(ANALOG8_PORT, ANALOG8_PINHALF)
#define DIO122 122
#define DIO122_MBED_PIN ANALOG8_MBED_PIN
#define DIO122_PORT ANALOG8_PORT
#define DIO122_BIT ANALOG8_BIT
#define DIO122_GPIOREG ANALOG8_GPIOREG
#define DIO122_PINHALF ANALOG8_PINHALF
#define DIO122_PINCON ANALOG8_PINCON
#endif
#if (defined(ANALOG9_PORT) && defined(ANALOG9_BIT))
#define ANALOG9 123
#define ANALOG9_MBED_PIN __mbedpin__(ANALOG9_PORT, ANALOG9_BIT)
#define ANALOG9_GPIOREG __gpioreg__(ANALOG9_PORT)
#if (ANALOG9_BIT < 16)
#define ANALOG9_PINHALF L
#else
#define ANALOG9_PINHALF H
#endif
#define ANALOG9_PINCON __pincon__(ANALOG9_PORT, ANALOG9_PINHALF)
#define DIO123 123
#define DIO123_MBED_PIN ANALOG9_MBED_PIN
#define DIO123_PORT ANALOG9_PORT
#define DIO123_BIT ANALOG9_BIT
#define DIO123_GPIOREG ANALOG9_GPIOREG
#define DIO123_PINHALF ANALOG9_PINHALF
#define DIO123_PINCON ANALOG9_PINCON
#endif
#if (defined(ANALOG10_PORT) && defined(ANALOG10_BIT))
#define ANALOG10 124
#define ANALOG10_MBED_PIN __mbedpin__(ANALOG10_PORT, ANALOG10_BIT)
#define ANALOG10_GPIOREG __gpioreg__(ANALOG10_PORT)
#if (ANALOG10_BIT < 16)
#define ANALOG10_PINHALF L
#else
#define ANALOG10_PINHALF H
#endif
#define ANALOG10_PINCON __pincon__(ANALOG10_PORT, ANALOG10_PINHALF)
#define DIO124 124
#define DIO124_MBED_PIN ANALOG10_MBED_PIN
#define DIO124_PORT ANALOG10_PORT
#define DIO124_BIT ANALOG10_BIT
#define DIO124_GPIOREG ANALOG10_GPIOREG
#define DIO124_PINHALF ANALOG10_PINHALF
#define DIO124_PINCON ANALOG10_PINCON
#endif
#if (defined(ANALOG11_PORT) && defined(ANALOG11_BIT))
#define ANALOG11 125
#define ANALOG11_MBED_PIN __mbedpin__(ANALOG11_PORT, ANALOG11_BIT)
#define ANALOG11_GPIOREG __gpioreg__(ANALOG11_PORT)
#if (ANALOG11_BIT < 16)
#define ANALOG11_PINHALF L
#else
#define ANALOG11_PINHALF H
#endif
#define ANALOG11_PINCON __pincon__(ANALOG11_PORT, ANALOG11_PINHALF)
#define DIO125 125
#define DIO125_MBED_PIN ANALOG11_MBED_PIN
#define DIO125_PORT ANALOG11_PORT
#define DIO125_BIT ANALOG11_BIT
#define DIO125_GPIOREG ANALOG11_GPIOREG
#define DIO125_PINHALF ANALOG11_PINHALF
#define DIO125_PINCON ANALOG11_PINCON
#endif
#if (defined(ANALOG12_PORT) && defined(ANALOG12_BIT))
#define ANALOG12 126
#define ANALOG12_MBED_PIN __mbedpin__(ANALOG12_PORT, ANALOG12_BIT)
#define ANALOG12_GPIOREG __gpioreg__(ANALOG12_PORT)
#if (ANALOG12_BIT < 16)
#define ANALOG12_PINHALF L
#else
#define ANALOG12_PINHALF H
#endif
#define ANALOG12_PINCON __pincon__(ANALOG12_PORT, ANALOG12_PINHALF)
#define DIO126 126
#define DIO126_MBED_PIN ANALOG12_MBED_PIN
#define DIO126_PORT ANALOG12_PORT
#define DIO126_BIT ANALOG12_BIT
#define DIO126_GPIOREG ANALOG12_GPIOREG
#define DIO126_PINHALF ANALOG12_PINHALF
#define DIO126_PINCON ANALOG12_PINCON
#endif
#if (defined(ANALOG13_PORT) && defined(ANALOG13_BIT))
#define ANALOG13 127
#define ANALOG13_MBED_PIN __mbedpin__(ANALOG13_PORT, ANALOG13_BIT)
#define ANALOG13_GPIOREG __gpioreg__(ANALOG13_PORT)
#if (ANALOG13_BIT < 16)
#define ANALOG13_PINHALF L
#else
#define ANALOG13_PINHALF H
#endif
#define ANALOG13_PINCON __pincon__(ANALOG13_PORT, ANALOG13_PINHALF)
#define DIO127 127
#define DIO127_MBED_PIN ANALOG13_MBED_PIN
#define DIO127_PORT ANALOG13_PORT
#define DIO127_BIT ANALOG13_BIT
#define DIO127_GPIOREG ANALOG13_GPIOREG
#define DIO127_PINHALF ANALOG13_PINHALF
#define DIO127_PINCON ANALOG13_PINCON
#endif
#if (defined(ANALOG14_PORT) && defined(ANALOG14_BIT))
#define ANALOG14 128
#define ANALOG14_MBED_PIN __mbedpin__(ANALOG14_PORT, ANALOG14_BIT)
#define ANALOG14_GPIOREG __gpioreg__(ANALOG14_PORT)
#if (ANALOG14_BIT < 16)
#define ANALOG14_PINHALF L
#else
#define ANALOG14_PINHALF H
#endif
#define ANALOG14_PINCON __pincon__(ANALOG14_PORT, ANALOG14_PINHALF)
#define DIO128 128
#define DIO128_MBED_PIN ANALOG14_MBED_PIN
#define DIO128_PORT ANALOG14_PORT
#define DIO128_BIT ANALOG14_BIT
#define DIO128_GPIOREG ANALOG14_GPIOREG
#define DIO128_PINHALF ANALOG14_PINHALF
#define DIO128_PINCON ANALOG14_PINCON
#endif
#if (defined(ANALOG15_PORT) && defined(ANALOG15_BIT))
#define ANALOG15 129
#define ANALOG15_MBED_PIN __mbedpin__(ANALOG15_PORT, ANALOG15_BIT)
#define ANALOG15_GPIOREG __gpioreg__(ANALOG15_PORT)
#if (ANALOG15_BIT < 16)
#define ANALOG15_PINHALF L
#else
#define ANALOG15_PINHALF H
#endif
#define ANALOG15_PINCON __pincon__(ANALOG15_PORT, ANALOG15_PINHALF)
#define DIO129 129
#define DIO129_MBED_PIN ANALOG15_MBED_PIN
#define DIO129_PORT ANALOG15_PORT
#define DIO129_BIT ANALOG15_BIT
#define DIO129_GPIOREG ANALOG15_GPIOREG
#define DIO129_PINHALF ANALOG15_PINHALF
#define DIO129_PINCON ANALOG15_PINCON
#endif
#if (defined(DIN0_PORT) && defined(DIN0_BIT))
#define DIN0 130
#define DIN0_MBED_PIN __mbedpin__(DIN0_PORT, DIN0_BIT)
#define DIN0_GPIOREG __gpioreg__(DIN0_PORT)
#if (DIN0_BIT < 16)
#define DIN0_PINHALF L
#else
#define DIN0_PINHALF H
#endif
#define DIN0_PINCON __pincon__(DIN0_PORT, DIN0_PINHALF)
#define DIO130 130
#define DIO130_MBED_PIN DIN0_MBED_PIN
#define DIO130_PORT DIN0_PORT
#define DIO130_BIT DIN0_BIT
#define DIO130_GPIOREG DIN0_GPIOREG
#define DIO130_PINHALF DIN0_PINHALF
#define DIO130_PINCON DIN0_PINCON
#endif
#if (defined(DIN1_PORT) && defined(DIN1_BIT))
#define DIN1 131
#define DIN1_MBED_PIN __mbedpin__(DIN1_PORT, DIN1_BIT)
#define DIN1_GPIOREG __gpioreg__(DIN1_PORT)
#if (DIN1_BIT < 16)
#define DIN1_PINHALF L
#else
#define DIN1_PINHALF H
#endif
#define DIN1_PINCON __pincon__(DIN1_PORT, DIN1_PINHALF)
#define DIO131 131
#define DIO131_MBED_PIN DIN1_MBED_PIN
#define DIO131_PORT DIN1_PORT
#define DIO131_BIT DIN1_BIT
#define DIO131_GPIOREG DIN1_GPIOREG
#define DIO131_PINHALF DIN1_PINHALF
#define DIO131_PINCON DIN1_PINCON
#endif
#if (defined(DIN2_PORT) && defined(DIN2_BIT))
#define DIN2 132
#define DIN2_MBED_PIN __mbedpin__(DIN2_PORT, DIN2_BIT)
#define DIN2_GPIOREG __gpioreg__(DIN2_PORT)
#if (DIN2_BIT < 16)
#define DIN2_PINHALF L
#else
#define DIN2_PINHALF H
#endif
#define DIN2_PINCON __pincon__(DIN2_PORT, DIN2_PINHALF)
#define DIO132 132
#define DIO132_MBED_PIN DIN2_MBED_PIN
#define DIO132_PORT DIN2_PORT
#define DIO132_BIT DIN2_BIT
#define DIO132_GPIOREG DIN2_GPIOREG
#define DIO132_PINHALF DIN2_PINHALF
#define DIO132_PINCON DIN2_PINCON
#endif
#if (defined(DIN3_PORT) && defined(DIN3_BIT))
#define DIN3 133
#define DIN3_MBED_PIN __mbedpin__(DIN3_PORT, DIN3_BIT)
#define DIN3_GPIOREG __gpioreg__(DIN3_PORT)
#if (DIN3_BIT < 16)
#define DIN3_PINHALF L
#else
#define DIN3_PINHALF H
#endif
#define DIN3_PINCON __pincon__(DIN3_PORT, DIN3_PINHALF)
