Paciente8159/uCNC/uCNC/src/hal/mcus/lpc176x/mcumap_lpc176x.h
#define DIO133 133
#define DIO133_MBED_PIN DIN3_MBED_PIN
#define DIO133_PORT DIN3_PORT
#define DIO133_BIT DIN3_BIT
#define DIO133_GPIOREG DIN3_GPIOREG
#define DIO133_PINHALF DIN3_PINHALF
#define DIO133_PINCON DIN3_PINCON
#endif
#if (defined(DIN4_PORT) && defined(DIN4_BIT))
#define DIN4 134
#define DIN4_MBED_PIN __mbedpin__(DIN4_PORT, DIN4_BIT)
#define DIN4_GPIOREG __gpioreg__(DIN4_PORT)
#if (DIN4_BIT < 16)
#define DIN4_PINHALF L
#else
#define DIN4_PINHALF H
#endif
#define DIN4_PINCON __pincon__(DIN4_PORT, DIN4_PINHALF)
#define DIO134 134
#define DIO134_MBED_PIN DIN4_MBED_PIN
#define DIO134_PORT DIN4_PORT
#define DIO134_BIT DIN4_BIT
#define DIO134_GPIOREG DIN4_GPIOREG
#define DIO134_PINHALF DIN4_PINHALF
#define DIO134_PINCON DIN4_PINCON
#endif
#if (defined(DIN5_PORT) && defined(DIN5_BIT))
#define DIN5 135
#define DIN5_MBED_PIN __mbedpin__(DIN5_PORT, DIN5_BIT)
#define DIN5_GPIOREG __gpioreg__(DIN5_PORT)
#if (DIN5_BIT < 16)
#define DIN5_PINHALF L
#else
#define DIN5_PINHALF H
#endif
#define DIN5_PINCON __pincon__(DIN5_PORT, DIN5_PINHALF)
#define DIO135 135
#define DIO135_MBED_PIN DIN5_MBED_PIN
#define DIO135_PORT DIN5_PORT
#define DIO135_BIT DIN5_BIT
#define DIO135_GPIOREG DIN5_GPIOREG
#define DIO135_PINHALF DIN5_PINHALF
#define DIO135_PINCON DIN5_PINCON
#endif
#if (defined(DIN6_PORT) && defined(DIN6_BIT))
#define DIN6 136
#define DIN6_MBED_PIN __mbedpin__(DIN6_PORT, DIN6_BIT)
#define DIN6_GPIOREG __gpioreg__(DIN6_PORT)
#if (DIN6_BIT < 16)
#define DIN6_PINHALF L
#else
#define DIN6_PINHALF H
#endif
#define DIN6_PINCON __pincon__(DIN6_PORT, DIN6_PINHALF)
#define DIO136 136
#define DIO136_MBED_PIN DIN6_MBED_PIN
#define DIO136_PORT DIN6_PORT
#define DIO136_BIT DIN6_BIT
#define DIO136_GPIOREG DIN6_GPIOREG
#define DIO136_PINHALF DIN6_PINHALF
#define DIO136_PINCON DIN6_PINCON
#endif
#if (defined(DIN7_PORT) && defined(DIN7_BIT))
#define DIN7 137
#define DIN7_MBED_PIN __mbedpin__(DIN7_PORT, DIN7_BIT)
#define DIN7_GPIOREG __gpioreg__(DIN7_PORT)
#if (DIN7_BIT < 16)
#define DIN7_PINHALF L
#else
#define DIN7_PINHALF H
#endif
#define DIN7_PINCON __pincon__(DIN7_PORT, DIN7_PINHALF)
#define DIO137 137
#define DIO137_MBED_PIN DIN7_MBED_PIN
#define DIO137_PORT DIN7_PORT
#define DIO137_BIT DIN7_BIT
#define DIO137_GPIOREG DIN7_GPIOREG
#define DIO137_PINHALF DIN7_PINHALF
#define DIO137_PINCON DIN7_PINCON
#endif
#if (defined(DIN8_PORT) && defined(DIN8_BIT))
#define DIN8 138
#define DIN8_MBED_PIN __mbedpin__(DIN8_PORT, DIN8_BIT)
#define DIN8_GPIOREG __gpioreg__(DIN8_PORT)
#if (DIN8_BIT < 16)
#define DIN8_PINHALF L
#else
#define DIN8_PINHALF H
#endif
#define DIN8_PINCON __pincon__(DIN8_PORT, DIN8_PINHALF)
#define DIO138 138
#define DIO138_MBED_PIN DIN8_MBED_PIN
#define DIO138_PORT DIN8_PORT
#define DIO138_BIT DIN8_BIT
#define DIO138_GPIOREG DIN8_GPIOREG
#define DIO138_PINHALF DIN8_PINHALF
#define DIO138_PINCON DIN8_PINCON
#endif
#if (defined(DIN9_PORT) && defined(DIN9_BIT))
#define DIN9 139
#define DIN9_MBED_PIN __mbedpin__(DIN9_PORT, DIN9_BIT)
#define DIN9_GPIOREG __gpioreg__(DIN9_PORT)
#if (DIN9_BIT < 16)
#define DIN9_PINHALF L
#else
#define DIN9_PINHALF H
#endif
#define DIN9_PINCON __pincon__(DIN9_PORT, DIN9_PINHALF)
#define DIO139 139
#define DIO139_MBED_PIN DIN9_MBED_PIN
#define DIO139_PORT DIN9_PORT
#define DIO139_BIT DIN9_BIT
#define DIO139_GPIOREG DIN9_GPIOREG
#define DIO139_PINHALF DIN9_PINHALF
#define DIO139_PINCON DIN9_PINCON
#endif
#if (defined(DIN10_PORT) && defined(DIN10_BIT))
#define DIN10 140
#define DIN10_MBED_PIN __mbedpin__(DIN10_PORT, DIN10_BIT)
#define DIN10_GPIOREG __gpioreg__(DIN10_PORT)
#if (DIN10_BIT < 16)
#define DIN10_PINHALF L
#else
#define DIN10_PINHALF H
#endif
#define DIN10_PINCON __pincon__(DIN10_PORT, DIN10_PINHALF)
#define DIO140 140
#define DIO140_MBED_PIN DIN10_MBED_PIN
#define DIO140_PORT DIN10_PORT
#define DIO140_BIT DIN10_BIT
#define DIO140_GPIOREG DIN10_GPIOREG
#define DIO140_PINHALF DIN10_PINHALF
#define DIO140_PINCON DIN10_PINCON
#endif
#if (defined(DIN11_PORT) && defined(DIN11_BIT))
#define DIN11 141
#define DIN11_MBED_PIN __mbedpin__(DIN11_PORT, DIN11_BIT)
#define DIN11_GPIOREG __gpioreg__(DIN11_PORT)
#if (DIN11_BIT < 16)
#define DIN11_PINHALF L
#else
#define DIN11_PINHALF H
#endif
#define DIN11_PINCON __pincon__(DIN11_PORT, DIN11_PINHALF)
#define DIO141 141
#define DIO141_MBED_PIN DIN11_MBED_PIN
#define DIO141_PORT DIN11_PORT
#define DIO141_BIT DIN11_BIT
#define DIO141_GPIOREG DIN11_GPIOREG
#define DIO141_PINHALF DIN11_PINHALF
#define DIO141_PINCON DIN11_PINCON
#endif
#if (defined(DIN12_PORT) && defined(DIN12_BIT))
#define DIN12 142
#define DIN12_MBED_PIN __mbedpin__(DIN12_PORT, DIN12_BIT)
#define DIN12_GPIOREG __gpioreg__(DIN12_PORT)
#if (DIN12_BIT < 16)
#define DIN12_PINHALF L
#else
#define DIN12_PINHALF H
#endif
#define DIN12_PINCON __pincon__(DIN12_PORT, DIN12_PINHALF)
#define DIO142 142
#define DIO142_MBED_PIN DIN12_MBED_PIN
#define DIO142_PORT DIN12_PORT
#define DIO142_BIT DIN12_BIT
#define DIO142_GPIOREG DIN12_GPIOREG
#define DIO142_PINHALF DIN12_PINHALF
#define DIO142_PINCON DIN12_PINCON
#endif
#if (defined(DIN13_PORT) && defined(DIN13_BIT))
#define DIN13 143
#define DIN13_MBED_PIN __mbedpin__(DIN13_PORT, DIN13_BIT)
#define DIN13_GPIOREG __gpioreg__(DIN13_PORT)
#if (DIN13_BIT < 16)
#define DIN13_PINHALF L
#else
#define DIN13_PINHALF H
#endif
#define DIN13_PINCON __pincon__(DIN13_PORT, DIN13_PINHALF)
#define DIO143 143
#define DIO143_MBED_PIN DIN13_MBED_PIN
#define DIO143_PORT DIN13_PORT
#define DIO143_BIT DIN13_BIT
#define DIO143_GPIOREG DIN13_GPIOREG
#define DIO143_PINHALF DIN13_PINHALF
#define DIO143_PINCON DIN13_PINCON
#endif
#if (defined(DIN14_PORT) && defined(DIN14_BIT))
#define DIN14 144
#define DIN14_MBED_PIN __mbedpin__(DIN14_PORT, DIN14_BIT)
#define DIN14_GPIOREG __gpioreg__(DIN14_PORT)
#if (DIN14_BIT < 16)
#define DIN14_PINHALF L
#else
#define DIN14_PINHALF H
#endif
#define DIN14_PINCON __pincon__(DIN14_PORT, DIN14_PINHALF)
#define DIO144 144
#define DIO144_MBED_PIN DIN14_MBED_PIN
#define DIO144_PORT DIN14_PORT
#define DIO144_BIT DIN14_BIT
#define DIO144_GPIOREG DIN14_GPIOREG
#define DIO144_PINHALF DIN14_PINHALF
#define DIO144_PINCON DIN14_PINCON
#endif
#if (defined(DIN15_PORT) && defined(DIN15_BIT))
#define DIN15 145
#define DIN15_MBED_PIN __mbedpin__(DIN15_PORT, DIN15_BIT)
#define DIN15_GPIOREG __gpioreg__(DIN15_PORT)
#if (DIN15_BIT < 16)
#define DIN15_PINHALF L
#else
#define DIN15_PINHALF H
#endif
#define DIN15_PINCON __pincon__(DIN15_PORT, DIN15_PINHALF)
#define DIO145 145
#define DIO145_MBED_PIN DIN15_MBED_PIN
#define DIO145_PORT DIN15_PORT
#define DIO145_BIT DIN15_BIT
#define DIO145_GPIOREG DIN15_GPIOREG
#define DIO145_PINHALF DIN15_PINHALF
#define DIO145_PINCON DIN15_PINCON
#endif
#if (defined(DIN16_PORT) && defined(DIN16_BIT))
#define DIN16 146
#define DIN16_MBED_PIN __mbedpin__(DIN16_PORT, DIN16_BIT)
#define DIN16_GPIOREG __gpioreg__(DIN16_PORT)
#if (DIN16_BIT < 16)
#define DIN16_PINHALF L
#else
#define DIN16_PINHALF H
#endif
#define DIN16_PINCON __pincon__(DIN16_PORT, DIN16_PINHALF)
#define DIO146 146
#define DIO146_MBED_PIN DIN16_MBED_PIN
#define DIO146_PORT DIN16_PORT
#define DIO146_BIT DIN16_BIT
#define DIO146_GPIOREG DIN16_GPIOREG
#define DIO146_PINHALF DIN16_PINHALF
#define DIO146_PINCON DIN16_PINCON
#endif
#if (defined(DIN17_PORT) && defined(DIN17_BIT))
#define DIN17 147
#define DIN17_MBED_PIN __mbedpin__(DIN17_PORT, DIN17_BIT)
#define DIN17_GPIOREG __gpioreg__(DIN17_PORT)
#if (DIN17_BIT < 16)
#define DIN17_PINHALF L
#else
#define DIN17_PINHALF H
#endif
#define DIN17_PINCON __pincon__(DIN17_PORT, DIN17_PINHALF)
#define DIO147 147
#define DIO147_MBED_PIN DIN17_MBED_PIN
#define DIO147_PORT DIN17_PORT
#define DIO147_BIT DIN17_BIT
#define DIO147_GPIOREG DIN17_GPIOREG
#define DIO147_PINHALF DIN17_PINHALF
#define DIO147_PINCON DIN17_PINCON
#endif
#if (defined(DIN18_PORT) && defined(DIN18_BIT))
#define DIN18 148
#define DIN18_MBED_PIN __mbedpin__(DIN18_PORT, DIN18_BIT)
#define DIN18_GPIOREG __gpioreg__(DIN18_PORT)
#if (DIN18_BIT < 16)
#define DIN18_PINHALF L
#else
#define DIN18_PINHALF H
#endif
#define DIN18_PINCON __pincon__(DIN18_PORT, DIN18_PINHALF)
#define DIO148 148
#define DIO148_MBED_PIN DIN18_MBED_PIN
#define DIO148_PORT DIN18_PORT
#define DIO148_BIT DIN18_BIT
#define DIO148_GPIOREG DIN18_GPIOREG
#define DIO148_PINHALF DIN18_PINHALF
#define DIO148_PINCON DIN18_PINCON
#endif
#if (defined(DIN19_PORT) && defined(DIN19_BIT))
#define DIN19 149
#define DIN19_MBED_PIN __mbedpin__(DIN19_PORT, DIN19_BIT)
#define DIN19_GPIOREG __gpioreg__(DIN19_PORT)
#if (DIN19_BIT < 16)
#define DIN19_PINHALF L
#else
#define DIN19_PINHALF H
#endif
#define DIN19_PINCON __pincon__(DIN19_PORT, DIN19_PINHALF)
#define DIO149 149
#define DIO149_MBED_PIN DIN19_MBED_PIN
#define DIO149_PORT DIN19_PORT
#define DIO149_BIT DIN19_BIT
#define DIO149_GPIOREG DIN19_GPIOREG
#define DIO149_PINHALF DIN19_PINHALF
#define DIO149_PINCON DIN19_PINCON
#endif
#if (defined(DIN20_PORT) && defined(DIN20_BIT))
#define DIN20 150
#define DIN20_MBED_PIN __mbedpin__(DIN20_PORT, DIN20_BIT)
#define DIN20_GPIOREG __gpioreg__(DIN20_PORT)
#if (DIN20_BIT < 16)
#define DIN20_PINHALF L
#else
#define DIN20_PINHALF H
#endif
#define DIN20_PINCON __pincon__(DIN20_PORT, DIN20_PINHALF)
#define DIO150 150
#define DIO150_MBED_PIN DIN20_MBED_PIN
#define DIO150_PORT DIN20_PORT
#define DIO150_BIT DIN20_BIT
#define DIO150_GPIOREG DIN20_GPIOREG
#define DIO150_PINHALF DIN20_PINHALF
#define DIO150_PINCON DIN20_PINCON
#endif
#if (defined(DIN21_PORT) && defined(DIN21_BIT))
#define DIN21 151
#define DIN21_MBED_PIN __mbedpin__(DIN21_PORT, DIN21_BIT)
#define DIN21_GPIOREG __gpioreg__(DIN21_PORT)
#if (DIN21_BIT < 16)
#define DIN21_PINHALF L
#else
#define DIN21_PINHALF H
#endif
#define DIN21_PINCON __pincon__(DIN21_PORT, DIN21_PINHALF)
#define DIO151 151
#define DIO151_MBED_PIN DIN21_MBED_PIN
#define DIO151_PORT DIN21_PORT
#define DIO151_BIT DIN21_BIT
#define DIO151_GPIOREG DIN21_GPIOREG
#define DIO151_PINHALF DIN21_PINHALF
#define DIO151_PINCON DIN21_PINCON
#endif
#if (defined(DIN22_PORT) && defined(DIN22_BIT))
#define DIN22 152
#define DIN22_MBED_PIN __mbedpin__(DIN22_PORT, DIN22_BIT)
#define DIN22_GPIOREG __gpioreg__(DIN22_PORT)
#if (DIN22_BIT < 16)
#define DIN22_PINHALF L
#else
#define DIN22_PINHALF H
#endif
#define DIN22_PINCON __pincon__(DIN22_PORT, DIN22_PINHALF)
#define DIO152 152
#define DIO152_MBED_PIN DIN22_MBED_PIN
#define DIO152_PORT DIN22_PORT
#define DIO152_BIT DIN22_BIT
#define DIO152_GPIOREG DIN22_GPIOREG
#define DIO152_PINHALF DIN22_PINHALF
#define DIO152_PINCON DIN22_PINCON
#endif
#if (defined(DIN23_PORT) && defined(DIN23_BIT))
#define DIN23 153
#define DIN23_MBED_PIN __mbedpin__(DIN23_PORT, DIN23_BIT)
#define DIN23_GPIOREG __gpioreg__(DIN23_PORT)
#if (DIN23_BIT < 16)
#define DIN23_PINHALF L
#else
#define DIN23_PINHALF H
#endif
#define DIN23_PINCON __pincon__(DIN23_PORT, DIN23_PINHALF)
#define DIO153 153
#define DIO153_MBED_PIN DIN23_MBED_PIN
#define DIO153_PORT DIN23_PORT
#define DIO153_BIT DIN23_BIT
#define DIO153_GPIOREG DIN23_GPIOREG
#define DIO153_PINHALF DIN23_PINHALF
#define DIO153_PINCON DIN23_PINCON
#endif
#if (defined(DIN24_PORT) && defined(DIN24_BIT))
#define DIN24 154
#define DIN24_MBED_PIN __mbedpin__(DIN24_PORT, DIN24_BIT)
#define DIN24_GPIOREG __gpioreg__(DIN24_PORT)
#if (DIN24_BIT < 16)
#define DIN24_PINHALF L
#else
#define DIN24_PINHALF H
#endif
#define DIN24_PINCON __pincon__(DIN24_PORT, DIN24_PINHALF)
#define DIO154 154
#define DIO154_MBED_PIN DIN24_MBED_PIN
#define DIO154_PORT DIN24_PORT
#define DIO154_BIT DIN24_BIT
#define DIO154_GPIOREG DIN24_GPIOREG
#define DIO154_PINHALF DIN24_PINHALF
#define DIO154_PINCON DIN24_PINCON
#endif
#if (defined(DIN25_PORT) && defined(DIN25_BIT))
#define DIN25 155
#define DIN25_MBED_PIN __mbedpin__(DIN25_PORT, DIN25_BIT)
#define DIN25_GPIOREG __gpioreg__(DIN25_PORT)
#if (DIN25_BIT < 16)
#define DIN25_PINHALF L
#else
#define DIN25_PINHALF H
#endif
#define DIN25_PINCON __pincon__(DIN25_PORT, DIN25_PINHALF)
#define DIO155 155
#define DIO155_MBED_PIN DIN25_MBED_PIN
#define DIO155_PORT DIN25_PORT
#define DIO155_BIT DIN25_BIT
#define DIO155_GPIOREG DIN25_GPIOREG
#define DIO155_PINHALF DIN25_PINHALF
#define DIO155_PINCON DIN25_PINCON
#endif
#if (defined(DIN26_PORT) && defined(DIN26_BIT))
#define DIN26 156
#define DIN26_MBED_PIN __mbedpin__(DIN26_PORT, DIN26_BIT)
#define DIN26_GPIOREG __gpioreg__(DIN26_PORT)
#if (DIN26_BIT < 16)
#define DIN26_PINHALF L
#else
#define DIN26_PINHALF H
#endif
#define DIN26_PINCON __pincon__(DIN26_PORT, DIN26_PINHALF)
#define DIO156 156
#define DIO156_MBED_PIN DIN26_MBED_PIN
#define DIO156_PORT DIN26_PORT
#define DIO156_BIT DIN26_BIT
#define DIO156_GPIOREG DIN26_GPIOREG
#define DIO156_PINHALF DIN26_PINHALF
#define DIO156_PINCON DIN26_PINCON
#endif
#if (defined(DIN27_PORT) && defined(DIN27_BIT))
#define DIN27 157
#define DIN27_MBED_PIN __mbedpin__(DIN27_PORT, DIN27_BIT)
#define DIN27_GPIOREG __gpioreg__(DIN27_PORT)
#if (DIN27_BIT < 16)
#define DIN27_PINHALF L
#else
#define DIN27_PINHALF H
#endif
#define DIN27_PINCON __pincon__(DIN27_PORT, DIN27_PINHALF)
#define DIO157 157
#define DIO157_MBED_PIN DIN27_MBED_PIN
#define DIO157_PORT DIN27_PORT
#define DIO157_BIT DIN27_BIT
#define DIO157_GPIOREG DIN27_GPIOREG
#define DIO157_PINHALF DIN27_PINHALF
#define DIO157_PINCON DIN27_PINCON
#endif
#if (defined(DIN28_PORT) && defined(DIN28_BIT))
#define DIN28 158
#define DIN28_MBED_PIN __mbedpin__(DIN28_PORT, DIN28_BIT)
#define DIN28_GPIOREG __gpioreg__(DIN28_PORT)
#if (DIN28_BIT < 16)
#define DIN28_PINHALF L
#else
#define DIN28_PINHALF H
#endif
#define DIN28_PINCON __pincon__(DIN28_PORT, DIN28_PINHALF)
#define DIO158 158
#define DIO158_MBED_PIN DIN28_MBED_PIN
#define DIO158_PORT DIN28_PORT
#define DIO158_BIT DIN28_BIT
#define DIO158_GPIOREG DIN28_GPIOREG
#define DIO158_PINHALF DIN28_PINHALF
#define DIO158_PINCON DIN28_PINCON
#endif
#if (defined(DIN29_PORT) && defined(DIN29_BIT))
#define DIN29 159
#define DIN29_MBED_PIN __mbedpin__(DIN29_PORT, DIN29_BIT)
#define DIN29_GPIOREG __gpioreg__(DIN29_PORT)
#if (DIN29_BIT < 16)
#define DIN29_PINHALF L
#else
#define DIN29_PINHALF H
#endif
#define DIN29_PINCON __pincon__(DIN29_PORT, DIN29_PINHALF)
#define DIO159 159
#define DIO159_MBED_PIN DIN29_MBED_PIN
#define DIO159_PORT DIN29_PORT
#define DIO159_BIT DIN29_BIT
#define DIO159_GPIOREG DIN29_GPIOREG
#define DIO159_PINHALF DIN29_PINHALF
#define DIO159_PINCON DIN29_PINCON
#endif
#if (defined(DIN30_PORT) && defined(DIN30_BIT))
#define DIN30 160
#define DIN30_MBED_PIN __mbedpin__(DIN30_PORT, DIN30_BIT)
#define DIN30_GPIOREG __gpioreg__(DIN30_PORT)
#if (DIN30_BIT < 16)
#define DIN30_PINHALF L
#else
#define DIN30_PINHALF H
#endif
#define DIN30_PINCON __pincon__(DIN30_PORT, DIN30_PINHALF)
#define DIO160 160
#define DIO160_MBED_PIN DIN30_MBED_PIN
#define DIO160_PORT DIN30_PORT
#define DIO160_BIT DIN30_BIT
#define DIO160_GPIOREG DIN30_GPIOREG
#define DIO160_PINHALF DIN30_PINHALF
#define DIO160_PINCON DIN30_PINCON
#endif
#if (defined(DIN31_PORT) && defined(DIN31_BIT))
#define DIN31 161
#define DIN31_MBED_PIN __mbedpin__(DIN31_PORT, DIN31_BIT)
#define DIN31_GPIOREG __gpioreg__(DIN31_PORT)
#if (DIN31_BIT < 16)
#define DIN31_PINHALF L
#else
#define DIN31_PINHALF H
#endif
#define DIN31_PINCON __pincon__(DIN31_PORT, DIN31_PINHALF)
#define DIO161 161
#define DIO161_MBED_PIN DIN31_MBED_PIN
#define DIO161_PORT DIN31_PORT
#define DIO161_BIT DIN31_BIT
#define DIO161_GPIOREG DIN31_GPIOREG
#define DIO161_PINHALF DIN31_PINHALF
#define DIO161_PINCON DIN31_PINCON
#endif
#if (defined(DIN32_PORT) && defined(DIN32_BIT))
#define DIN32 162
#define DIN32_MBED_PIN __mbedpin__(DIN32_PORT, DIN32_BIT)
#define DIN32_GPIOREG __gpioreg__(DIN32_PORT)
#if (DIN32_BIT < 16)
#define DIN32_PINHALF L
#else
#define DIN32_PINHALF H
#endif
#define DIN32_PINCON __pincon__(DIN32_PORT, DIN32_PINHALF)
#define DIO162 162
#define DIO162_MBED_PIN DIN32_MBED_PIN
#define DIO162_PORT DIN32_PORT
#define DIO162_BIT DIN32_BIT
#define DIO162_GPIOREG DIN32_GPIOREG
#define DIO162_PINHALF DIN32_PINHALF
#define DIO162_PINCON DIN32_PINCON
#endif
#if (defined(DIN33_PORT) && defined(DIN33_BIT))
#define DIN33 163
#define DIN33_MBED_PIN __mbedpin__(DIN33_PORT, DIN33_BIT)
#define DIN33_GPIOREG __gpioreg__(DIN33_PORT)
#if (DIN33_BIT < 16)
#define DIN33_PINHALF L
#else
#define DIN33_PINHALF H
#endif
#define DIN33_PINCON __pincon__(DIN33_PORT, DIN33_PINHALF)
#define DIO163 163
#define DIO163_MBED_PIN DIN33_MBED_PIN
#define DIO163_PORT DIN33_PORT
#define DIO163_BIT DIN33_BIT
#define DIO163_GPIOREG DIN33_GPIOREG
#define DIO163_PINHALF DIN33_PINHALF
#define DIO163_PINCON DIN33_PINCON
#endif
#if (defined(DIN34_PORT) && defined(DIN34_BIT))
#define DIN34 164
#define DIN34_MBED_PIN __mbedpin__(DIN34_PORT, DIN34_BIT)
#define DIN34_GPIOREG __gpioreg__(DIN34_PORT)
#if (DIN34_BIT < 16)
#define DIN34_PINHALF L
#else
#define DIN34_PINHALF H
#endif
#define DIN34_PINCON __pincon__(DIN34_PORT, DIN34_PINHALF)
#define DIO164 164
#define DIO164_MBED_PIN DIN34_MBED_PIN
#define DIO164_PORT DIN34_PORT
#define DIO164_BIT DIN34_BIT
#define DIO164_GPIOREG DIN34_GPIOREG
#define DIO164_PINHALF DIN34_PINHALF
#define DIO164_PINCON DIN34_PINCON
#endif
#if (defined(DIN35_PORT) && defined(DIN35_BIT))
#define DIN35 165
#define DIN35_MBED_PIN __mbedpin__(DIN35_PORT, DIN35_BIT)
#define DIN35_GPIOREG __gpioreg__(DIN35_PORT)
#if (DIN35_BIT < 16)
#define DIN35_PINHALF L
#else
#define DIN35_PINHALF H
#endif
#define DIN35_PINCON __pincon__(DIN35_PORT, DIN35_PINHALF)
#define DIO165 165
#define DIO165_MBED_PIN DIN35_MBED_PIN
#define DIO165_PORT DIN35_PORT
#define DIO165_BIT DIN35_BIT
#define DIO165_GPIOREG DIN35_GPIOREG
#define DIO165_PINHALF DIN35_PINHALF
#define DIO165_PINCON DIN35_PINCON
#endif
#if (defined(DIN36_PORT) && defined(DIN36_BIT))
#define DIN36 166
#define DIN36_MBED_PIN __mbedpin__(DIN36_PORT, DIN36_BIT)
#define DIN36_GPIOREG __gpioreg__(DIN36_PORT)
#if (DIN36_BIT < 16)
#define DIN36_PINHALF L
#else
#define DIN36_PINHALF H
#endif
#define DIN36_PINCON __pincon__(DIN36_PORT, DIN36_PINHALF)
#define DIO166 166
#define DIO166_MBED_PIN DIN36_MBED_PIN
#define DIO166_PORT DIN36_PORT
#define DIO166_BIT DIN36_BIT
#define DIO166_GPIOREG DIN36_GPIOREG
#define DIO166_PINHALF DIN36_PINHALF
#define DIO166_PINCON DIN36_PINCON
#endif
#if (defined(DIN37_PORT) && defined(DIN37_BIT))
#define DIN37 167
#define DIN37_MBED_PIN __mbedpin__(DIN37_PORT, DIN37_BIT)
#define DIN37_GPIOREG __gpioreg__(DIN37_PORT)
#if (DIN37_BIT < 16)
#define DIN37_PINHALF L
#else
#define DIN37_PINHALF H
#endif
#define DIN37_PINCON __pincon__(DIN37_PORT, DIN37_PINHALF)
#define DIO167 167
#define DIO167_MBED_PIN DIN37_MBED_PIN
#define DIO167_PORT DIN37_PORT
#define DIO167_BIT DIN37_BIT
#define DIO167_GPIOREG DIN37_GPIOREG
#define DIO167_PINHALF DIN37_PINHALF
#define DIO167_PINCON DIN37_PINCON
#endif
#if (defined(DIN38_PORT) && defined(DIN38_BIT))
#define DIN38 168
#define DIN38_MBED_PIN __mbedpin__(DIN38_PORT, DIN38_BIT)
#define DIN38_GPIOREG __gpioreg__(DIN38_PORT)
#if (DIN38_BIT < 16)
#define DIN38_PINHALF L
#else
#define DIN38_PINHALF H
#endif
#define DIN38_PINCON __pincon__(DIN38_PORT, DIN38_PINHALF)
#define DIO168 168
#define DIO168_MBED_PIN DIN38_MBED_PIN
#define DIO168_PORT DIN38_PORT
#define DIO168_BIT DIN38_BIT
#define DIO168_GPIOREG DIN38_GPIOREG
#define DIO168_PINHALF DIN38_PINHALF
#define DIO168_PINCON DIN38_PINCON
#endif
#if (defined(DIN39_PORT) && defined(DIN39_BIT))
#define DIN39 169
#define DIN39_MBED_PIN __mbedpin__(DIN39_PORT, DIN39_BIT)
#define DIN39_GPIOREG __gpioreg__(DIN39_PORT)
#if (DIN39_BIT < 16)
#define DIN39_PINHALF L
#else
#define DIN39_PINHALF H
#endif
#define DIN39_PINCON __pincon__(DIN39_PORT, DIN39_PINHALF)
#define DIO169 169
#define DIO169_MBED_PIN DIN39_MBED_PIN
#define DIO169_PORT DIN39_PORT
#define DIO169_BIT DIN39_BIT
#define DIO169_GPIOREG DIN39_GPIOREG
#define DIO169_PINHALF DIN39_PINHALF
#define DIO169_PINCON DIN39_PINCON
#endif
#if (defined(DIN40_PORT) && defined(DIN40_BIT))
#define DIN40 170
#define DIN40_MBED_PIN __mbedpin__(DIN40_PORT, DIN40_BIT)
#define DIN40_GPIOREG __gpioreg__(DIN40_PORT)
#if (DIN40_BIT < 16)
#define DIN40_PINHALF L
#else
#define DIN40_PINHALF H
#endif
#define DIN40_PINCON __pincon__(DIN40_PORT, DIN40_PINHALF)
#define DIO170 170
#define DIO170_MBED_PIN DIN40_MBED_PIN
#define DIO170_PORT DIN40_PORT
#define DIO170_BIT DIN40_BIT
#define DIO170_GPIOREG DIN40_GPIOREG
#define DIO170_PINHALF DIN40_PINHALF
#define DIO170_PINCON DIN40_PINCON
#endif
#if (defined(DIN41_PORT) && defined(DIN41_BIT))
#define DIN41 171
#define DIN41_MBED_PIN __mbedpin__(DIN41_PORT, DIN41_BIT)
#define DIN41_GPIOREG __gpioreg__(DIN41_PORT)
#if (DIN41_BIT < 16)
#define DIN41_PINHALF L
#else
#define DIN41_PINHALF H
#endif
#define DIN41_PINCON __pincon__(DIN41_PORT, DIN41_PINHALF)
#define DIO171 171
#define DIO171_MBED_PIN DIN41_MBED_PIN
#define DIO171_PORT DIN41_PORT
#define DIO171_BIT DIN41_BIT
#define DIO171_GPIOREG DIN41_GPIOREG
#define DIO171_PINHALF DIN41_PINHALF
#define DIO171_PINCON DIN41_PINCON
#endif
#if (defined(DIN42_PORT) && defined(DIN42_BIT))
#define DIN42 172
#define DIN42_MBED_PIN __mbedpin__(DIN42_PORT, DIN42_BIT)
#define DIN42_GPIOREG __gpioreg__(DIN42_PORT)
#if (DIN42_BIT < 16)
#define DIN42_PINHALF L
#else
#define DIN42_PINHALF H
#endif
#define DIN42_PINCON __pincon__(DIN42_PORT, DIN42_PINHALF)
#define DIO172 172
#define DIO172_MBED_PIN DIN42_MBED_PIN
#define DIO172_PORT DIN42_PORT
#define DIO172_BIT DIN42_BIT
#define DIO172_GPIOREG DIN42_GPIOREG
#define DIO172_PINHALF DIN42_PINHALF
#define DIO172_PINCON DIN42_PINCON
#endif
#if (defined(DIN43_PORT) && defined(DIN43_BIT))
#define DIN43 173
#define DIN43_MBED_PIN __mbedpin__(DIN43_PORT, DIN43_BIT)
#define DIN43_GPIOREG __gpioreg__(DIN43_PORT)
#if (DIN43_BIT < 16)
#define DIN43_PINHALF L
#else
#define DIN43_PINHALF H
#endif
#define DIN43_PINCON __pincon__(DIN43_PORT, DIN43_PINHALF)
#define DIO173 173
#define DIO173_MBED_PIN DIN43_MBED_PIN
#define DIO173_PORT DIN43_PORT
#define DIO173_BIT DIN43_BIT
#define DIO173_GPIOREG DIN43_GPIOREG
#define DIO173_PINHALF DIN43_PINHALF
#define DIO173_PINCON DIN43_PINCON
#endif
#if (defined(DIN44_PORT) && defined(DIN44_BIT))
#define DIN44 174
#define DIN44_MBED_PIN __mbedpin__(DIN44_PORT, DIN44_BIT)
#define DIN44_GPIOREG __gpioreg__(DIN44_PORT)
#if (DIN44_BIT < 16)
#define DIN44_PINHALF L
#else
#define DIN44_PINHALF H
#endif
#define DIN44_PINCON __pincon__(DIN44_PORT, DIN44_PINHALF)
#define DIO174 174
#define DIO174_MBED_PIN DIN44_MBED_PIN
#define DIO174_PORT DIN44_PORT
#define DIO174_BIT DIN44_BIT
#define DIO174_GPIOREG DIN44_GPIOREG
#define DIO174_PINHALF DIN44_PINHALF
#define DIO174_PINCON DIN44_PINCON
#endif
#if (defined(DIN45_PORT) && defined(DIN45_BIT))
#define DIN45 175
#define DIN45_MBED_PIN __mbedpin__(DIN45_PORT, DIN45_BIT)
#define DIN45_GPIOREG __gpioreg__(DIN45_PORT)
#if (DIN45_BIT < 16)
#define DIN45_PINHALF L
#else
#define DIN45_PINHALF H
#endif
#define DIN45_PINCON __pincon__(DIN45_PORT, DIN45_PINHALF)
#define DIO175 175
#define DIO175_MBED_PIN DIN45_MBED_PIN
#define DIO175_PORT DIN45_PORT
#define DIO175_BIT DIN45_BIT
#define DIO175_GPIOREG DIN45_GPIOREG
#define DIO175_PINHALF DIN45_PINHALF
#define DIO175_PINCON DIN45_PINCON
#endif
#if (defined(DIN46_PORT) && defined(DIN46_BIT))
#define DIN46 176
#define DIN46_MBED_PIN __mbedpin__(DIN46_PORT, DIN46_BIT)
#define DIN46_GPIOREG __gpioreg__(DIN46_PORT)
#if (DIN46_BIT < 16)
#define DIN46_PINHALF L
#else
#define DIN46_PINHALF H
#endif
#define DIN46_PINCON __pincon__(DIN46_PORT, DIN46_PINHALF)
#define DIO176 176
#define DIO176_MBED_PIN DIN46_MBED_PIN
#define DIO176_PORT DIN46_PORT
#define DIO176_BIT DIN46_BIT
#define DIO176_GPIOREG DIN46_GPIOREG
#define DIO176_PINHALF DIN46_PINHALF
#define DIO176_PINCON DIN46_PINCON
#endif
#if (defined(DIN47_PORT) && defined(DIN47_BIT))
#define DIN47 177
#define DIN47_MBED_PIN __mbedpin__(DIN47_PORT, DIN47_BIT)
#define DIN47_GPIOREG __gpioreg__(DIN47_PORT)
#if (DIN47_BIT < 16)
#define DIN47_PINHALF L
#else
#define DIN47_PINHALF H
#endif
#define DIN47_PINCON __pincon__(DIN47_PORT, DIN47_PINHALF)
#define DIO177 177
#define DIO177_MBED_PIN DIN47_MBED_PIN
#define DIO177_PORT DIN47_PORT
#define DIO177_BIT DIN47_BIT
