Paciente8159/uCNC/uCNC/src/hal/mcus/lpc176x/mcumap_lpc176x.h
#define DIO177_GPIOREG DIN47_GPIOREG
#define DIO177_PINHALF DIN47_PINHALF
#define DIO177_PINCON DIN47_PINCON
#endif
#if (defined(DIN48_PORT) && defined(DIN48_BIT))
#define DIN48 178
#define DIN48_MBED_PIN __mbedpin__(DIN48_PORT, DIN48_BIT)
#define DIN48_GPIOREG __gpioreg__(DIN48_PORT)
#if (DIN48_BIT < 16)
#define DIN48_PINHALF L
#else
#define DIN48_PINHALF H
#endif
#define DIN48_PINCON __pincon__(DIN48_PORT, DIN48_PINHALF)
#define DIO178 178
#define DIO178_MBED_PIN DIN48_MBED_PIN
#define DIO178_PORT DIN48_PORT
#define DIO178_BIT DIN48_BIT
#define DIO178_GPIOREG DIN48_GPIOREG
#define DIO178_PINHALF DIN48_PINHALF
#define DIO178_PINCON DIN48_PINCON
#endif
#if (defined(DIN49_PORT) && defined(DIN49_BIT))
#define DIN49 179
#define DIN49_MBED_PIN __mbedpin__(DIN49_PORT, DIN49_BIT)
#define DIN49_GPIOREG __gpioreg__(DIN49_PORT)
#if (DIN49_BIT < 16)
#define DIN49_PINHALF L
#else
#define DIN49_PINHALF H
#endif
#define DIN49_PINCON __pincon__(DIN49_PORT, DIN49_PINHALF)
#define DIO179 179
#define DIO179_MBED_PIN DIN49_MBED_PIN
#define DIO179_PORT DIN49_PORT
#define DIO179_BIT DIN49_BIT
#define DIO179_GPIOREG DIN49_GPIOREG
#define DIO179_PINHALF DIN49_PINHALF
#define DIO179_PINCON DIN49_PINCON
#endif
#if (defined(TX_PORT) && defined(TX_BIT))
#define TX 200
#define TX_MBED_PIN __mbedpin__(TX_PORT, TX_BIT)
#define TX_GPIOREG __gpioreg__(TX_PORT)
#if (TX_BIT < 16)
#define TX_PINHALF L
#else
#define TX_PINHALF H
#endif
#define TX_PINCON __pincon__(TX_PORT, TX_PINHALF)
#define DIO200 200
#define DIO200_MBED_PIN TX_MBED_PIN
#define DIO200_PORT TX_PORT
#define DIO200_BIT TX_BIT
#define DIO200_GPIOREG TX_GPIOREG
#define DIO200_PINHALF TX_PINHALF
#define DIO200_PINCON TX_PINCON
#endif
#if (defined(RX_PORT) && defined(RX_BIT))
#define RX 201
#define RX_MBED_PIN __mbedpin__(RX_PORT, RX_BIT)
#define RX_GPIOREG __gpioreg__(RX_PORT)
#if (RX_BIT < 16)
#define RX_PINHALF L
#else
#define RX_PINHALF H
#endif
#define RX_PINCON __pincon__(RX_PORT, RX_PINHALF)
#define DIO201 201
#define DIO201_MBED_PIN RX_MBED_PIN
#define DIO201_PORT RX_PORT
#define DIO201_BIT RX_BIT
#define DIO201_GPIOREG RX_GPIOREG
#define DIO201_PINHALF RX_PINHALF
#define DIO201_PINCON RX_PINCON
#endif
#if (defined(USB_DM_PORT) && defined(USB_DM_BIT))
#define USB_DM 202
#define USB_DM_MBED_PIN __mbedpin__(USB_DM_PORT, USB_DM_BIT)
#define USB_DM_GPIOREG __gpioreg__(USB_DM_PORT)
#if (USB_DM_BIT < 16)
#define USB_DM_PINHALF L
#else
#define USB_DM_PINHALF H
#endif
#define USB_DM_PINCON __pincon__(USB_DM_PORT, USB_DM_PINHALF)
#define DIO202 202
#define DIO202_MBED_PIN USB_DM_MBED_PIN
#define DIO202_PORT USB_DM_PORT
#define DIO202_BIT USB_DM_BIT
#define DIO202_GPIOREG USB_DM_GPIOREG
#define DIO202_PINHALF USB_DM_PINHALF
#define DIO202_PINCON USB_DM_PINCON
#endif
#if (defined(USB_DP_PORT) && defined(USB_DP_BIT))
#define USB_DP 203
#define USB_DP_MBED_PIN __mbedpin__(USB_DP_PORT, USB_DP_BIT)
#define USB_DP_GPIOREG __gpioreg__(USB_DP_PORT)
#if (USB_DP_BIT < 16)
#define USB_DP_PINHALF L
#else
#define USB_DP_PINHALF H
#endif
#define USB_DP_PINCON __pincon__(USB_DP_PORT, USB_DP_PINHALF)
#define DIO203 203
#define DIO203_MBED_PIN USB_DP_MBED_PIN
#define DIO203_PORT USB_DP_PORT
#define DIO203_BIT USB_DP_BIT
#define DIO203_GPIOREG USB_DP_GPIOREG
#define DIO203_PINHALF USB_DP_PINHALF
#define DIO203_PINCON USB_DP_PINCON
#endif
#if (defined(SPI_CLK_PORT) && defined(SPI_CLK_BIT))
#define SPI_CLK 204
#define SPI_CLK_MBED_PIN __mbedpin__(SPI_CLK_PORT, SPI_CLK_BIT)
#define SPI_CLK_GPIOREG __gpioreg__(SPI_CLK_PORT)
#if (SPI_CLK_BIT < 16)
#define SPI_CLK_PINHALF L
#else
#define SPI_CLK_PINHALF H
#endif
#define SPI_CLK_PINCON __pincon__(SPI_CLK_PORT, SPI_CLK_PINHALF)
#define DIO204 204
#define DIO204_MBED_PIN SPI_CLK_MBED_PIN
#define DIO204_PORT SPI_CLK_PORT
#define DIO204_BIT SPI_CLK_BIT
#define DIO204_GPIOREG SPI_CLK_GPIOREG
#define DIO204_PINHALF SPI_CLK_PINHALF
#define DIO204_PINCON SPI_CLK_PINCON
#endif
#if (defined(SPI_SDI_PORT) && defined(SPI_SDI_BIT))
#define SPI_SDI 205
#define SPI_SDI_MBED_PIN __mbedpin__(SPI_SDI_PORT, SPI_SDI_BIT)
#define SPI_SDI_GPIOREG __gpioreg__(SPI_SDI_PORT)
#if (SPI_SDI_BIT < 16)
#define SPI_SDI_PINHALF L
#else
#define SPI_SDI_PINHALF H
#endif
#define SPI_SDI_PINCON __pincon__(SPI_SDI_PORT, SPI_SDI_PINHALF)
#define DIO205 205
#define DIO205_MBED_PIN SPI_SDI_MBED_PIN
#define DIO205_PORT SPI_SDI_PORT
#define DIO205_BIT SPI_SDI_BIT
#define DIO205_GPIOREG SPI_SDI_GPIOREG
#define DIO205_PINHALF SPI_SDI_PINHALF
#define DIO205_PINCON SPI_SDI_PINCON
#endif
#if (defined(SPI_SDO_PORT) && defined(SPI_SDO_BIT))
#define SPI_SDO 206
#define SPI_SDO_MBED_PIN __mbedpin__(SPI_SDO_PORT, SPI_SDO_BIT)
#define SPI_SDO_GPIOREG __gpioreg__(SPI_SDO_PORT)
#if (SPI_SDO_BIT < 16)
#define SPI_SDO_PINHALF L
#else
#define SPI_SDO_PINHALF H
#endif
#define SPI_SDO_PINCON __pincon__(SPI_SDO_PORT, SPI_SDO_PINHALF)
#define DIO206 206
#define DIO206_MBED_PIN SPI_SDO_MBED_PIN
#define DIO206_PORT SPI_SDO_PORT
#define DIO206_BIT SPI_SDO_BIT
#define DIO206_GPIOREG SPI_SDO_GPIOREG
#define DIO206_PINHALF SPI_SDO_PINHALF
#define DIO206_PINCON SPI_SDO_PINCON
#endif
#if (defined(SPI_CS_PORT) && defined(SPI_CS_BIT))
#define SPI_CS 207
#define SPI_CS_MBED_PIN __mbedpin__(SPI_CS_PORT, SPI_CS_BIT)
#define SPI_CS_GPIOREG __gpioreg__(SPI_CS_PORT)
#if (SPI_CS_BIT < 16)
#define SPI_CS_PINHALF L
#else
#define SPI_CS_PINHALF H
#endif
#define SPI_CS_PINCON __pincon__(SPI_CS_PORT, SPI_CS_PINHALF)
#define DIO207 207
#define DIO207_MBED_PIN SPI_CS_MBED_PIN
#define DIO207_PORT SPI_CS_PORT
#define DIO207_BIT SPI_CS_BIT
#define DIO207_GPIOREG SPI_CS_GPIOREG
#define DIO207_PINHALF SPI_CS_PINHALF
#define DIO207_PINCON SPI_CS_PINCON
#endif
#if (defined(I2C_CLK_PORT) && defined(I2C_CLK_BIT))
#define I2C_CLK 208
#define I2C_CLK_MBED_PIN __mbedpin__(I2C_CLK_PORT, I2C_CLK_BIT)
#define I2C_CLK_GPIOREG __gpioreg__(I2C_CLK_PORT)
#if (I2C_CLK_BIT < 16)
#define I2C_CLK_PINHALF L
#else
#define I2C_CLK_PINHALF H
#endif
#define I2C_CLK_PINCON __pincon__(I2C_CLK_PORT, I2C_CLK_PINHALF)
#define DIO208 208
#define DIO208_MBED_PIN I2C_CLK_MBED_PIN
#define DIO208_PORT I2C_CLK_PORT
#define DIO208_BIT I2C_CLK_BIT
#define DIO208_GPIOREG I2C_CLK_GPIOREG
#define DIO208_PINHALF I2C_CLK_PINHALF
#define DIO208_PINCON I2C_CLK_PINCON
#endif
#if (defined(I2C_DATA_PORT) && defined(I2C_DATA_BIT))
#define I2C_DATA 209
#define I2C_DATA_MBED_PIN __mbedpin__(I2C_DATA_PORT, I2C_DATA_BIT)
#define I2C_DATA_GPIOREG __gpioreg__(I2C_DATA_PORT)
#if (I2C_DATA_BIT < 16)
#define I2C_DATA_PINHALF L
#else
#define I2C_DATA_PINHALF H
#endif
#define I2C_DATA_PINCON __pincon__(I2C_DATA_PORT, I2C_DATA_PINHALF)
#define DIO209 209
#define DIO209_MBED_PIN I2C_DATA_MBED_PIN
#define DIO209_PORT I2C_DATA_PORT
#define DIO209_BIT I2C_DATA_BIT
#define DIO209_GPIOREG I2C_DATA_GPIOREG
#define DIO209_PINHALF I2C_DATA_PINHALF
#define DIO209_PINCON I2C_DATA_PINCON
#endif
#if (defined(TX2_PORT) && defined(TX2_BIT))
#define TX2 210
#define TX2_MBED_PIN __mbedpin__(TX2_PORT, TX2_BIT)
#define TX2_GPIOREG __gpioreg__(TX2_PORT)
#if (TX2_BIT < 16)
#define TX2_PINHALF L
#else
#define TX2_PINHALF H
#endif
#define TX2_PINCON __pincon__(TX2_PORT, TX2_PINHALF)
#define DIO210 210
#define DIO210_MBED_PIN TX2_MBED_PIN
#define DIO210_PORT TX2_PORT
#define DIO210_BIT TX2_BIT
#define DIO210_GPIOREG TX2_GPIOREG
#define DIO210_PINHALF TX2_PINHALF
#define DIO210_PINCON TX2_PINCON
#endif
#if (defined(RX2_PORT) && defined(RX2_BIT))
#define RX2 211
#define RX2_MBED_PIN __mbedpin__(RX2_PORT, RX2_BIT)
#define RX2_GPIOREG __gpioreg__(RX2_PORT)
#if (RX2_BIT < 16)
#define RX2_PINHALF L
#else
#define RX2_PINHALF H
#endif
#define RX2_PINCON __pincon__(RX2_PORT, RX2_PINHALF)
#define DIO211 211
#define DIO211_MBED_PIN RX2_MBED_PIN
#define DIO211_PORT RX2_PORT
#define DIO211_BIT RX2_BIT
#define DIO211_GPIOREG RX2_GPIOREG
#define DIO211_PINHALF RX2_PINHALF
#define DIO211_PINCON RX2_PINCON
#endif
#if (defined(SPI2_CLK_PORT) && defined(SPI2_CLK_BIT))
#define SPI2_CLK 212
#define SPI2_CLK_MBED_PIN __mbedpin__(SPI2_CLK_PORT, SPI2_CLK_BIT)
#define SPI2_CLK_GPIOREG __gpioreg__(SPI2_CLK_PORT)
#if (SPI2_CLK_BIT < 16)
#define SPI2_CLK_PINHALF L
#else
#define SPI2_CLK_PINHALF H
#endif
#define SPI2_CLK_PINCON __pincon__(SPI2_CLK_PORT, SPI2_CLK_PINHALF)
#define DIO212 212
#define DIO212_MBED_PIN SPI2_CLK_MBED_PIN
#define DIO212_PORT SPI2_CLK_PORT
#define DIO212_BIT SPI2_CLK_BIT
#define DIO212_GPIOREG SPI2_CLK_GPIOREG
#define DIO212_PINHALF SPI2_CLK_PINHALF
#define DIO212_PINCON SPI2_CLK_PINCON
#endif
#if (defined(SPI2_SDI_PORT) && defined(SPI2_SDI_BIT))
#define SPI2_SDI 213
#define SPI2_SDI_MBED_PIN __mbedpin__(SPI2_SDI_PORT, SPI2_SDI_BIT)
#define SPI2_SDI_GPIOREG __gpioreg__(SPI2_SDI_PORT)
#if (SPI2_SDI_BIT < 16)
#define SPI2_SDI_PINHALF L
#else
#define SPI2_SDI_PINHALF H
#endif
#define SPI2_SDI_PINCON __pincon__(SPI2_SDI_PORT, SPI2_SDI_PINHALF)
#define DIO213 213
#define DIO213_MBED_PIN SPI2_SDI_MBED_PIN
#define DIO213_PORT SPI2_SDI_PORT
#define DIO213_BIT SPI2_SDI_BIT
#define DIO213_GPIOREG SPI2_SDI_GPIOREG
#define DIO213_PINHALF SPI2_SDI_PINHALF
#define DIO213_PINCON SPI2_SDI_PINCON
#endif
#if (defined(SPI2_SDO_PORT) && defined(SPI2_SDO_BIT))
#define SPI2_SDO 214
#define SPI2_SDO_MBED_PIN __mbedpin__(SPI2_SDO_PORT, SPI2_SDO_BIT)
#define SPI2_SDO_GPIOREG __gpioreg__(SPI2_SDO_PORT)
#if (SPI2_SDO_BIT < 16)
#define SPI2_SDO_PINHALF L
#else
#define SPI2_SDO_PINHALF H
#endif
#define SPI2_SDO_PINCON __pincon__(SPI2_SDO_PORT, SPI2_SDO_PINHALF)
#define DIO214 214
#define DIO214_MBED_PIN SPI2_SDO_MBED_PIN
#define DIO214_PORT SPI2_SDO_PORT
#define DIO214_BIT SPI2_SDO_BIT
#define DIO214_GPIOREG SPI2_SDO_GPIOREG
#define DIO214_PINHALF SPI2_SDO_PINHALF
#define DIO214_PINCON SPI2_SDO_PINCON
#endif
#if (defined(SPI2_CS_PORT) && defined(SPI2_CS_BIT))
#define SPI2_CS 215
#define SPI2_CS_MBED_PIN __mbedpin__(SPI2_CS_PORT, SPI2_CS_BIT)
#define SPI2_CS_GPIOREG __gpioreg__(SPI2_CS_PORT)
#if (SPI2_CS_BIT < 16)
#define SPI2_CS_PINHALF L
#else
#define SPI2_CS_PINHALF H
#endif
#define SPI2_CS_PINCON __pincon__(SPI2_CS_PORT, SPI2_CS_PINHALF)
#define DIO215 215
#define DIO215_MBED_PIN SPI2_CS_MBED_PIN
#define DIO215_PORT SPI2_CS_PORT
#define DIO215_BIT SPI2_CS_BIT
#define DIO215_GPIOREG SPI2_CS_GPIOREG
#define DIO215_PINHALF SPI2_CS_PINHALF
#define DIO215_PINCON SPI2_CS_PINCON
#endif

#if (defined(TX) && defined(RX))
#define MCU_HAS_UART
#endif
#if (defined(TX2) && defined(RX2))
#define MCU_HAS_UART2
#endif
#if (defined(USB_DP) && defined(USB_DM))
#define MCU_HAS_USB
#endif

/**********************************************
 *	ISR on change inputs
 **********************************************/
// ISR on change inputs
#define __risereg__(X) (__helper__(IO, X, IntEnR))
#if (defined(LIMIT_X_ISR) && defined(LIMIT_X))
#define LIMIT_X_RISEREG (__risereg__(LIMIT_X_PORT))
#define LIMIT_X_FALLREG (__fallreg__(LIMIT_X_PORT))
#define DIO100_ISR (LIMIT_X_ISR)
#define DIO100_RISEREG LIMIT_X_RISEREG
#define DIO100_FALLREG LIMIT_X_FALLREG
#endif
#if (defined(LIMIT_Y_ISR) && defined(LIMIT_Y))
#define LIMIT_Y_RISEREG (__risereg__(LIMIT_Y_PORT))
#define LIMIT_Y_FALLREG (__fallreg__(LIMIT_Y_PORT))
#define DIO101_ISR (LIMIT_Y_ISR)
#define DIO101_RISEREG LIMIT_Y_RISEREG
#define DIO101_FALLREG LIMIT_Y_FALLREG
#endif
#if (defined(LIMIT_Z_ISR) && defined(LIMIT_Z))
#define LIMIT_Z_RISEREG (__risereg__(LIMIT_Z_PORT))
#define LIMIT_Z_FALLREG (__fallreg__(LIMIT_Z_PORT))
#define DIO102_ISR (LIMIT_Z_ISR)
#define DIO102_RISEREG LIMIT_Z_RISEREG
#define DIO102_FALLREG LIMIT_Z_FALLREG
#endif
#if (defined(LIMIT_X2_ISR) && defined(LIMIT_X2))
#define LIMIT_X2_RISEREG (__risereg__(LIMIT_X2_PORT))
#define LIMIT_X2_FALLREG (__fallreg__(LIMIT_X2_PORT))
#define DIO103_ISR (LIMIT_X2_ISR)
#define DIO103_RISEREG LIMIT_X2_RISEREG
#define DIO103_FALLREG LIMIT_X2_FALLREG
#endif
#if (defined(LIMIT_Y2_ISR) && defined(LIMIT_Y2))
#define LIMIT_Y2_RISEREG (__risereg__(LIMIT_Y2_PORT))
#define LIMIT_Y2_FALLREG (__fallreg__(LIMIT_Y2_PORT))
#define DIO104_ISR (LIMIT_Y2_ISR)
#define DIO104_RISEREG LIMIT_Y2_RISEREG
#define DIO104_FALLREG LIMIT_Y2_FALLREG
#endif
#if (defined(LIMIT_Z2_ISR) && defined(LIMIT_Z2))
#define LIMIT_Z2_RISEREG (__risereg__(LIMIT_Z2_PORT))
#define LIMIT_Z2_FALLREG (__fallreg__(LIMIT_Z2_PORT))
#define DIO105_ISR (LIMIT_Z2_ISR)
#define DIO105_RISEREG LIMIT_Z2_RISEREG
#define DIO105_FALLREG LIMIT_Z2_FALLREG
#endif
#if (defined(LIMIT_A_ISR) && defined(LIMIT_A))
#define LIMIT_A_RISEREG (__risereg__(LIMIT_A_PORT))
#define LIMIT_A_FALLREG (__fallreg__(LIMIT_A_PORT))
#define DIO106_ISR (LIMIT_A_ISR)
#define DIO106_RISEREG LIMIT_A_RISEREG
#define DIO106_FALLREG LIMIT_A_FALLREG
#endif
#if (defined(LIMIT_B_ISR) && defined(LIMIT_B))
#define LIMIT_B_RISEREG (__risereg__(LIMIT_B_PORT))
#define LIMIT_B_FALLREG (__fallreg__(LIMIT_B_PORT))
#define DIO107_ISR (LIMIT_B_ISR)
#define DIO107_RISEREG LIMIT_B_RISEREG
#define DIO107_FALLREG LIMIT_B_FALLREG
#endif
#if (defined(LIMIT_C_ISR) && defined(LIMIT_C))
#define LIMIT_C_RISEREG (__risereg__(LIMIT_C_PORT))
#define LIMIT_C_FALLREG (__fallreg__(LIMIT_C_PORT))
#define DIO108_ISR (LIMIT_C_ISR)
#define DIO108_RISEREG LIMIT_C_RISEREG
#define DIO108_FALLREG LIMIT_C_FALLREG
#endif
#if (defined(PROBE_ISR) && defined(PROBE))
#define PROBE_RISEREG (__risereg__(PROBE_PORT))
#define PROBE_FALLREG (__fallreg__(PROBE_PORT))
#define DIO109_ISR (PROBE_ISR)
#define DIO109_RISEREG PROBE_RISEREG
#define DIO109_FALLREG PROBE_FALLREG
#endif
#if (defined(ESTOP_ISR) && defined(ESTOP))
#define ESTOP_RISEREG (__risereg__(ESTOP_PORT))
#define ESTOP_FALLREG (__fallreg__(ESTOP_PORT))
#define DIO110_ISR (ESTOP_ISR)
#define DIO110_RISEREG ESTOP_RISEREG
#define DIO110_FALLREG ESTOP_FALLREG
#endif
#if (defined(SAFETY_DOOR_ISR) && defined(SAFETY_DOOR))
#define SAFETY_DOOR_RISEREG (__risereg__(SAFETY_DOOR_PORT))
#define SAFETY_DOOR_FALLREG (__fallreg__(SAFETY_DOOR_PORT))
#define DIO111_ISR (SAFETY_DOOR_ISR)
#define DIO111_RISEREG SAFETY_DOOR_RISEREG
#define DIO111_FALLREG SAFETY_DOOR_FALLREG
#endif
#if (defined(FHOLD_ISR) && defined(FHOLD))
#define FHOLD_RISEREG (__risereg__(FHOLD_PORT))
#define FHOLD_FALLREG (__fallreg__(FHOLD_PORT))
#define DIO112_ISR (FHOLD_ISR)
#define DIO112_RISEREG FHOLD_RISEREG
#define DIO112_FALLREG FHOLD_FALLREG
#endif
#if (defined(CS_RES_ISR) && defined(CS_RES))
#define CS_RES_RISEREG (__risereg__(CS_RES_PORT))
#define CS_RES_FALLREG (__fallreg__(CS_RES_PORT))
#define DIO113_ISR (CS_RES_ISR)
#define DIO113_RISEREG CS_RES_RISEREG
#define DIO113_FALLREG CS_RES_FALLREG
#endif
#if (defined(DIN0_ISR) && defined(DIN0))
#define DIN0_RISEREG (__risereg__(DIN0_PORT))
#define DIN0_FALLREG (__fallreg__(DIN0_PORT))
#define DIO130_ISR (DIN0_ISR)
#define DIO130_RISEREG DIN0_RISEREG
#define DIO130_FALLREG DIN0_FALLREG
#endif
#if (defined(DIN1_ISR) && defined(DIN1))
#define DIN1_RISEREG (__risereg__(DIN1_PORT))
#define DIN1_FALLREG (__fallreg__(DIN1_PORT))
#define DIO131_ISR (DIN1_ISR)
#define DIO131_RISEREG DIN1_RISEREG
#define DIO131_FALLREG DIN1_FALLREG
#endif
#if (defined(DIN2_ISR) && defined(DIN2))
#define DIN2_RISEREG (__risereg__(DIN2_PORT))
#define DIN2_FALLREG (__fallreg__(DIN2_PORT))
#define DIO132_ISR (DIN2_ISR)
#define DIO132_RISEREG DIN2_RISEREG
#define DIO132_FALLREG DIN2_FALLREG
#endif
#if (defined(DIN3_ISR) && defined(DIN3))
#define DIN3_RISEREG (__risereg__(DIN3_PORT))
#define DIN3_FALLREG (__fallreg__(DIN3_PORT))
#define DIO133_ISR (DIN3_ISR)
#define DIO133_RISEREG DIN3_RISEREG
#define DIO133_FALLREG DIN3_FALLREG
#endif
#if (defined(DIN4_ISR) && defined(DIN4))
#define DIN4_RISEREG (__risereg__(DIN4_PORT))
#define DIN4_FALLREG (__fallreg__(DIN4_PORT))
#define DIO134_ISR (DIN4_ISR)
#define DIO134_RISEREG DIN4_RISEREG
#define DIO134_FALLREG DIN4_FALLREG
#endif
#if (defined(DIN5_ISR) && defined(DIN5))
#define DIN5_RISEREG (__risereg__(DIN5_PORT))
#define DIN5_FALLREG (__fallreg__(DIN5_PORT))
#define DIO135_ISR (DIN5_ISR)
#define DIO135_RISEREG DIN5_RISEREG
#define DIO135_FALLREG DIN5_FALLREG
#endif
#if (defined(DIN6_ISR) && defined(DIN6))
#define DIN6_RISEREG (__risereg__(DIN6_PORT))
#define DIN6_FALLREG (__fallreg__(DIN6_PORT))
#define DIO136_ISR (DIN6_ISR)
#define DIO136_RISEREG DIN6_RISEREG
#define DIO136_FALLREG DIN6_FALLREG
#endif
#if (defined(DIN7_ISR) && defined(DIN7))
#define DIN7_RISEREG (__risereg__(DIN7_PORT))
#define DIN7_FALLREG (__fallreg__(DIN7_PORT))
#define DIO137_ISR (DIN7_ISR)
#define DIO137_RISEREG DIN7_RISEREG
#define DIO137_FALLREG DIN7_FALLREG
#endif

/**
 *
 * PWM
 *
 * */
#define __mrreg__(X) __helper__(MR, X, )

#ifdef PWM0
#define PWM0_MR __mrreg__(PWM0_CHANNEL)
#if (PWM0_PORT == 1)
#define PWM0_PINSEL 2
#define PWM0_FUNC 2
#elif (PWM0_PORT == 2)
#define PWM0_PINSEL 1
#define PWM0_FUNC 1
#else
#define PWM0_PINSEL 0
#define PWM0_FUNC 0
#endif
#define DIO25_PINSEL PWM0_PINSEL
#define DIO25_FUNC PWM0_FUNC
#define DIO25_CHANNEL PWM0_CHANNEL
#define DIO25_MR PWM0_MR
#endif
#ifdef PWM1
#define PWM1_MR __mrreg__(PWM1_CHANNEL)
#if (PWM1_PORT == 1)
#define PWM1_PINSEL 2
#define PWM1_FUNC 2
#elif (PWM1_PORT == 2)
#define PWM1_PINSEL 1
#define PWM1_FUNC 1
#else
#define PWM1_PINSEL 0
#define PWM1_FUNC 0
#endif
#define DIO26_PINSEL PWM1_PINSEL
#define DIO26_FUNC PWM1_FUNC
#define DIO26_CHANNEL PWM1_CHANNEL
#define DIO26_MR PWM1_MR
#endif
#ifdef PWM2
#define PWM2_MR __mrreg__(PWM2_CHANNEL)
#if (PWM2_PORT == 1)
#define PWM2_PINSEL 2
#define PWM2_FUNC 2
#elif (PWM2_PORT == 2)
#define PWM2_PINSEL 1
#define PWM2_FUNC 1
#else
#define PWM2_PINSEL 0
#define PWM2_FUNC 0
#endif
#define DIO27_PINSEL PWM2_PINSEL
#define DIO27_FUNC PWM2_FUNC
#define DIO27_CHANNEL PWM2_CHANNEL
#define DIO27_MR PWM2_MR
#endif
#ifdef PWM3
#define PWM3_MR __mrreg__(PWM3_CHANNEL)
#if (PWM3_PORT == 1)
#define PWM3_PINSEL 2
#define PWM3_FUNC 2
#elif (PWM3_PORT == 2)
#define PWM3_PINSEL 1
#define PWM3_FUNC 1
#else
#define PWM3_PINSEL 0
#define PWM3_FUNC 0
#endif
#define DIO28_PINSEL PWM3_PINSEL
#define DIO28_FUNC PWM3_FUNC
#define DIO28_CHANNEL PWM3_CHANNEL
#define DIO28_MR PWM3_MR
#endif
#ifdef PWM4
#define PWM4_MR __mrreg__(PWM4_CHANNEL)
#if (PWM4_PORT == 1)
#define PWM4_PINSEL 2
#define PWM4_FUNC 2
#elif (PWM4_PORT == 2)
#define PWM4_PINSEL 1
#define PWM4_FUNC 1
#else
#define PWM4_PINSEL 0
#define PWM4_FUNC 0
#endif
#define DIO29_PINSEL PWM4_PINSEL
#define DIO29_FUNC PWM4_FUNC
#define DIO29_CHANNEL PWM4_CHANNEL
#define DIO29_MR PWM4_MR
#endif
#ifdef PWM5
#define PWM5_MR __mrreg__(PWM5_CHANNEL)
#if (PWM5_PORT == 1)
#define PWM5_PINSEL 2
#define PWM5_FUNC 2
#elif (PWM5_PORT == 2)
#define PWM5_PINSEL 1
#define PWM5_FUNC 1
#else
#define PWM5_PINSEL 0
#define PWM5_FUNC 0
#endif
#define DIO30_PINSEL PWM5_PINSEL
#define DIO30_FUNC PWM5_FUNC
#define DIO30_CHANNEL PWM5_CHANNEL
#define DIO30_MR PWM5_MR
#endif
#ifdef PWM6
#define PWM6_MR __mrreg__(PWM6_CHANNEL)
#if (PWM6_PORT == 1)
#define PWM6_PINSEL 2
#define PWM6_FUNC 2
#elif (PWM6_PORT == 2)
#define PWM6_PINSEL 1
#define PWM6_FUNC 1
#else
#define PWM6_PINSEL 0
#define PWM6_FUNC 0
#endif
#define DIO31_PINSEL PWM6_PINSEL
#define DIO31_FUNC PWM6_FUNC
#define DIO31_CHANNEL PWM6_CHANNEL
#define DIO31_MR PWM6_MR
#endif
#ifdef PWM7
#define PWM7_MR __mrreg__(PWM7_CHANNEL)
#if (PWM7_PORT == 1)
#define PWM7_PINSEL 2
#define PWM7_FUNC 2
#elif (PWM7_PORT == 2)
#define PWM7_PINSEL 1
#define PWM7_FUNC 1
#else
#define PWM7_PINSEL 0
#define PWM7_FUNC 0
#endif
#define DIO32_PINSEL PWM7_PINSEL
#define DIO32_FUNC PWM7_FUNC
#define DIO32_CHANNEL PWM7_CHANNEL
#define DIO32_MR PWM7_MR
#endif
#ifdef PWM8
#define PWM8_MR __mrreg__(PWM8_CHANNEL)
#if (PWM8_PORT == 1)
#define PWM8_PINSEL 2
#define PWM8_FUNC 2
#elif (PWM8_PORT == 2)
#define PWM8_PINSEL 1
#define PWM8_FUNC 1
#else
#define PWM8_PINSEL 0
#define PWM8_FUNC 0
#endif
#define DIO33_PINSEL PWM8_PINSEL
#define DIO33_FUNC PWM8_FUNC
#define DIO33_CHANNEL PWM8_CHANNEL
#define DIO33_MR PWM8_MR
#endif
#ifdef PWM9
#define PWM9_MR __mrreg__(PWM9_CHANNEL)
#if (PWM9_PORT == 1)
#define PWM9_PINSEL 2
#define PWM9_FUNC 2
#elif (PWM9_PORT == 2)
#define PWM9_PINSEL 1
#define PWM9_FUNC 1
#else
#define PWM9_PINSEL 0
#define PWM9_FUNC 0
#endif
#define DIO34_PINSEL PWM9_PINSEL
#define DIO34_FUNC PWM9_FUNC
#define DIO34_CHANNEL PWM9_CHANNEL
#define DIO34_MR PWM9_MR
#endif
#ifdef PWM10
#define PWM10_MR __mrreg__(PWM10_CHANNEL)
#if (PWM10_PORT == 1)
#define PWM10_PINSEL 2
#define PWM10_FUNC 2
#elif (PWM10_PORT == 2)
#define PWM10_PINSEL 1
#define PWM10_FUNC 1
#else
#define PWM10_PINSEL 0
#define PWM10_FUNC 0
#endif
#define DIO35_PINSEL PWM10_PINSEL
#define DIO35_FUNC PWM10_FUNC
#define DIO35_CHANNEL PWM10_CHANNEL
#define DIO35_MR PWM10_MR
#endif
#ifdef PWM11
#define PWM11_MR __mrreg__(PWM11_CHANNEL)
#if (PWM11_PORT == 1)
#define PWM11_PINSEL 2
#define PWM11_FUNC 2
#elif (PWM11_PORT == 2)
#define PWM11_PINSEL 1
#define PWM11_FUNC 1
#else
#define PWM11_PINSEL 0
#define PWM11_FUNC 0
#endif
#define DIO36_PINSEL PWM11_PINSEL
#define DIO36_FUNC PWM11_FUNC
#define DIO36_CHANNEL PWM11_CHANNEL
#define DIO36_MR PWM11_MR
#endif
#ifdef PWM12
#define PWM12_MR __mrreg__(PWM12_CHANNEL)
#if (PWM12_PORT == 1)
#define PWM12_PINSEL 2
#define PWM12_FUNC 2
#elif (PWM12_PORT == 2)
#define PWM12_PINSEL 1
#define PWM12_FUNC 1
#else
#define PWM12_PINSEL 0
#define PWM12_FUNC 0
#endif
#define DIO37_PINSEL PWM12_PINSEL
#define DIO37_FUNC PWM12_FUNC
#define DIO37_CHANNEL PWM12_CHANNEL
#define DIO37_MR PWM12_MR
#endif
#ifdef PWM13
#define PWM13_MR __mrreg__(PWM13_CHANNEL)
#if (PWM13_PORT == 1)
#define PWM13_PINSEL 2
#define PWM13_FUNC 2
#elif (PWM13_PORT == 2)
#define PWM13_PINSEL 1
#define PWM13_FUNC 1
#else
#define PWM13_PINSEL 0
#define PWM13_FUNC 0
#endif
#define DIO38_PINSEL PWM13_PINSEL
#define DIO38_FUNC PWM13_FUNC
#define DIO38_CHANNEL PWM13_CHANNEL
#define DIO38_MR PWM13_MR
#endif
#ifdef PWM14
#define PWM14_MR __mrreg__(PWM14_CHANNEL)
#if (PWM14_PORT == 1)
#define PWM14_PINSEL 2
#define PWM14_FUNC 2
#elif (PWM14_PORT == 2)
#define PWM14_PINSEL 1
#define PWM14_FUNC 1
#else
#define PWM14_PINSEL 0
#define PWM14_FUNC 0
#endif
#define DIO39_PINSEL PWM14_PINSEL
#define DIO39_FUNC PWM14_FUNC
#define DIO39_CHANNEL PWM14_CHANNEL
#define DIO39_MR PWM14_MR
#endif
#ifdef PWM15
#define PWM15_MR __mrreg__(PWM15_CHANNEL)
#if (PWM15_PORT == 1)
#define PWM15_PINSEL 2
#define PWM15_FUNC 2
#elif (PWM15_PORT == 2)
#define PWM15_PINSEL 1
#define PWM15_FUNC 1
#else
#define PWM15_PINSEL 0
#define PWM15_FUNC 0
#endif
#define DIO40_PINSEL PWM15_PINSEL
#define DIO40_FUNC PWM15_FUNC
#define DIO40_CHANNEL PWM15_CHANNEL
#define DIO40_MR PWM15_MR
#endif

#define PWM_LER                                                                \
  ((1 << PWM0_CHANNEL) | (1 << PWM1_CHANNEL) | (1 << PWM2_CHANNEL) |           \
   (1 << PWM3_CHANNEL) | (1 << PWM4_CHANNEL) | (1 << PWM5_CHANNEL) |           \
   (1 << PWM6_CHANNEL) | (1 << PWM7_CHANNEL) | (1 << PWM8_CHANNEL) |           \
   (1 << PWM9_CHANNEL) | (1 << PWM10_CHANNEL) | (1 << PWM11_CHANNEL) |         \
   (1 << PWM12_CHANNEL) | (1 << PWM13_CHANNEL) | (1 << PWM14_CHANNEL) |        \
   (1 << PWM15_CHANNEL))
#define PWM_ENA                                                                \
  ((1 << (9 + PWM0_CHANNEL)) | (1 << (9 + PWM1_CHANNEL)) |                     \
   (1 << (9 + PWM2_CHANNEL)) | (1 << (9 + PWM3_CHANNEL)) |                     \
   (1 << (9 + PWM4_CHANNEL)) | (1 << (9 + PWM5_CHANNEL)) |                     \
   (1 << (9 + PWM6_CHANNEL)) | (1 << (9 + PWM7_CHANNEL)) |                     \
   (1 << (9 + PWM8_CHANNEL)) | (1 << (9 + PWM9_CHANNEL)) |                     \
   (1 << (9 + PWM10_CHANNEL)) | (1 << (9 + PWM11_CHANNEL)) |                   \
   (1 << (9 + PWM12_CHANNEL)) | (1 << (9 + PWM13_CHANNEL)) |                   \
   (1 << (9 + PWM14_CHANNEL)) | (1 << (9 + PWM15_CHANNEL)))

