Paciente8159/uCNC/uCNC/src/hal/mcus/lpc176x/mcumap_lpc176x.h
#define UART2_PCONP __helper__(CLKPWR_PCONP_PCUART, UART2_PORT, )

#if ((UART2_PORT == 0) && (TX2_MBED_PIN == P0_2) && (RX2_MBED_PIN == P0_3))
#define UART2_ALT_FUNC 1
#define UART2_PCLKSEL_REG PCLKSEL0
#define UART2_PCLKSEL_MASK (3 << 6)
#elif ((UART2_PORT == 1) && (TX2_MBED_PIN == P0_15) && (RX2_MBED_PIN == P0_16))
#define UART2_ALT_FUNC 1
#define UART2_PCLKSEL_REG PCLKSEL0
#define UART2_PCLKSEL_MASK (3 << 8)
#elif ((UART2_PORT == 1) && (TX2_MBED_PIN == P2_0) && (RX2_MBED_PIN == P2_1))
#define UART2_ALT_FUNC 2
#define UART2_PCLKSEL_REG PCLKSEL0
#define UART2_PCLKSEL_MASK (3 << 8)
#elif ((UART2_PORT == 2) && (TX2_MBED_PIN == P0_10) && (RX2_MBED_PIN == P0_11))
#define UART2_ALT_FUNC 1
#define UART2_PCLKSEL_REG PCLKSEL1
#define UART2_PCLKSEL_MASK (3 << 16)
#elif ((UART2_PORT == 2) && (TX2_MBED_PIN == P2_8) && (RX2_MBED_PIN == P2_9))
#define UART2_ALT_FUNC 2
#define UART2_PCLKSEL_REG PCLKSEL1
#define UART2_PCLKSEL_MASK (3 << 16)
#elif ((UART2_PORT == 3) && (TX2_MBED_PIN == P0_0) && (RX2_MBED_PIN == P0_1))
#define UART2_ALT_FUNC 2
#define UART2_PCLKSEL_REG PCLKSEL1
#define UART2_PCLKSEL_MASK (3 << 18)
#elif ((UART2_PORT == 3) && (TX2_MBED_PIN == P0_25) && (RX2_MBED_PIN == P0_26))
#define UART2_ALT_FUNC 3
#define UART2_PCLKSEL_REG PCLKSEL1
#define UART2_PCLKSEL_MASK (3 << 18)
#elif ((UART2_PORT == 3) && (TX2_MBED_PIN == P4_28) && (RX2_MBED_PIN == P4_29))
#define UART2_ALT_FUNC 3
#define UART2_PCLKSEL_REG PCLKSEL1
#define UART2_PCLKSEL_MASK (3 << 18)
#else
#error "UART2 pin configuration not supported"
#endif

// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication
#define COM2_UART __helper__(LPC_UART, UART2_PORT, )
#define COM2_IRQ __helper__(UART, UART2_PORT, _IRQn)
#define COM2_PCLK __helper__(CLKPWR_PCLKSEL_UART, UART2_PORT, )
#define MCU_COM2_ISR __helper__(UART, UART2_PORT, _IRQHandler)

#define COM2_OUTREG (COM2_UART)->THR
#define COM2_INREG (COM2_UART)->RBR

#endif

// SPI
#if (defined(SPI_CLK) && defined(SPI_SDI) && defined(SPI_SDO))
#define MCU_HAS_SPI
#ifndef SPI_MODE
#define SPI_MODE 0
#endif
#ifndef SPI_FREQ
#define SPI_FREQ 1000000UL
#endif
#ifndef SPI_PORT
#define SPI_PORT 1
#endif

#define SPI_COUNTER_DIV(X) CLAMP(2, ((F_CPU >> 3) / X), 254)

#define SPI_REG __helper__(LPC_SSP, SPI_PORT, )
#define SPI_PCONP __helper__(CLKPWR_PCONP_PCSSP, SPI_PORT, )
#if (SPI_PORT == 0)
#define SPI_PCLKSEL_REG PCLKSEL1
#define SPI_PCLKSEL_MASK (3 << 20)
#else
#define SPI_PCLKSEL_REG PCLKSEL0
#define SPI_PCLKSEL_MASK (3 << 10)
#endif

#include "lpc17xx_gpdma.h"
#include "lpc17xx_ssp.h"

#if ((SPI_PORT == 0) && (SPI_SDO_MBED_PIN == P0_18) &&                         \
     (SPI_SDI_MBED_PIN == P0_17) && (SPI_CLK_MBED_PIN == P0_15))
#define SPI_ALT_FUNC 2
#elif ((SPI_PORT == 0) && (SPI_SDO_MBED_PIN == P0_24) &&                       \
       (SPI_SDI_MBED_PIN == P0_23) && (SPI_CLK_MBED_PIN == P0_20))
#define SPI_ALT_FUNC 3
#elif ((SPI_PORT == 1) && (SPI_SDO_MBED_PIN == P0_9) &&                        \
       (SPI_SDI_MBED_PIN == P0_8) && (SPI_CLK_MBED_PIN == P0_7))
#define SPI_ALT_FUNC 2
#else
#error "SPI pin configuration not supported"
#endif

#if (SPI_PORT == 0)
#define SPI_DMA_TX_CH 0
#define SPI_DMA_RX_CH 1
#else
#define SPI_DMA_TX_CH 2
#define SPI_DMA_RX_CH 3
#endif
#define SPI_DMA_TX_DEST __helper__(GPDMA_CONN_SSP, SPI_PORT, _Tx)
#define SPI_DMA_RX_DEST __helper__(GPDMA_CONN_SSP, SPI_PORT, _Rx)
#define SPI_DMA_TX_CHANNEL __helper__(LPC_GPDMACH, SPI_DMA_TX_CH, )
#define SPI_DMA_RX_CHANNEL __helper__(LPC_GPDMACH, SPI_DMA_RX_CH, )
#define MCU_SPI_ISR __helper__(SSP, SPI_PORT, _IRQHandler)
#define MCU_SPI_IRQ __helper__(SSP, SPI_PORT, _IRQn)

#endif

// SPI2
#if (defined(SPI2_CLK) && defined(SPI2_SDI) && defined(SPI2_SDO))
#define MCU_HAS_SPI2
#ifndef SPI2_MODE
#define SPI2_MODE 0
#endif
#ifndef SPI2_FREQ
#define SPI2_FREQ 1000000UL
#endif
#ifndef SPI2_PORT
#define SPI2_PORT 1
#endif

#define SPI2_COUNTER_DIV(X) CLAMP(2, ((F_CPU >> 3) / X), 254)

#define SPI2_REG __helper__(LPC_SSP, SPI2_PORT, )
#define SPI2_PCONP __helper__(CLKPWR_PCONP_PCSSP, SPI2_PORT, )
#if (SPI2_PORT == 0)
#define SPI2_PCLKSEL_REG PCLKSEL1
#define SPI2_PCLKSEL_MASK (3 << 20)
#else
#define SPI2_PCLKSEL_REG PCLKSEL0
#define SPI2_PCLKSEL_MASK (3 << 10)
#endif

#include "lpc17xx_gpdma.h"
#include "lpc17xx_ssp.h"

#if ((SPI2_PORT == 0) && (SPI2_SDO_MBED_PIN == P0_18) &&                       \
     (SPI2_SDI_MBED_PIN == P0_17) && (SPI2_CLK_MBED_PIN == P0_15))
#define SPI2_ALT_FUNC 2
#elif ((SPI2_PORT == 0) && (SPI2_SDO_MBED_PIN == P0_24) &&                     \
       (SPI2_SDI_MBED_PIN == P0_23) && (SPI2_CLK_MBED_PIN == P0_20))
#define SPI2_ALT_FUNC 3
#elif ((SPI2_PORT == 1) && (SPI2_SDO_MBED_PIN == P0_9) &&                      \
       (SPI2_SDI_MBED_PIN == P0_8) && (SPI2_CLK_MBED_PIN == P0_7))
#define SPI2_ALT_FUNC 2
#else
#error "SPI2 pin configuration not supported"
#endif

#if (SPI2_PORT == 0)
#define SPI2_DMA_TX_CH 0
#define SPI2_DMA_RX_CH 1
#else
#define SPI2_DMA_TX_CH 2
#define SPI2_DMA_RX_CH 3
#endif
#define SPI2_DMA_TX_DEST __helper__(GPDMA_CONN_SSP, SPI2_PORT, _Tx)
#define SPI2_DMA_RX_DEST __helper__(GPDMA_CONN_SSP, SPI2_PORT, _Rx)
#define SPI2_DMA_TX_CHANNEL __helper__(LPC_GPDMACH, SPI2_DMA_TX_CH, )
#define SPI2_DMA_RX_CHANNEL __helper__(LPC_GPDMACH, SPI2_DMA_RX_CH, )
#define MCU_SPI2_ISR __helper__(SSP, SPI2_PORT, _IRQHandler)
#define MCU_SPI2_IRQ __helper__(SSP, SPI2_PORT, _IRQn)

#endif

// I2C
#if (defined(I2C_CLK) && defined(I2C_DATA))
#define MCU_HAS_I2C
#define MCU_SUPPORTS_I2C_SLAVE

#ifndef I2C_PORT
#define I2C_PORT 0
#endif
#ifndef I2C_FREQ
#define I2C_FREQ 400000UL
#endif
#ifndef I2C_ADDRESS
#define I2C_ADDRESS 0
#endif

#ifndef USE_ARDUINO_WIRE
#define I2C_REG __helper__(LPC_I2C, I2C_PORT, )
#else
/**
 * This allows future implementations of other Wire ports
 * But for now the framework only implements Wire
 */
#define I2C_REG Wire
// #if (I2C_PORT == 0)
// #define I2C_REG Wire
// #else
// #define I2C_REG __helper__(Wire, I2C_PORT, )
// #endif
#endif
#define I2C_PCLK __helper__(CLKPWR_PCLKSEL_I2C, I2C_PORT, )
#define I2C_PCON __helper__(CLKPWR_PCONP_PCI2C, I2C_PORT, )

#include "lpc17xx_i2c.h"
#define I2C_ISR __helper__(I2C, I2C_PORT, _IRQHandler)
#define I2C_IRQ __helper__(I2C, I2C_PORT, _IRQn)

#if ((I2C_CLK_MBED_PIN == P0_28) && (I2C_DATA_MBED_PIN == P0_27) &&            \
     (I2C_PORT == 0))
#define I2C_ALT_FUNC 1
#elif ((I2C_CLK_MBED_PIN == P0_1) && (I2C_DATA_MBED_PIN == P0_0) &&            \
       (I2C_PORT == 1))
#define I2C_ALT_FUNC 3
#elif ((I2C_CLK_MBED_PIN == P0_20) && (I2C_DATA_MBED_PIN == P0_19) &&          \
       (I2C_PORT == 1))
#define I2C_ALT_FUNC 3
#elif ((I2C_CLK_MBED_PIN == P0_11) && (I2C_DATA_MBED_PIN == P0_10) &&          \
       (I2C_PORT == 2))
#define I2C_ALT_FUNC 2
#else
#error "I2C pin configuration not supported"
#endif
#endif

#ifndef ITP_TIMER
#define ITP_TIMER 0
#endif
#define ITP_TIMER_REG __helper__(LPC_TIM, ITP_TIMER, )
#define MCU_ITP_ISR __helper__(TIMER, ITP_TIMER, _IRQHandler)
#define ITP_INT_FLAG __helper__(TIM_MR, ITP_TIMER, _INT)
#define ITP_TIMER_IRQ __helper__(TIMER, ITP_TIMER, _IRQn)
#define ITP_PCONP __helper__(CLKPWR_PCONP_PCTIM, ITP_TIMER, )
#if (ITP_TIMER < 2)
#define ITP_PCLKSEL_REG PCLKSEL0
#else
#define ITP_PCLKSEL_REG PCLKSEL1
#endif
#define ITP_PCLKSEL_MASK                                                       \
  (3UL << (__helper__(CLKPWR_PCLKSEL_TIMER, ITP_TIMER, ) & 0x1F))

#define MCU_RTC_ISR SysTick_Handler

#ifndef SERVO_TIMER
#define SERVO_TIMER 1
#endif
#define SERVO_TIMER_REG __helper__(LPC_TIM, SERVO_TIMER, )
#define MCU_SERVO_ISR __helper__(TIMER, SERVO_TIMER, _IRQHandler)
#define SERVO_INT_FLAG __helper__(TIM_MR, SERVO_TIMER, _INT)
#define SERVO_TIMER_IRQ __helper__(TIMER, SERVO_TIMER, _IRQn)
#define SERVO_PCONP __helper__(CLKPWR_PCONP_PCTIM, SERVO_TIMER, )
#if (SERVO_TIMER < 2)
#define SERVO_PCLKSEL_REG PCLKSEL0
#else
#define SERVO_PCLKSEL_REG PCLKSEL1
#endif
#define SERVO_PCLKSEL_MASK                                                     \
  (3UL << (__helper__(CLKPWR_PCLKSEL_TIMER, SERVO_TIMER, ) & 0x1F))

