Paciente8159/uCNC/uCNC/src/hal/mcus/lpc176x/mcumap_lpc176x.h
#ifdef ONESHOT_TIMER
#define MCU_HAS_ONESHOT_TIMER
#define ONESHOT_TIMER_REG __helper__(LPC_TIM, ONESHOT_TIMER, )
#define MCU_ONESHOT_ISR __helper__(TIMER, ONESHOT_TIMER, _IRQHandler)
#define ONESHOT_INT_FLAG __helper__(TIM_MR, ONESHOT_TIMER, _INT)
#define ONESHOT_TIMER_IRQ __helper__(TIMER, ONESHOT_TIMER, _IRQn)
#define ONESHOT_PCONP __helper__(CLKPWR_PCONP_PCTIM, ONESHOT_TIMER, )
#if (ONESHOT_TIMER < 2)
#define ONESHOT_PCLKSEL_REG PCLKSEL0
#else
#define ONESHOT_PCLKSEL_REG PCLKSEL1
#endif
#define ONESHOT_PCLKSEL_MASK                                                   \
  (3UL << (__helper__(CLKPWR_PCLKSEL_TIMER, ONESHOT_TIMER, ) & 0x1F))
#endif

// Indirect macro access
#ifndef __indirect__
#define __indirect__ex__(X, Y) DIO##X##_##Y
#define __indirect__(X, Y) __indirect__ex__(X, Y)
#endif

#define mcu_config_output(diopin)                                              \
  {                                                                            \
    SETBIT(__indirect__(diopin, GPIOREG)->FIODIR, __indirect__(diopin, BIT));  \
    LPC_PINCON->__helper__(PINSEL, __indirect__(diopin, PINCON), ) &=          \
        ~(3 << ((__indirect__(diopin, BIT) & 0x0F) << 1));                     \
  }
#define mcu_config_output_od(diopin)                                           \
  {                                                                            \
    mcu_config_output(diopin);                                                 \
    LPC_PINCON->__helper__(PINMODE, __indirect__(diopin, PINCON), ) &=         \
        ~(3 << ((__indirect__(diopin, BIT) & 0x0F) << 1));                     \
    LPC_PINCON->__helper__(PINMODE, __indirect__(diopin, PINCON), ) |=         \
        (2 << ((__indirect__(diopin, BIT) & 0x0F) << 1));                      \
    LPC_PINCON->__helper__(PINMODE_OD, __indirect__(diopin, PORT), ) |=        \
        (1 << (__indirect__(diopin, BIT)));                                    \
  }

#define mcu_config_input(diopin)                                               \
  {                                                                            \
    CLEARBIT(__indirect__(diopin, GPIOREG)->FIODIR,                            \
             __indirect__(diopin, BIT));                                       \
    LPC_PINCON->__helper__(PINSEL, __indirect__(diopin, PINCON), ) &=          \
        ~(3 << ((__indirect__(diopin, BIT) & 0x0F) << 1));                     \
  }
#define mcu_config_pullup(diopin)                                              \
  {                                                                            \
    LPC_PINCON->__helper__(PINMODE, __indirect__(diopin, PINCON), ) &=         \
        ~(3 << ((__indirect__(diopin, BIT) & 0x0F) << 1));                     \
  }

#define mcu_config_af(diopin, mode)                                            \
  {                                                                            \
    LPC_PINCON->__helper__(PINSEL, __indirect__(diopin, PINCON), ) &=          \
        ~(3 << ((__indirect__(diopin, BIT) & 0x0F) << 1));                     \
    LPC_PINCON->__helper__(PINSEL, __indirect__(diopin, PINCON), ) |=          \
        (mode << ((__indirect__(diopin, BIT) & 0x0F) << 1));                   \
  }

#define mcu_config_analog(diopin)                                              \
  {                                                                            \
    mcu_config_input(diopin);                                                  \
    mcu_config_af(diopin, __indirect__(diopin, ALT_FUNC));                     \
    LPC_SC->PCONP |= CLKPWR_PCONP_PCAD;                                        \
    LPC_SC->PCLKSEL0 &= ~(3 << 24);                                            \
    LPC_ADC->ADCR &= ~(ADC_CR_START_MASK | ADC_CR_BURST | ADC_CR_PDN);         \
    LPC_ADC->ADCR |= ADC_CR_PDN;                                               \
    LPC_ADC->ADCR |=                                                           \
        ADC_CR_CH_SEL(__indirect__(diopin, CHANNEL)) | ADC_CR_CLKDIV(255);     \
    LPC_ADC->ADCR |= ADC_CR_BURST;                                             \
  }

#define mcu_config_input_isr(diopin)                                           \
  {                                                                            \
    SETBIT(LPC_GPIOINT->__indirect__(diopin, RISEREG),                         \
           __indirect__(diopin, BIT));                                         \
    SETBIT(LPC_GPIOINT->__indirect__(diopin, FALLREG),                         \
           __indirect__(diopin, BIT));                                         \
    NVIC_SetPriority(EINT3_IRQn, NVIC_INPUT_IRQ_Pri);                          \
    NVIC_ClearPendingIRQ(EINT3_IRQn);                                          \
    NVIC_EnableIRQ(EINT3_IRQn);                                                \
  }

#define mcu_config_pwm(diopin, freq)                                           \
  {                                                                            \
    mcu_config_output(diopin);                                                 \
    LPC_SC->PCONP |= CLKPWR_PCONP_PCPWM1;                                      \
    LPC_SC->PCLKSEL0 &= ~(3 << 12); /* div clock by 4 */                       \
    LPC_PWM1->IR = 0xFF & PWM_IR_BITMASK;                                      \
    LPC_PWM1->TCR = 0;                                                         \
    LPC_PWM1->CTCR = 0;                                                        \
    LPC_PWM1->MCR = 0;                                                         \
    LPC_PWM1->CCR = 0;                                                         \
    LPC_PWM1->PCR &= 0xFF00;                                                   \
    LPC_PWM1->LER |= (1UL << 0) | (1UL << __indirect__(diopin, CHANNEL));      \
    LPC_PWM1->PCR |= (1UL << (8 + __indirect__(diopin, CHANNEL)));             \
    LPC_PWM1->PR = ((F_CPU >> 10) / freq) - 1;                                 \
    LPC_PWM1->MCR = (1UL << 1);                                                \
    LPC_PWM1->MR0 = 255;                                                       \
    LPC_PWM1->TCR = (1UL << 3) | (1UL << 0);                                   \
    mcu_config_output(diopin);                                                 \
    mcu_config_af(diopin, (__indirect__(diopin, FUNC)));                       \
    mcu_set_pwm(diopin, 0);                                                    \
  }

#define mcu_get_input(diopin)                                                  \
  CHECKBIT(__indirect__(diopin, GPIOREG)->FIOPIN, __indirect__(diopin, BIT))
#define mcu_get_output(diopin)                                                 \
  CHECKBIT(__indirect__(diopin, GPIOREG)->FIOPIN, __indirect__(diopin, BIT))
#define mcu_set_output(diopin)                                                 \
  (__indirect__(diopin, GPIOREG)->FIOSET = (1 << __indirect__(diopin, BIT)))
#define mcu_clear_output(diopin)                                               \
  (__indirect__(diopin, GPIOREG)->FIOCLR = (1 << __indirect__(diopin, BIT)))
#define mcu_toggle_output(diopin)                                              \
  TOGGLEBIT(__indirect__(diopin, GPIOREG)->FIOPIN, __indirect__(diopin, BIT))
#define mcu_set_pwm(diopin, pwmvalue)                                          \
  {                                                                            \
    LPC_PWM1->__indirect__(diopin, MR) = pwmvalue;                             \
    LPC_PWM1->LER |= ((uint32_t)(((__indirect__(diopin, CHANNEL)) < 7)         \
                                     ? (1 << (__indirect__(diopin, CHANNEL)))  \
                                     : 0));                                    \
    LPC_PWM1->TCR |= ((uint32_t)(1 << 1));                                     \
    LPC_PWM1->TCR &= (~((uint32_t)(1 << 1))) & ((uint32_t)(0x0000000B));       \
  }
#define mcu_get_pwm(diopin) (uint8_t)LPC_PWM1->__indirect__(diopin, MR)

#define mcu_get_analog(diopin)                                                 \
  (uint16_t)(((LPC_ADC->__indirect__(diopin, ADDR)) >> 2) & 0x03FF)

extern volatile bool lpc_global_isr_enabled;
#define mcu_enable_global_isr __enable_irq
#define mcu_disable_global_isr __disable_irq
#define mcu_get_global_isr() (__get_PRIMASK() == 0u)
#define mcu_in_isr_context() (__get_IPSR() != 0)
#define mcu_free_micros()                                                      \
  ((uint32_t)((((SysTick->LOAD + 1) - SysTick->VAL) * 1000UL) /                \
              (SysTick->LOAD + 1)))

#ifdef MCU_HAS_ONESHOT_TIMER
#define mcu_start_timeout() (ONESHOT_TIMER_REG->TCR |= TIM_ENABLE)
#endif

#ifdef __cplusplus
}
#endif

#endif